{"organizations": [], "uuid": "5df9b99df5c5648b406a76956ecb8d93cd5502c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.crackingzilla.net", "main_image": "", "site_section": "http://www.crackingzilla.net/external.php?type=RSS2", "section_title": "CrackingZilla - Cracking Forum, Cracking Downloads, Cracking Tutorials, Premium Accounts", "url": "http://www.crackingzilla.net/showthread.php?t=406225", "country": "SE", "title": "Dan Kennedy - Mind Hijacking", "performance_score": 0, "site": "crackingzilla.net", "participants_count": 1, "title_full": "Dan Kennedy - Mind Hijacking", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T12:17:00.000+02:00", "replies_count": 0, "uuid": "5df9b99df5c5648b406a76956ecb8d93cd5502c9"}, "author": "upload113", "url": "http://www.crackingzilla.net/showthread.php?t=406225", "ord_in_thread": 0, "title": "Dan Kennedy - Mind Hijacking", "locations": [], "entities": {"persons": [{"name": "dan kennedy", "sentiment": "none"}, {"name": "steve jobs", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fbi", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "aac", "sentiment": "none"}, {"name": "influence control techniques", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "eBooks Dan Kennedy - Mind Hijacking If this is your first visit, be sure to check out the FAQ by clicking the link above. You may have to Register before you can post: click the register link above to proceed. To start viewing messages, select the forum that you want to visit from the selection below. This user has no status. VDRip | English | MP4 + MP3 + PDF Guides | 480 x 360 | AVC ~291 kbps | 29.970 fps AAC | 128 Kbps | 48.0 KHz | 2 channels | 19:15:38 | 5.21 GB Genre: eLearning Video / Business, Sales, Marketing Language: English Here's Your Invite To The Most Dangerous Product We've Ever Created - Straight From Dan Kennedy Mind Hijacking: Advanced, Psychology-Based Persuasion, Manipulation and Influence Control Techniques, For One-To-One Sales, Negotiation and Presenting That means you're hopefully already well aware of my prowess at persuading people to part with large sums of money, pay large fees, 'pledge allegiance' and behave like top-value customers and clients. You may have already heard a lot about this from me already and you're probably pretty damn good at it yourself too! I have already revealed a lot of my methods in different places, venues, products and at various times, but hard as it may be to believe, I've held a lot back as well! The sort of stuff that's too hot to handle for most people. Very specific hijacks and techniques I rely on to virtually erase people's free will, (without them knowing!) and substitute my control in its place. If that immediately disturbs you then this offer is not going to be for you, and it would be best if you just stopped reading right now. However, If This Doesn't Disturb Or Frighten You, Then Please Carry On Reading... I have quietly accumulated and used these Mind-Hijacking techniques personally, privately, in virtually every situation I've been in for many years, and have banked a whole lot of money. Often when people are surprised at themselves over parting with it! Let's dig in. Lots of 'masters' use some or all of these Mind Hijacking methods. Mind Hijacking is all about seizing, taking over, forcing people into a different direction. I'll be sharing some incredible information, including... - How Steve Jobs built a simple Mind Hijack into the Apple computer. And stole the PC Market from IBM. This trick factors into almost every piece of sales copy I've ever written - The 4-part formula used by sales agents of the FBI's security division behavioral program to recruit spies 'turn' terrorists and get people to violate confidences, reveal information and do as they are told. - How to hijack any closed society without ever needing to start at the bottom of the ladder and without having your authority questioned Unseat an accomplished, successful, person and make them feel unsure of themselves and in need of your support. And lots more!", "external_links": [], "published": "2017-03-01T12:17:00.000+02:00", "crawled": "2017-03-01T08:21:25.316+02:00", "highlightTitle": ""}