{"organizations": [], "uuid": "800923ec437c69a489416ea76485851116461497", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.anf1blog.com", "main_image": "", "site_section": "http://www.anf1blog.com/feed", "section_title": "An F1 Blog", "url": "http://www.anf1blog.com/sorry-pixel-laptop-lovers-google-not-working-on-an-upgrade/1497", "country": "", "title": "Sorry Pixel Laptop Lovers, Google Not Working On An Upgrade", "performance_score": 0, "site": "anf1blog.com", "participants_count": 1, "title_full": "Sorry Pixel Laptop Lovers, Google Not Working On An Upgrade", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T23:33:00.000+02:00", "replies_count": 0, "uuid": "800923ec437c69a489416ea76485851116461497"}, "author": "Anf1blog", "url": "http://www.anf1blog.com/sorry-pixel-laptop-lovers-google-not-working-on-an-upgrade/1497", "ord_in_thread": 0, "title": "Sorry Pixel Laptop Lovers, Google Not Working On An Upgrade", "locations": [], "entities": {"persons": [{"name": "osterloh", "sentiment": "none"}, {"name": "rick osterloh", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "mobile world congress", "sentiment": "none"}, {"name": "tb google drive", "sentiment": "none"}, {"name": "intel core", "sentiment": "none"}, {"name": "google store", "sentiment": "none"}, {"name": "google pixel", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "pixel chromebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sorry Pixel Laptop Lovers, Google Not Working On An Upgrade 1 March 2017 By Anf1blog Leave a Comment \nSad news for all the Pixel laptop lovers, Google has decided to discontinue with the Pixel Chromebook and will not be launching a third iteration of the device. \nThe news was announced by the company’s Rick Osterloh, Senior Vice President for Hardware, at the ongoing Mobile World Congress (MWC). Osterloh disclosed the information in a meeting with journalists. \nThe Pixel moniker is currently used for a new line of smartphones from the company i.e. the Google Pixel and Pixel XL. Both the devices are doing really well even though Google had issues with limited supplies of both the smartphones. \nWhen asked about the future predictions for the Pixel laptops, Osterloh said that they had “no plans to do one right now.” \nThe Pixel collection was introduced to show the public what a Chromebook would look like, and were never actually meant to be sold in such huge quantities. Initially, when it was first launched in 2013, the device retailed at $1,299 and the consumers could only run the Chrome browser on it. \nThe device featured some innovative technologies at the time of its release. For instance, the Pixel laptop was the first-ever laptop to feature a fully functional touchscreen along with a USB C-Type port, which was not available in any other device at the time. \nThe Pixel Chromebook was aspirational not only in terms of features but also for its hardware, which could inevitably compete with brands like Apple. \nOsterloh said that the Pixel laptops in the market were sold out completely and currently, the company has no plans to produce any more of these laptops. \nEven, the Google Store has no Pixel laptops up for sale in their website, though they have many third-party Chromebooks available. \nThough the company has no intentions of producing Pixel laptops, Google still holds the second position in the laptop market in the U.S. and the UK. \n“Regarding the future of Google-branded laptops (whether called Pixel or not), I should clarify that we don’t have any plans to discuss at this time,” confirmed Rick Osterloh, in response to the reports shared by TechCrunch. \nHis remarks indicate that the company may be dropping the Pixel name only, while laptops from the company will still be produced. \nThe original Pixel Chromebook was launched in 2013 with in-built features like a 12.85-inch display with a resolution of 2560 x 1700 pixels. The laptop came loaded with the third-gen Intel Core i5 processor, combined with internal storage capacity of 32 GB and 1 TB Google Drive storage for three years. \nThe second generation of the Pixel Chromebook was launched in 2014 and featured the fifth-gen Intel Core i5 or i7 processor. It also came with 32 GB or 64 GB internal storage capacity, 8 GB of RAM or 16 GB of RAM, as well as 1 TB Google Drive storage for three years.", "external_links": [], "published": "2017-03-01T23:33:00.000+02:00", "crawled": "2017-03-01T21:14:13.939+02:00", "highlightTitle": ""}