{"organizations": [], "uuid": "f947b18e7125971ab97ae95062ebaa218a992a7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cheapassignmentsolutions.wordpress.com", "main_image": "", "site_section": "https://cheapassignmentsolutions.wordpress.com", "section_title": "BUS 475 Business ans Society – Assignment Solutions", "url": "https://cheapassignmentsolutions.wordpress.com/2017/03/01/bus-475-business-ans-society", "country": "US", "title": "BUS 475 Business ans Society", "performance_score": 0, "site": "wordpress.com", "participants_count": 1, "title_full": "BUS 475 Business ans Society", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T14:36:00.000+02:00", "replies_count": 0, "uuid": "f947b18e7125971ab97ae95062ebaa218a992a7d"}, "author": "Dr. Jane", "url": "https://cheapassignmentsolutions.wordpress.com/2017/03/01/bus-475-business-ans-society", "ord_in_thread": 0, "title": "BUS 475 Business ans Society", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "labor and human rights health", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "apa", "sentiment": "none"}, {"name": "wikipedia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "According to the textbook, ongoing challenges in the global business environment are mostly attributed to unethical business practices, failure to embrace technology advancements, and stiff competition among businesses. Imagine that you have been appointed as Apple’s Chief Compliance Officer and must prepare a video presentation for Apple’s suppliers regarding Apple’s Supplier Code of Conduct to deliver via a web meeting. To prepare for your presentation, review Apple’s Supplier Code of Conduct, located at https://www.apple.com/supplier-responsibility/ . Next, use a tablet, smartphone, laptop, desktop, or traditional video recorder to record a maximum of a five to seven (5-7) minute dynamic video on Apple’s Code of Conduct. Alternatively, you may submit a four to six (4-6) page paper instead of the video submission.\nIn addition to the recorded video, you must also create a presentation using PowerPoint (or other equivalent software) summarizing the important changes and explanations regarding the code of conduct that you communicated in your video presentation to email to the suppliers after the meeting for future reference.\nYou must submit both parts of the assignment to receive full credit.\nNote: If you are using a tablet or smartphone you will need to email the video file to yourself, then save it to a computer in order to upload to Blackboard. You may want to upload your video to a file sharing service, such as Dropbox, if your email will not let you send a large video file. Dropbox is accessible from all smartphones and tablets from the Dropbox app.\nOnce you are ready to upload your video to Blackboard, view the Kaltura video tutorial found in your online course shell (Week 9).\nPlease use the following naming convention in the popup window for your video once it is finished uploading:\nTitle: Your First Name, Your Last Name – Challenges in the Business Environment Tags: BUS475, Business Environment Description: First Name, Last Name – BUS475 Assignment 2 (Date Uploaded ex. 11-14-2014) Part 1: Video Presentation OR Paper \nPrepare and present a video that is a maximum of five to seven (5-7) minutes OR write a four to six (4-6) page paper in which you:\nList specific changes that Apple has made to its Code of Conduct in recent years. Provide at least one (1) example of each change. Explain the identified changes to the suppliers in such a way that they will understand the standards that Apple requires in order to maintain their relationship with the company. Part 2: PowerPoint Presentation \nCreate a six to eight (6-8) slide PowerPoint presentation in which you:\nSummarize Apple’s Supplier Responsibility information. Discuss Apple’s stance on each of the following areas: Empowering workers Labor and Human Rights Health and Safety The Environment Accountability Identify the key ways that Apple’s Progress Report has changed since last year. Examine the manner in which Apple’s Supplier Code of Conduct helps the organization operate as a socially responsible organization. Provide detailed speaker notes of what you would say if you were delivering the presentation. Submit a reference page with at least two (2) quality references that you have used for this presentation / paper. Note: Wikipedia and other Websites do not qualify as academic resources. Your PowerPoint presentation must follow these formatting requirements:\nFormat the PowerPoint presentation with headings on each slide and three to four (3-4) relevant graphics (photographs, graphs, clip art, etc.), ensuring that the presentation is visually appealing and readable from 18 feet away. Check with your professor for any additional instructions. Include a title slide containing the title of the assignment, the student’s name, the professor’s name, the course title, and the date. The title and reference slides are not included in the required slide length. If you choose the written paper, your assignment must follow these formatting requirements:\nBe typed, double spaced, using Times New Roman font (size 12), with one-inch margins on all sides; citations and references must follow APA or school-specific format. Check with your professor for any additional instructions. Include a cover page containing the title of the assignment, the student’s name, the professor’s name, the course title, and the date. The cover page and the reference page are not included in the required assignment page length. The specific course learning outcomes associated with this assignment are:\nEvaluate the influences of changing economic, political, social, cultural, and technological forces on business and society. Use technology and information resources to research issues in business and society. Write clearly and concisely about business and society using proper writing mechanics. ", "external_links": [], "published": "2017-03-01T14:36:00.000+02:00", "crawled": "2017-03-01T09:37:15.669+02:00", "highlightTitle": ""}