{"organizations": [], "uuid": "dc2e220ff4bb0db1645b0cfc2e08d3b6e6a03486", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hearing-aid-news.com", "main_image": "", "site_section": "http://www.hearing-aid-news.com/feed", "section_title": "Hearing Aid NewsHearing Aid News | Hearing Aid News", "url": "http://www.hearing-aid-news.com/smart-earbuds-a-looming-threat-to-the-hearing-aid-market/", "country": "DK", "title": "Smart Earbuds: A Looming Threat to the Hearing Aid Market?", "performance_score": 0, "site": "hearing-aid-news.com", "participants_count": 1, "title_full": "Smart Earbuds: A Looming Threat to the Hearing Aid Market?", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T04:25:00.000+02:00", "replies_count": 0, "uuid": "dc2e220ff4bb0db1645b0cfc2e08d3b6e6a03486"}, "author": "admin", "url": "http://www.hearing-aid-news.com/smart-earbuds-a-looming-threat-to-the-hearing-aid-market/", "ord_in_thread": 0, "title": "Smart Earbuds: A Looming Threat to the Hearing Aid Market?", "locations": [], "entities": {"persons": [{"name": "futuresource", "sentiment": "none"}, {"name": "jelisejeva", "sentiment": "none"}, {"name": "alexa", "sentiment": "none"}, {"name": "nick hunn", "sentiment": "none"}, {"name": "bragi", "sentiment": "none"}, {"name": "hunn", "sentiment": "none"}, {"name": "hearphones", "sentiment": "none"}, {"name": "zlata jelisejeva", "sentiment": "none"}, {"name": "robert califf", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}, {"name": "zlata jelise", "sentiment": "none"}, {"name": "charles grassley", "sentiment": "none"}, {"name": "ramon llamas", "sentiment": "none"}, {"name": "bose", "sentiment": "none"}, {"name": "aditya kaul", "sentiment": "none"}, {"name": "tractica", "sentiment": "none"}, {"name": "youmans", "sentiment": "none"}, {"name": "eunice youmans", "sentiment": "none"}, {"name": "elizabeth warren", "sentiment": "none"}, {"name": "kaul", "sentiment": "none"}], "locations": [{"name": "tractica", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "md", "sentiment": "none"}, {"name": "airpods", "sentiment": "none"}], "organizations": [{"name": "international data corporation", "sentiment": "none"}, {"name": "motorola", "sentiment": "none"}, {"name": "wifore consulting", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "dsp", "sentiment": "none"}, {"name": "global market", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "futuresource consulting", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Smart Earbuds: A Looming Threat to the Hearing Aid Market? by admin on Feb 28, 2017 • 11:25 pm No Comments Smart earbuds—those cool, new devices consumers are using for noise cancellation, workout monitoring, phone calls, and more—are threatening the hearing aid market, according to some analysts. Figure. Earbuds, Hea… Essentially, the technology behind the products is so advanced, analysts say, that consumers may soon have a hard time distinguishing between a custom hearing aid prescribed by an audiologist and earbuds that they can pick up on Amazon. On a technical level, smart earbuds “are converging with hearing aids,” said Zlata Jelisejeva, research analyst at Futuresource Consulting. “They are becoming wireless, and, therefore, have an integrated power source; have integrated microphones; increasingly include smarter ambient noise control, suppression, and isolation; and they are shrinking in size.” Figure. Zlata Jelise… Sumant Ugalmugale, research lead at Global Market Insights, agreed: “Technologically advanced hearables based on digital signal processing (DSP) offer a plethora of advantages over traditional hearing aids. These new products are functionally versatile and technically more efficient than traditional counterparts. Moreover, they provide better amplification, noise control and are cosmetically more acceptable.” Bose, for example, has been test-marketing what it calls “Hearphones”—$499 earbuds that enable a listener to tune out background noise in a crowded restaurant while amplifyng the conversation of nearby dinner companions. Bose spokesperson Eunice Youmans stressed that the company does not see Hearphones as a hearing aid, but instead as a personal sound amplification device (PSAP). “Bose customers have been writing to us for decades requesting that we apply our industry-leading audio- and noise-canceling technologies in a product that will help people hear better,” Youmans said. “Ultimately, Bose hopes to substantially improve the lives of underserved people who have hearing loss by changing the paradigm for better hearing while creating a major new growth business.” Given that many people begin considering hearing aids when listening to conversations in noisy settings becomes difficult, Bose’s distinction between hearing aids and PSAPs may be lost on everyday consumers who are simply looking for devices to help them hear better. Meanwhile, cross-over products may also get a boost from the U.S. Congress and the FDA. In December 2016, Sens. Elizabeth Warren and Charles Grassley introduced a bill that would allow hearing aids to be sold over-the-counter to consumers who self-diagnose their condition. Also in the same month, the FDA issued a new guidance that allows adults to buy hearing aids without a medical evaluation. Plus, the FDA also said it is weighing the creation of a new, low-cost category of over-the-counter hearing aids. “The guidance will support consumer access to most hearing aids while the FDA takes the steps necessary to propose to modify our regulations to create a category of OTC hearing aids that could help many Americans improve their quality of life through better hearing,” said FDA Commissioner Robert Califf, MD. OPPOSING VIEWS Fortunately for audiologists, not all analysts agree that the smart earbuds market and hearing aids market will blur. “Smart earbuds and hearing aids are separate markets in my opinion,” said Aditya Kaul, research director at Tractica. “Hearing aids are medical wearables. Smart earbuds are consumer- oriented. There could be hearing-enhanced features for smart earbuds, but I would be surprised if they would be used as a medical prescription earbud solution.” Figure. Aditya Kaul… Ramon Llamas, research manager, wearables, at the International Data Corporation added: “Right now, no smart earbuds company I know of has the aim of competing in the hearing aid market. Still, I would keep a watchful eye.” Nick Hunn, analyst at WiFore Consulting, is decidedly on the fence regarding any blurring of the hearing aids and smart earbuds markets. Granted, he sees the potential for smart earbud technology to muscle in on traditional hearing aids. Figure. Nick Hunn… But he also recognized that hearing aids, a medical product overseen by the FDA and nurtured as an exclusive market by audiologists and hearing aid manufacturers for decades, is not an easy market to crack. “The medical market model is one reason that personal sound amplification devices—devices that provide sound amplification but without the ability to be a medical grade hearing aid—have struggled in the market,” Hunn said. “Whether or not the industry is disrupted, there is no doubt that there is a massive untapped market for hearing aids,” Hunn added. “Humanity’s relatively recent addiction to music—and particularly to loud music—is leading to a major future problem. Hearing loss is set to be the new diabetes.” ENTER TECH GOLIATHS While it will be some time before we’ll know if smart earbuds will forever change the way audiologists make a living, tech goliaths Samsung and Apple are already “all in” when it comes to the new technology—and they’re already driving the market. Early in 2016, Samsung introduced its smart earbuds, Gear Iconx, which offers a built-in, 4GB music player, fitness tracker, and a heart rate monitor. And just before the close of 2016, Apple fired back with its Airpods, smart earbuds that features wireless music, phone calling, and an onboard, wireless microphone that provides users voice access to Apple’s digital personal assistant, Siri. Unlike many other smart earbud products still in development at smaller start-up companies, the products by Apple and Samsung are relatively unambitious. But even so, simply the entry of the two titans into the smart earbuds market stole much of the limelight—and momentum—from a plethora of crowdfunded smart earbuds startups, said Hunn. The result: Many of these small startups are now scrambling to release products that are either much more multifaceted than what Apple and Samsung are offering, or offer an extremely sophisticated version of a single high-end application—such as an extremely sophisticated noise cancellation system—according to Hunn. “The crowdfunded companies now face competition from industry heavyweights like Apple and Samsung,” Hunn says. “If these majors see demand, they will catch-up (technologically)” with the smaller startups. “Apple and Samsung have the opportunity to drive the category more than others,” says Futuresource’s Jelisejeva. “Samsung’s Gear Iconx is already a best-seller across several online retailers worldwide.” Currently on the market and in the crosshairs of the big guns is startup Bragi. It offers the Dash, an extremely sophisticated pair of smart earbuds that come equipped with a range of biometric sensors. Those sensors are designed to work with the Dash’s application processor, which is available to third-party software developers looking to create apps that will work with the processor and onboard sensors. If that’s not enough, the Dash also offers an internal music player, internal microphone, and gesture control. “I personally like Bragi,” said Tractica’s Kaul. “Bragi, in my opinion, offers the best smart earbuds available in today’s market, with support for a wider range of voice-enabled personal assistants, including Siri, Alexa, Google Now, and Cortana.” Jelisejeva added: “Perhaps Bragi’s Dash is the most prominent product in the market because they were first-movers and could be credited with launching this category. It remains the only product with significant ‘standalone’ functionality—meaning consumers can leave their mobile device at home” and rely on the Dash instead. Other smart earbuds already on the market and worthy of note include: * Earin M-1 Earbuds, a straight, hi-end wireless audio product; * Motorola Verve Ones+, which offer high-end audio and voice access to Siri and Google Now; and * Earato Apollo 7, which offers high-end music, phone calling, and voice access to Siri and Google Now, according to Global Market’s Ugalmugale. In the long-term, Hunn said it’s anyone’s guess if the dreams of at least some of the crowdfunded startups survive the marketing clout of Samsung and Apple. But if they do, consumers can look forward to some extremely fun ear candy. MORE ‘EAR CANDY’ MEETS TECHNOLOGY LifeBeam, for example, is working on smart earbuds they hope to equip with artificial intelligence. It’s a combination that promises to expertly monitor a sports workout, then provide customized coaching on-the-fly. “If it works, it could grow the market,” Hunn said. Equally advanced would be Doppler’s Here One, which promises to offer Bluetooth music streaming, as well as the ability to remix the sound one hears at a concert to your preference. Another feature being developed for Here One is real-time language translation—a feat, which if accomplished, would bar you forevermore from uttering, “It’s Greek to me.” Interestingly, Doppler is not the only earbud company working on on-the-fly language translation. “A startup called Pilot ran a campaign for an earbud capable of real-time translation, which raised over $3 million,” Hunn said. “As with all successful crowdfunded campaigns, it fired the starting pistol for others to say they could do it better,” Hunn said. He also noted the recent crowdfunded smart earbud, SOUND, which promises sleep monitoring features, over 12 hours of battery life, and skin-sensitive materials. WHAT’S AHEAD? Tractica’s Kaul has a different take on the direction of the industry: “The future of smart earbuds is closely linked with voice-enabled personal assistants. Amazon’s Alexa has already shown us how voice can be a powerful interface to interact with web applications and the Internet of things.” Specifically, Kaul says consumers should look for “a blend of voice and touch, with earbuds becoming a complementary interface with which you can give commands, do your email, get news updates, perform search, get directions,” and handle other tasks. Kaul also predicted many smart earbuds could have cellular connectivity in two or three years, “which will make them ideal companions for fitness or other activities—like going for a night out and leaving your phone behind. “There could also be combinations of smart watches with cellular connectivity that connect to a smart earphone to enhance its capabilities,” he added. “AirPods plus the Apple Watch is where this could possibly end up.” “For the next few years, earbuds can probably best be described as an experiment–but one which, if it attracts users, could balloon,” said Hunn. “If one manufacturer gets it right, they could eat into the headphone market.”", "external_links": [], "published": "2017-03-01T04:25:00.000+02:00", "crawled": "2017-03-01T04:38:12.701+02:00", "highlightTitle": ""}