{"organizations": [], "uuid": "c41f1c17815dca01850947fb27ed3a0a45367173", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "vestact.blogspot.com", "main_image": "", "site_section": "http://vestact.blogspot.com/", "section_title": "Money with a dash of Funny", "url": "http://vestact.blogspot.com/2017/03/bigger-than-naspers.html", "country": "US", "title": "Bigger than Naspers", "performance_score": 0, "site": "blogspot.com", "participants_count": 1, "title_full": "Bigger than Naspers", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T16:00:00.000+02:00", "replies_count": 0, "uuid": "c41f1c17815dca01850947fb27ed3a0a45367173"}, "author": "vestact (noreply@blogger.com)", "url": "http://vestact.blogspot.com/2017/03/bigger-than-naspers.html", "ord_in_thread": 0, "title": "Bigger than Naspers", "locations": [], "entities": {"persons": [{"name": "paul", "sentiment": "none"}, {"name": "byron", "sentiment": "none"}, {"name": "mediclinic", "sentiment": "none"}, {"name": "didi chuxing", "sentiment": "none"}, {"name": "steinhoff", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "sasha", "sentiment": "none"}, {"name": "zika", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "jozi", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "eiffel tower", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "naspers", "sentiment": "none"}, {"name": "opentable", "sentiment": "none"}, {"name": "bidcorp", "sentiment": "none"}, {"name": "amazon and facebook", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "amazon web services", "sentiment": "none"}, {"name": "marriott international", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "priceline", "sentiment": "none"}, {"name": "jse", "sentiment": "none"}, {"name": "hammerson", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "tencent", "sentiment": "none"}, {"name": "anglogold ashanti", "sentiment": "none"}, {"name": "amplats", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "tripadvisor", "sentiment": "none"}, {"name": "hilton", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "priceline.com", "sentiment": "none"}, {"name": "bidvest", "sentiment": "none"}, {"name": "hyatt hotels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"The stock price is around 1700 Dollars a share. Not surprisingly, the stock is up nearly 3000 percent in ten years. What? Yes, the company now has a market capitalisation in excess of 80 billion Dollars. It may well be the biggest holding company that you have never heard of. In fact, the market cap is bigger than Naspers, quite a lot bigger in fact. The company has delivered compounded gross profit growth rates over the last five years of 35 percent.\" \n\nTo market to market to buy a fat pig Stocks in Jozi were lower by the close, down over two-thirds as a collective, resource stocks and specifically gold miners were looking a little worse for wear. Down over three and on-quarter of a percent as a collective they were, gold stocks. There were spits and spots of green, some of the Rand hedges benefitting from a weakening Rand environment. Hammerson, BATS and Mediclinic at the top of the leaderboard, at the opposite end of the spectrum was Redefine, AngloGold Ashanti and Amplats. There were results from the JSE themselves, they certainly looked decent enough to me. Over ten years that stock is up 190 percent. Amazing, not so? Still, the market capitalisation is \"only\" 14 billion Rand, Famous Brands by comparison is 15 and a half billion Rand. Chips and burgers trump derivatives and options. Not really, you know what I mean. \n\nBidvest slid another five percent, since their (and Bidcorp) results there has certainly been a pretty big divergence between the two. The lower growth environment here in South Africa is not really \"helpful\" for Bidvest. They are more than a good company, whether or not they are correctly priced at 23 odd times earnings, I am not convinced. I wouldn't go so far as to say that it is a screaming sell, there are better options out there for my mind. Talking of which, Steinhoff had a quarterly trading update that \"looked good\" at face value. See below in the company segment. \n\n\n\nIt wasn't to be, the Dow Jones industrial average did not make it 13 in a row, which would have tied the record for most days up in a row. Stocks slipped marginally in New York, New York, the broader market S&P 500 fell one-quarter of a percent. The nerds of NASDAQ slipped nearly two-thirds of a percent. Target was flamed, the stock was down over 12 percent after weak numbers and weak guidance. The stock looks cheaper, it may well get cheaper. Other retailers sank in sympathy. Hey, Amazon Web Services were out last evening, that caused a few flutters and reminded us that even the best doesn't work all of the time. \n\n\n\nCompany corner \n\nSteinhoff numbers yesterday morning (and afternoon), this was for the quarter ending December 2016 . This is a 300 billion Rand market cap business, sizeable indeed. Of course the business is now listed in the Frankfurt, this is the secondary listing down here. I think that access to cheaper capital and growth in emerging market (as well as looking for opportunities in developed markets) is more important. \n\nTheir listing there, with the backing of big German institutional money makes for favourable reading, from a funding point of view. That is what I think when they made the comment that shares in issue had been stable, I suspect that it will stay that way. There is a *nice* colourful slide for us to use here: \n\n\n\nThat pretty much sums up the business right there. What Steinhoff have done well over the last half a decade is realise that in the space that they operate in, there were cheap assets that nobody else wanted at the time. They recognised that after the financial crisis there were opportunities that may have only presented themselves once in a decade, or generation for that matter. Through the bumbling of the European sovereign issues, the company found a foothold in Europe and will continue to build on their huge base. \n\nBe patient here, I know that the share price has not rewarded you over the last year (down 20 percent). It looks cheap at these levels and is showing signs of \"bedding down\" (no pun intended) their recent acquisitions. The risk of course is that they enter \"a deal too far\" territory. Beds and sofas, kettles and white goods are certainly not the most appealing and dynamic products, that is for sure. We continue to add to the stock of a company that we think has a dynamic and quality management team, searching for perfection. \n\n\n\nPriceline presented numbers for their fourth quarter and full year to end December , close of business Monday. For the full year, the group had gross travel bookings (total dollar value, generally inclusive of all taxes and fees, of all travel services purchased by its customers, net of cancellations) of 68.1 billion Dollars, 23.1 percent better than the prior year. Gross profit was 10.3 billion Dollars, 20 percent better than the year prior. Non-GAAP income grew 23 percent to 3.3 billion Dollars, per diluted share, non-GAAP net income was 65.63 Dollars. Yes, per share, there are only 49 million odd shares (13 million too in treasury, what!!) in issue. \n\nNet income per diluted share was 14 percent lower to 42.65 Dollars. Reason being that Priceline took a non-cash charge in the 3rd quarter related to OpenTable, a business they bought for 2.6 billion Dollars in 2014. 941 million Dollars, gulp. Shouldn't have paid that premium! \n\nThe stock price is around 1700 Dollars a share. Not surprisingly, the stock is up nearly 3000 percent in ten years. What? Yes, the company now has a market capitalisation in excess of 80 billion Dollars. It may well be the biggest holding company that you have never heard of. In fact, the market cap is bigger than Naspers, quite a lot bigger in fact. The company has delivered compounded gross profit growth rates over the last five years of 35 percent. Incredible. \n\nIn case you were wondering who and what this massive business is, you know their Booking.com platform (Michael said he wasn't too familiar with it until he bought the share, I almost fell off my chair), they have multiple others, priceline.com, KAYAK, agoda.com, Rentalcars.com and OpenTable. You may have used some, I have. I couldn't find a rental once, I used priceline.com directly, it worked perfectly. Except I forgot my drivers licence at home, that is another story! This business is very valuable for all the stakeholders in the tourism industry, they have the ability to connect the dots better than ever. Ever old traditional insiders (travel agents) have their own platforms, enabling them to have a wider scope than before. \n\nAs per the annual report: \"As of December 31, 2016, Booking.com offered accommodation reservation services for over 1,115,000 properties in over 220 countries and territories on its various websites and in over 40 languages, which includes over 568,000 vacation rental properties ... Vacation rentals generally consist of, among others, properties categorized as single-unit and multi-unit villas, apartments, \"aparthotels\" (which are apartments with a front desk and cleaning service) and chalets which are generally self-catered (i.e., include a kitchen), directly bookable properties.\" \n\nIn other words, people would be willing to advertise on both AirBNB and Booking.com, as far as I understand it, there is no exclusivity. Interestingly, the company lists their competitors as Google, Apple, Alibaba, Tencent, Amazon and Facebook, and then a whole lot more, from TripAdvisor to Marriott International, Hilton and Hyatt Hotels. They also list Lyft, Uber and Didi Chuxing, in the cars space. So there is a lot of seasonality to their business, and there are multiple competitors too. They do own some great brands and try and keep at the forefront of technological advances in travel. \n\nThere is another sentence that makes you wonder if humanity is ever going to advance, these are broad based risks that could impact on any business: \"In addition, other unforeseen events beyond our control, such as worldwide recession, oil prices, terrorist attacks, unusual or extreme weather or natural disasters such as earthquakes, hurricanes, tsunamis, floods, droughts and volcanic eruptions, travel-related health concerns including pandemics and epidemics such as Ebola, Zika, Influenza H1N1, avian bird flu, SARS and MERS, political instability, regional hostilities, imposition of taxes or surcharges by regulatory authorities, changes in trade or immigration policies or travel-related accidents, can disrupt travel or otherwise result in declines in travel demand.\" \n\nWow. Reach for the pills. \n\nThe company stuck out a guidance that seems to have been below the market expectations , remembering that this is the 1st quarter. In other words, not the holiday season, that comes in the second half of the year, July through to December: \n\n\n\nThe stock rallied hard, up over five percent to another all time high of 1725 Dollars a share. The stock trades on 40 times earnings, it is hardly cheap. What the company has going for them is the shift to experiences over things. i.e. People want to spend their money to see the Taj Mahal, the Eiffel Tower, the Statue of Liberty and all of the other amazing places around the world, over \"things\". Although, I get that they must still have the latest technology in order to take the pics and selfies. There is plenty of growth left here in order to justify even accumulating the stock at these levels, remembering that they may display volatile price action on such a high rating (November 2015 Paris attacks, the stock got hammered). \n\nNotwithstanding what are always headwinds that humanity faces (mostly made by themselves), there are more people with more resources that want to see the rest of the world, experience different cultures and eat different authentic food. I suspect that we may only be scratching the surface globally with this travel trend. We stay the course here. \n\n\n\nHome again, home again, jiggety-jog. Stocks across Asia are better than yesterday, US stock futures are better than before the Trump speech, which look short on substance. Mind you, give me a speech that contains all that and we would probably fall asleep having to listen to it. \n\n\nSent to you by Sasha, Byron and Michael on behalf of team Vestact. Email us \n\nFollow Sasha , Michael , Byron , Bright and Paul on Twitter \n\n078 533 1063 ", "external_links": [], "published": "2017-03-01T16:00:00.000+02:00", "crawled": "2017-03-01T11:28:44.633+02:00", "highlightTitle": ""}