{"organizations": [], "uuid": "9a6a64bc705a11be025eaa91ba28e6a0a6839d2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bookriot.com", "main_image": "https://2982-presscdn-29-70-pagely.netdna-ssl.com/wp-content/uploads/2017/02/riverdale-jughead.jpg", "site_section": "http://bookriot.com/feed/", "section_title": "BOOK RIOT", "url": "http://bookriot.com/2017/03/01/aroacejugheadorbust/", "country": "US", "domain_rank": 31828, "title": "#AroAceJugheadOrBust: An Ace/Aro Jughead in Riverdale", "performance_score": 0, "site": "bookriot.com", "participants_count": 1, "title_full": "#AroAceJugheadOrBust: An Ace/Aro Jughead in Riverdale", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T18:30:00.000+02:00", "replies_count": 0, "uuid": "9a6a64bc705a11be025eaa91ba28e6a0a6839d2e"}, "author": "Nicole Brinkley", "url": "http://bookriot.com/2017/03/01/aroacejugheadorbust/", "ord_in_thread": 0, "title": "#AroAceJugheadOrBust: An Ace/Aro Jughead in Riverdale", "locations": [], "entities": {"persons": [{"name": "cole sprouse", "sentiment": "none"}, {"name": "ian flynn", "sentiment": "none"}, {"name": "derek", "sentiment": "none"}, {"name": "mark waid", "sentiment": "none"}, {"name": "katie", "sentiment": "none"}, {"name": "sabrina", "sentiment": "none"}, {"name": "waid", "sentiment": "none"}, {"name": "jughead", "sentiment": "none"}, {"name": "marguerite sauvage", "sentiment": "none"}, {"name": "archie", "sentiment": "none"}, {"name": "erica cameron", "sentiment": "none"}, {"name": "sabrina the teenage witch", "sentiment": "none"}], "locations": [{"name": "riverdale", "sentiment": "none"}], "organizations": [{"name": "archie comics", "sentiment": "none"}, {"name": "riverdale tv", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "03-01-17 \nJughead doesn’t need a harem of women. \nIf you’re not keeping up with what’s happening in the extended canon of Riverdale, this is likely a sentence you never expected to read. After all, Jughead in the old-school Archie comics was the goofy side character who loved to eat food and had no interest in romance or sex, and Jughead in the rebooted Archie comics is a delightful side character with his own ongoing series who loves to eat food and has no interest in romance or sex. \nAnd that is, of course, where a problem arises. Jughead #15 variant cover by Marguerite Sauvage, issue by Mark Waid, Ian Flynn, and Derek Charm \nIn an upcoming issue of Jughead – a silly crossover issue spearheaded by Mark Waid – readers find out (thanks to both the covers and Archie Comics’ official blurb on their website) that Sabrina the Teenage Witch tries to “do something nice for Jughead” but accidentally makes him “the most desired bachelor in town.” This is after Jughead explicitly tells Sabrina he’s not interested in anybody romantically. \nThis is after Jughead is explicitly established as asexual. \nThis is after Jughead explicitly states he’s not interested in relationships, making him aromantic, though without ever using the label. \nThere will some who will argue that Jughead’s asexuality is a newly established thing – in the comic world, things like that get upturned all the time. Right? But as author Erica Cameron reminded me on Twitter, in the original run of the Archie comics, there’s a story about Jughead entering a food eating contest and another school sending a girl to distract him and ruin his appetite – a plan that horribly fires because he has zero interest in girls and instead uses all the food she brings him as a warm-up to the competition. \n(I’m also going to ignore previously acephobic comments made by Waid, though they inform his decisions, and focus on the Jughead’s current ongoing canon and what this means as an aroace character and to aro, ace, and aroace readers.) \nBased on the blurb, throughout the issue – one riddled with boring cliches; frankly, the “women are magically interested in this character” is an overdone and unoriginal story on the best day – Jughead is forced to repeatedly rebuff romantic and sexual advances of multiple women, some of whom he considered his friends, after he has explicitly stated repeatedly that he’s not interested in either sex or romantic relationships. It doesn’t matter if Sabrina learns that what she did is wrong; based on the blurb alone, Jughead’s asexuality and aromanticism is treated as a gag, something to magically fix and something to laugh at. \nAromantics have described what Jughead is forced to go through in his story with Sabrina as “torture”– both for the character and as readers. Trying to force romantic advances on somebody not interested in romance or trying to force sexual advances on somebody not interested in sex – without their consent, when they have stated their orientation multiple times – is the grossest violation of their identity and completely disrespectful. It is an active erasure of everything they are. \nIt is an active erasure of who and what Jughead is. \nI am on the asexual spectrum, though not aromantic. This plotline upsets me.But it does not surprise me. \nAsexual and aromantic erasure is the norm, not the exception. In the ongoing Riverdale TV series, a show whose inclusive representation has otherwise been praised, both aspects of Jughead’s character have been competely erased with no intention of reinstating them (though actor Cole Sprouse has been very vocal about his fight to get Jughead an asexual coming-out plot). Most asexual and aromantic people don’t even know that there are words for how they identify and often consider themselves – and are still often considered by others –“broken” despite nothing being wrong with them. Image credit:: Katie Yu/The CW \nConsidering how well the first volume of Jughead established Jughead’s identity, I would have hoped that Archie Comics would fight for his representation throughout all of the ongoing series, even the goofy crossover issues. But this continual failure to respect Jughead’s identity isn’t only dismissive to their beloved character – it’s a failure to respect all of their asexual and aromantic readers. \nAnd asexual and aromantic readers deserve respect. \nYou can support Jughead’s aromanticism and asexuality, as well as his aromantic and asexual fans, by sharing the hashtag #AroAceJugheadOrBust. Sign up for The Stack. Get awesome comics content delivered straight to your inbox. We're giving away a pair of Apple's fancy new AirPods (which are an audiobook lover's dream). Enter here for a chance to win , or just click the image below:", "external_links": [], "published": "2017-03-01T18:30:00.000+02:00", "crawled": "2017-03-01T15:23:52.025+02:00", "highlightTitle": ""}