{"organizations": [], "uuid": "b53e05a83fceb79a63d224a78168047094aea622", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "medium.com", "main_image": "", "site_section": "https://www.medium.com/feed/tag/tech", "section_title": "Tech on Medium", "url": "https://medium.com/tech-telecom-news/tech-telecom-news-1-mar-2017-c5d842ecb0e6", "country": "US", "domain_rank": 380, "title": "Tech / Telecom news — 1 Mar 2017", "performance_score": 0, "site": "medium.com", "participants_count": 1, "title_full": "Tech / Telecom news — 1 Mar 2017", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T13:40:00.000+02:00", "replies_count": 0, "uuid": "b53e05a83fceb79a63d224a78168047094aea622"}, "author": "Stevie Winwood", "url": "https://medium.com/tech-telecom-news/tech-telecom-news-1-mar-2017-c5d842ecb0e6", "ord_in_thread": 0, "title": "Tech / Telecom news — 1 Mar 2017", "locations": [], "entities": {"persons": [{"name": "fox", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "tech / telecom", "sentiment": "negative"}, {"name": "mwc", "sentiment": "none"}, {"name": "cisco", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "intelsat", "sentiment": "none"}, {"name": "softbank", "sentiment": "none"}, {"name": "ericsson", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "telecom infrastructure project", "sentiment": "none"}, {"name": "espn", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}, {"name": "sk telecom", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "netflix", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tech / Telecom news — 1 Mar 2017 PRODUCTS & SERVICES Video YouTube, which this week announced viewership numbers on the way to surpass traditional TV, is preparing a subscription ($35/month) live (+on demand) TV service aimed at cord cutters (“great content in a non traditional setting”), with a “skinny bundle” of more than 40 TV networks, including CBS, Fox, ESPN ( Story ) Enterprise A blow for AWS reputation yesterday, with a few hours of service outage affecting hundreds of thousands of websites, including Netflix, some Apple services, and even the US SEC. No significant stock reaction yet, but this could hurt Amazon’s share in public cloud, and even slow down companies’ migration to this model ( Story ) Relatively good 4Q16 for Salesforce, which achieved a better than expected growth of +29% in “deferred” revenues (billings in advance of subscription services), and +26% in total 2016 revenue, to $8.39bn. However, net loss widened and the guidance for 1Q17 was weaker so the share price was falling down yesterday ( Story ) AT&T at the MWC mentioned network virtualisation technology as a tool creating opportunities for the company to sell B2B services beyond their network footprint, with its Business Solutions CEO claiming that they now can offer safe access to the cloud “over-the-top”, and “it doesn’t have to be on own transport” ( Story ) Devices Apple’s next iPhone is now expected to adopt a curved OLED display from Samsung, as they’ve already ordered sufficient components for mass production. This would enable a significant change in the device design, something that has been revealed as a driver for Chinese customers (a key market) to renew their phones ( Story ) NETWORK TECHNOLOGY SoftBank is spending $1.7bn to combine its currently own satellite company OneWeb with Intelsat, and retain a 40% ownership. The aim is to offer cheap global internet access, with an innovative, hybrid approach involving satellites at high altitudes (from Intelsat) and newer, low-orbit ones (from OneWeb) ( Story ) Facebook claims to be succeeding with its Telecom Infrastructure Project in making the telecom industry advance faster, and in particular in connecting startups with innovative ideas with established operators. And they mentioned the example of both BT and SK Telecom launching “ecosystem acceleration centres” ( Story ) At MWC, Ericsson defended the case for 5G beyond Fixed Wireless (an uncertain but obviously beneficial scenario for mobile only players). They view a fully Mobile 5G from the beginning, merging current Fixed and Mobile networks, and mentioned network slicing (e.g. to accommodate video broadcast) as a key feature ( Story ) BIG DATA & ARTIFICIAL INTELLIGENCE The UK government is about to publish a digital strategy document which puts AI at the center of the policy discussions, seen as an opportunity for growth of the overall economy, but also as a challenge in workforce skills. The draft proposes partnerships with tech firms (Google, Cisco, HP, IBM, BT) to help with the training ( Story ) FINANCE Snap’s shares expected to have high volatility after IPO, as lack of voting rights from public shares will reduce investors’ stickiness to the stock. So even if there could be good demand at start, from people looking for exposure to fast revenue growth, these could turn back if shares “don’t show performance pretty quickly” ( Story )", "external_links": [], "published": "2017-03-01T13:40:00.000+02:00", "crawled": "2017-03-01T08:53:06.257+02:00", "highlightTitle": ""}