{"organizations": [], "uuid": "35d6d6c7f08e30fbd557b5e9fad4a4472057e421", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "a-new-hope4u.blogspot.com", "main_image": "", "site_section": "http://a-new-hope4u.blogspot.com/", "section_title": "new hope", "url": "http://a-new-hope4u.blogspot.com/2017/02/google-alert-microsoft_109.html", "country": "", "title": "Google Alert - microsoft", "performance_score": 0, "site": "blogspot.com", "participants_count": 1, "title_full": "Google Alert - microsoft", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T08:08:00.000+02:00", "replies_count": 0, "uuid": "35d6d6c7f08e30fbd557b5e9fad4a4472057e421"}, "author": "Murali s (noreply@blogger.com)", "url": "http://a-new-hope4u.blogspot.com/2017/02/google-alert-microsoft_109.html", "ord_in_thread": 0, "title": "Google Alert - microsoft", "locations": [], "entities": {"persons": [{"name": "bill gates", "sentiment": "none"}, {"name": "amy hood", "sentiment": "none"}], "locations": [{"name": "rochester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "microsoft", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "monthly service variety microsoft", "sentiment": "none"}, {"name": "accenture", "sentiment": "none"}, {"name": "coindesk jpmorgan", "sentiment": "none"}, {"name": "zdnet microsoft", "sentiment": "none"}, {"name": "bbc news google", "sentiment": "none"}, {"name": "skype", "sentiment": "none"}, {"name": "sun google", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}, {"name": "zdnet both apple", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "polygon gamestop", "sentiment": "none"}, {"name": "linkedin", "sentiment": "none"}, {"name": "credit suisse", "sentiment": "none"}, {"name": "xerox", "sentiment": "none"}, {"name": "forbes microsoft", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}, {"name": "axios microsoft", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "microsoft As-it-happens update ⋅ March 1, 2017 NEWS Xbox Game Pass: Microsoft to Launch Netflix-Style $10 Monthly Service Variety Microsoft this spring will roll out a \"Netflix for games\" subscription service — Xbox Game Pass, priced at $10 per month — with unlimited access to ... Microsoft Takes Aim At PlayStation Now With Netflix-Like Xbox Game Pass - Forbes Microsoft announces Xbox Game Pass, Netflix-style gaming for the Xbox One (update) - Polygon GameStop shares sank 8 percent on Tuesday after Microsoft unveiled a new attack on the used ... - Business Insider Full Coverage Flag as irrelevant Google, Microsoft and Amazon Joust At WSJ's Cloud Conference Forbes Cloud computing is big and getting bigger. Executives from Google, Microsoft and Amazon were willing to agree on that much, in a series of ... Flag as irrelevant Bad bug found in Microsoft browsing code BBC News Google has released details of a bug in Microsoft's browsing programs that would allow attackers to build websites that make the software crash. Google discloses flaw in Microsoft's browsers - Axios Microsoft bug could let hackers hijack PC owners internet browsers, Google researchers claim - The Sun Google reveals ANOTHER high-severity Microsoft bug - Komando Full Coverage Flag as irrelevant Microsoft focused on LinkedIn revenue Seeking Alpha Microsoft's (NASDAQ:MSFT) ambitious acquisition of LinkedIn is about revenue growth, not cost savings, CFO Amy Hood said at the Morgan Stanley ... Flag as irrelevant Microsoft , Intel, banks form Enterprise Ethereum blockchain alliance ZDNet Microsoft , Intel, Accenture, and more than two dozen banks and other companies have formed an alliance to use the Ethereum blockchain code. Microsoft Adds JPMorgan's 'Quorum' Blockchain to Azure Platform - CoinDesk JPMorgan, Microsoft , BP, UBS, Credit Suisse, Intel, and more are forming a new blockchain alliance - Business Insider Full Coverage Flag as irrelevant Microsoft to discontinue Skype WiFi as of March 31 ZDNet In June 2015, Microsoft officials confirmed the company was working to roll out an updated and rebranded version of Skype WiFi that was called ... Microsoft to discontinue Skype Wi-Fi service - ComputerWeekly.com Full Coverage Flag as irrelevant Bill Gates just solved the very first Apple vs. Microsoft fanboy debate BGR Apple and Microsoft each played a key role in the proliferation of personal computers, and both brands formed very loyal fan bases that constantly ... Bills Gates: Apple, Microsoft copied Xerox - Rochester Democrat and Chronicle Full Coverage Flag as irrelevant BA, Apple and Microsoft are the top business suppliers in the UK's Superbrands 2017 survey ZDNet Both Apple and Google dropped two places in the Consumer rankings, while Microsoft - which was 20th last year - dropped out. It was replaced by ... Flag as irrelevant Microsoft might owe you $100 after leaky receipt cock-up The INQUIRER SHOPPED AT a brick and mortar and Microsoft Store? The company may well owe you $100. A class action lawsuit raised in the great state of Florida, ... Microsoft will pay $1.2M to settle class-action suit over misprinted retail store receipts - AppleInsider (press release) (blog) Full Coverage Flag as irrelevant Microsoft's latest Windows 10 test build supports ability to block non-Store apps ZDNet On February 28, Microsoft released the latest Windows 10 Creators build -- No. 15046 -- to Fast Ring PC testers.As Microsoft is expected to begin ... Microsoft opens Data Insights Summit 2017 registration - MSPoweruser Full Coverage Flag as irrelevant See more results | Edit this alert You have received this email because you have subscribed to Google Alerts . Unsubscribe | View all your alerts Receive this alert as RSS feed Send Feedback ", "external_links": [], "published": "2017-03-01T08:08:00.000+02:00", "crawled": "2017-03-01T04:10:15.260+02:00", "highlightTitle": ""}