{"organizations": [], "uuid": "f3d1ea733a0c66e06a853df9f3d1e0308ca2e6ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.earthclinic.com", "main_image": "http://www.earthclinic.com/images/logo-fb.png", "site_section": "http://feeds.feedburner.com/EarthClinic", "section_title": "Recent Posts from Earth Clinic", "url": "https://www.earthclinic.com/cures/blepharitis.html", "country": "US", "domain_rank": 34889, "title": "Castor Oil For Blepharitis", "performance_score": 0, "site": "earthclinic.com", "participants_count": 0, "title_full": "Castor Oil For Blepharitis", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T02:27:00.000+02:00", "replies_count": 0, "uuid": "f3d1ea733a0c66e06a853df9f3d1e0308ca2e6ff"}, "author": "", "url": "https://www.earthclinic.com/cures/blepharitis.html", "ord_in_thread": 0, "title": "Castor Oil For Blepharitis", "locations": [], "entities": {"persons": [{"name": "barrington", "sentiment": "none"}, {"name": "matt c", "sentiment": "none"}, {"name": "ri", "sentiment": "none"}, {"name": "blepharitis", "sentiment": "none"}, {"name": "doreen", "sentiment": "none"}, {"name": "bhephasol", "sentiment": "none"}, {"name": "maryalice", "sentiment": "none"}, {"name": "jessica", "sentiment": "none"}, {"name": "helen", "sentiment": "none"}, {"name": "circuitrider", "sentiment": "none"}, {"name": "marj", "sentiment": "none"}, {"name": "kerri", "sentiment": "none"}, {"name": "max", "sentiment": "none"}, {"name": "dear priya", "sentiment": "none"}, {"name": "eugene", "sentiment": "none"}, {"name": "ali", "sentiment": "none"}, {"name": "elaine", "sentiment": "none"}], "locations": [{"name": "r.i.", "sentiment": "none"}, {"name": "blephasol", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "az", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "mesa", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "epsom", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "tx", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "montrose", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "deer park", "sentiment": "none"}, {"name": "moorfields", "sentiment": "none"}, {"name": "mississauga", "sentiment": "none"}, {"name": "r.i.", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "lexington", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "west hollywood", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "bayside", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "tasmania", "sentiment": "none"}], "organizations": [{"name": "phelps", "sentiment": "none"}, {"name": "tablespoons apple", "sentiment": "none"}, {"name": "bleph ex", "sentiment": "none"}, {"name": "ec", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "warwick", "sentiment": "none"}, {"name": "epsom", "sentiment": "none"}, {"name": "middlesex uk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Natural Cures for Blepharitis Feb 28, 2017 Blepharitis is generally a very uncomfortable eye condition; however, you can treat it. Castor oil, coconut oil, and tea tree oil are three of the best natural cures, but there are other effective options. What Is Blepharitis? \nBlepharitis is a condition that involves inflammation of the eyelids. The inflammation is generally caused by an infection that results as a malfunction in the oil glands located at the base of your eyelashes. If you have blepharitis, youâll likely experience a variety of symptoms including watery or red eyes, a gritty or burning sensation in your eyes, itchy eyelids, greasiness in your eyelids, crusting of your eyelashes, and light sensitivity. Can I Treat Eye Inflammation Naturally? \nWe advise at least seeing a doctor to determine the cause and severity of your condition; however, following diagnosis, you can typically treat blepharitis naturally. Castor oil, coconut oil, and tea tree oil are a few of the best natural remedies for blepharitis; however, there are a variety of others as well. It is also important to keep your eyes clean and to apply warm, moist heat to them each morning and evening. 1. Castor Oil \nCastor oil is an effective treatment to relieve inflammation in your eyes. This treatment option also helps relieve itching, irritation, burning, and pain associated with the condition. To use this remedy, apply the oil all over your eyelids and eyelashes using a cotton ball or soft swab. You can also add a couple of drops of the oil to your eyes to prevent crust formation. The best time to apply this treatment is at night right before you head to bed. 2. Coconut Oil \nCoconut oil is instrumental for treating pain and irritation in your eyes. This oil contains a variety of nutrients including fats that help restore eye health and reduce inflammation. To apply this remedy, soak a cotton swab in the oil and place it on your inflamed eyelids, leaving it there for approximately 20 minutes. Try to apply this treatment at least 2-3 times a day to prevent flare-ups in your symptoms. 3. Tea Tree Oil \nTea tree oil helps treat the underlying cause of blepharitis as well as your symptoms. This option also helps reduce inflammation and itching. To apply this treatment, you will need to dilute the tea tree oil by mixing a couple of drops of tea tree oil with a couple of drops of vegetable oil. Then, soak a cotton swab in the oil and place it over your eyelid for 15 minutes. Continue reading below for more natural remedies for blepharitis or share one of your own with us! Apple Cider Vinegar Â Posted by One Red Bug Eye (Van, Bc) on 09/10/2015 \nBlepharitis: \n10 min ACV EYE BATH 3x/day for 3 days: Submersion: 2 Tablespoons Apple Cider Vinegar in one large salad bowl of warm water. \nPut side of face in water bowl to keep breathing through corner of mouth, submerse eye, blink open while looking different directions to cover all areas. \nCured red bug eye with pussy node at bottom of eyelash sandy feel at tear duct. Eye was glued shut in AM from crust. \nNote: Wore eyepatch to alleviate nocturnal scratching. Posted by Doreen (Middlesex Uk) on 12/20/2015 Worked Temporarily \nWhen you use Baby Shampoo for cleaning eyelids for blepharitis, it must be NO TEARS Baby Shampoo. \nI found this tedious. My symptoms have worsened. The burning is like strong soap in my eyes. Running eyes and a lot of pain in the night. I can't open my eyes and they are very sticky and stuck together. I am now going to try Bhephasol (multi buy ) through Amazon, and eye gel (also multi buy) 3 in all and try this. Consistency is the key to any successful treatment. And then I will tailor down what I do to see how manageable my condition is. Cleansing the eyelids is the key to treatment. Somewhere, Europe 12/21/2015 \nDoreen, read up on Castor Oil for the eyes (some people just put it on the eyelid, not into the eye). \nAnd some people are helped by applying honey. Write a review Posted by Elaine (Los Angeles, California) on 04/10/2016 \nI have had blepharitis for many years. I can't count all the treatments my opthalmologist prescribed. Everything he gave me either didn't work, made my eyes sore or made me sick. Recently, I tried the treatment advised on Earth Clinic for dry eye and found it has cleared up the blepharitis. About two weeks ago, I started dabbing my eye lids with a solution of 1/2 cup distilled water with 1/2 tsp. baking soda. I do this with my eyes closed. When they are dry, I redo. At first I was doing this 3 times per day. Now I just do it regularly morning and night. All the crusts that would form overnight are just about gone. My eyes are less sensitive to light, grittyness is gone, and my vision is improving. And, best of all, my eyes feel really good. Apparently, baking soda alkalizes and germs can't live in an alkaline environment. Hope this helps someone. Write a review Posted by Max (Bayside, Ny) on 10/26/2009 \nBlepharitis-prevention. I have not had it in over 5 years. AM-I lie down and put a warm washcloth on eyes. Leave it there for 10 minutes. Shower and put the warm washcloth on my eyes while standing up for 3o seconds. Rub eyes with washcloth 7 x back and forth.Put baby shampoo on eyes and wash for 30 seconds. Rinse. Done. PM-I take a shower and repeat shower instructions. No meds needed greatest prevention. Phoenix, Arizona 04/13/2012 \nWhat a frustrating condition! I was a fool when I was younger and used an incredibly strong product to remove my eye makeup and oh, it did the job! As well as beginning the onset of my insanely frustrating issues with blepharitis! For at least 3 years I struggled with this condition and the only thing that I could find to clear it up was a prescribed topical, but it would only last for a short while before coming back full force. I tried everything! It wasn't until I was doing research and saw some info about baby shampoo being gentle and helping out people with this condition. I had already tried everything and was willing to try anything else, so I gave it a go and it was wonderful! I not only washed my eyelids with baby shampoo daily, but I moisturized my eyelids and the skin under my eyes with baby lotion right afterward. Sometimes I use different variations of the lotion, like the night-time baby lotion or I'll mix the creamy baby oil with the baby lotion and use that.. But I always make sure to use a baby lotion product and it's absolutely fabulous! It has been at least 5 years since I've had to deal with blepharitis! I continue to incorporate the baby shampoo (which removes eye makeup like a charm by the way! ) and lotion into my daily regimen. Other than it keeping that horrible condition away (which is enough reason in itself to use the baby products) - I attribute it to my lack wrinkles around my eyes when all of my friends my age have them. I hope this combination helps someone else out there as it has me! :) Mesa, Az 08/11/2013 \nI completely back up the baby shampoo comment. I use coconut oil, though, and take particular care to not put any of my other skin regimen on my eyelids. Before the shampoo, coconut oil, hot compresses, and occasionally topical antibiotic mixed with cetaphil soap- my eye-lid was SO bad that even philosophy miracle worker burned it. I remember a scab on my eyelid. It was so bad that I had to stop my latisse. Any one with this problem should try any and all of the above remedies, along with the other posters suggestions. Warwick, R.i. 01/02/2014 \nI have been dealing with this since October. I had it years ago and it never got past redness part. I felt like I had something in my eyes, they burned, when I cry it makes it worse so I don't cry and believe me I would like to! It started in one eye, then went to the other and now both. Some days it feels like it is going away and the next its back. \nI have oily eyelids, flaking and then peeling gross skin off my eye area, redness, soreness, itchiness, eyelashes here and there fall out and an ache or pain in my eye. \nMy Dr. gave me at first eye drops, ointment, but it didn't seem to clear and then I went on an oral antibiotic and just did the ointment and I have OTC drops. I went back 2 days before Christmas and he said looks good, the next day I started getting tough skin in the eye area and then it flaked and peeled off and it was gross. I am on a new eye ointment and one oral antibiotic a day. \nI have too much going on I don't need another issue. I think that is all for now. I know now I am not alone, but it still stinks. Somewhere, Europe 01/03/2014 \nKerri, some have had relief from dabbing Castor oil on the eyelids nightly, and some have done so with honey. Warwick, RI 01/05/2014 \nI use an eye ointment at night now. How am I supposed to use the castor oil or the honey? I just find it strange putting honey there. How do you do it and how much? I am fed up with everything. The other day I thought it was clearing and then bam! It is back. My skin is tight again and it is going to start to peel. This isn't a way to start the New Year off. Somewhere, Europe 01/06/2014 \nKerri, the only way I have seen it (honey or castor oil) applied, is dabbing it ON the eyelids, not INSIDE the eye. It probably works a bit slower than inside the eye, but to me it sounds safer. I imagine you can dab it on during the day and wash it off in an hour or so. Warwick, R.I. 01/06/2014 \nWell I will try that. I have to give my Dr a call because I am so tired of this. Warwick, R.i. 01/10/2014 \nOkay I saw my eye Dr. again the other day. I was told that this blepharitis has to do with the weather and that it is common. Why do I get all this crappy stuff? I was told to use the Systane drops a few times a day and to use the Tobramax (I think I spelled it right) all around my eyes. This thing has got me so irritable and moody and I can't cry because it hurts! I don't know if I can post pics here or not and don't see a link. I told someone I feel like/look like a reptile zombie. It is all red, sore, peely/blistery and I look horrible! I want it to ease already. :-( Wb, Nj 01/11/2014 \nHi Kerri, I don't know if your medication has steroids in it, but if it does or if you have ever used a product with steroids in it please do a search for \"international topical steroid awareness network\", their forum has a section on steroid induced eye irritations, or \"topical steroid addiction\", or \"topical steroid withdrawal\". Good luck. Warwick, R.i. 01/11/2014 \nThis is what I am on; TOBRADEX? (tobramycin and dexamethasone ophthalmic suspension) is a sterile, multiple dose antibiotic and steroid combination for topical ophthalmic use. \nBetween what I read online and what dr's say or don't say I get scared. I am not feeling good on top of this today. I am beginning to think my obgyn could help me better! \nI don't see the email to send photos. \nEC : It's on the contact us page: ec1(at)earthclinic(dot)com Wb, Nj 01/12/2014 \nHi Kerri, can your doctor offer you a non-steroid medication? Some people are very sensitive to steroids and have a very bad reaction. Unfortunately, most doctors will not acknowledge that steroids are not a wonder drug for everyone. Please search and read about other people's eye experiences with steroids. You may or may not identify with what you read, but if it is a bad reaction steroids it will only get worse as long as you use the steroids. Think back to what ointment you have used around your eyes - did it have a steroid in it? From what you posted it sounds like a bad reaction to steroids. I think you should look into this possibility. There is a usually a long healing period with multiple flares where you get worse again before you get better. Good luck! Tn 05/06/2015 \nI have read in one of the books that using steroids near the eyes can cause catarach so be careful, instead I am using the coconut oil around my eyelids at night before I go to bed, it helps some. Lexington, Ky 06/25/2015 \nI have been suffering from blepharitis for years and finally there is a professional in-office treatment for it. It is called Bleph EX, the doctor cleans your lids under microscope with a special tool. You will get your before and after pictures, the difference is astonishing. I am symptoms free and finally not embarrassed by my appearance. 10/30/2015 \nHello, \nCan I ask you how long you have to use the baby shampoo mix before seeing any results? I've just started cleaning lids with that mixture. Just after doing it my eyes feel fine but the gritty feeling and soreness comes back after half an hour. Thanks. Replied by Mama To Many Ă Mama To Many \nMAMA TO MANY, CONTRIBUTING WRITER \nThe always kind and thoughtful Mama to Many has been posting on Earth Clinic since 2011. \nABOUT MAMA \nMam to Many is a 46 year old mama to 9 children, ages 2-20. She began studying natural health when her first child was born. Finding success with some simple home remedies motivated her to continue to study and learn more about natural healing. Over the years she has learned a variety of way to use herbs, activated charcoal, essential oils, Apple Cider Vinegar, and nutrition to benefit the health of her family. She has a particular fondness for remedies that are simple, safe, inexpensive, and available to everyone, even (and especially) to those with limited financial resources or access to health care. Mama feels very blessed when given the opportunity to comfort and help those who are suffering. Mama to Many has always loved children and taught in public school before having children of her own. She currently lives on a small farm in Tennessee with her husband, children and a variety of animals, including cows, goats, chickens, cats and a very large dog. She finds it satisfying to treat her animals with natural remedies whenever possible as well. Close 10/30/2015 \nDear Priya, \nI think raw honey or manuka honey would be safer than baby shampoo. Many have found it cures blepharitis. \n~Mama to Many~ West Hollywood 11/10/2016 \nBlephX treatment is a gimmic, I know, I work with my doctor that does it, They are all shocked. How patients even pay for this treatment. But these patients are suffering so they would do anything to help them feel better, this treatment uses saline and some tea tree oil with a rotating brush to clean the lids, that's all but they charge a LOT of money for it you can do yourself at home. Blepharitis Triggers Â Posted by Jessica (Va) on 03/29/2016 \nThe dry eye/blepharitis market is a 4 billion dollar industry and growing. Considering that it is possible to contract the bacteria that causes some forms of blepharitis is it possible that patients are contracting blepharitis during eye exams? This would also explain the dramatic increase in the prevalence of the problem. I never had any symptoms associated with blepharitis until approximately two weeks after my routine eye exam. From that point on I have been suffering with MGD/blepharitis. As I recall that day, I did not see the physician, nor assistance wash their hands. They also used the same bottle of drops to dilate pupils on several patients. I am convinced that I, and many others contracted blepharitis at the hands of our health care professionals. Mpls, Mn 12/20/2016 \nI agree. I never had any eyelid swelling or eyelash loss, nada, zip. The dr convinced me I had to put plugs in to be prescribed a dry eye medication as he insisted I had (which I don't believe I did have because I never had any indication or symptoms). I was there for a regular exam! Turned out my insurance did not require this to decide whether I needed dry eye formula or not. I was furious because my eyes were a complete mess with a lot of swelling under and upper lids both. This was five years ago and to this day I have nothing but misery with my eyes. I have some days they are symptom free but this is short lived. I have tried everything and whenever I've went in for advice on this they get worse. I'm completely done with that and refuse any treatments, just check my eyes and let me go! I insist they wipe off all of the equipment before exams. \nI put a gate on my bedroom door to keep my dog out and this has been helpful somewhat. I will say that we have had dogs for 35+ years and I never reacted to them, they are a hypo allergenic breed. I was just reading a gal insisted to try borax for eyelash loss as she explains it is a mite. This is what the eye clinic did say and that some people are \"just allergic\" to it. Well I highly doubt some are just allergic to it after getting an exam and turning up with it. I am going to try the borax and see how that works. Right now I use a clean warm washcloth on them at least 3 times a day and wash them with a gentle cleanser. Write a review Posted by Marj (Deer Park, Ny) on 02/28/2017 \nI had painful dry eye/blepharitis. Went to a dry eye \"expert\" and went back and forth with all kinds of prescriptions that I am sure made things worse. After over a year of that nonsense, I did this: \nI put a heated gel mask over my eyes when I woke up and before I went to bed. That helped \"melt\" the plugged up gunk clogging the oil glands on my lash line. Importantly, after warming up the lash line for about 15 minutes, I washed my eyelids with baby shampoo. That helped to further break up and dissolve the gunk build up. Finally, the third part of this process is to take a dot of castor oil (organic, hexane free, cold pressed), and swipe your eyelids with it. \nMy eyes felt better immediately. It took a week or so to see an uninflamed eye margin. Since my gunk is all cleared out, I only use the castor oil. I swipe my eyelids with it before I go to bed. My eyes are perfect. I've been back to the dry eye \"expert\" for a complete exam to see if the castor oil might be doing something bad to the insides of my eyes or something. No. They are perfect. \nI will never stop putting a drop on my lash line every night. Honestly, when I was suffering with dry eye, I thought I would have it forever. I was depressed. I couldn't wear eye makeup for a year. My eyes hurt like hell just from air! I was constantly putting drops in my eyes. That helps the symptom temporarily. For me, the cause was clogged up oil glands related to my lashes. Why that happened in the first place, I have no idea. But now, I am fine. If anyone can take what I've shared and heal themselves as I have, I'd be real happy about that. Good luck!!!! Reply Posted by Kathryn4 (Maryland) on 01/18/2016 \nCastor oil for blepharitis - I am sure it was beneficial for me short term, but I had to stop it completely as it made my eyes red around the skin area. Reply Posted by Maryalice (Eugene, Or) on 09/27/2013 \nI tried putting castor oil in my eyes for a couple weeks. At first, I thought it was working, but then my eyelids became puffier. Very sad this did not work, because at first my eyes themselves felt so much better. I am 43 and I thought I was relatively healthy - not on any prescriptions, but for some reason I have not had any luck with getting rid of this blepharitis/dry eye issue. I even moved from SW Colorado to Eugene, OR for more moisture! I may try the castor oil again, but would love if someone would post additional remedies - homeopathy, herbs, etc. Also, my blepharitis is just redness, I can't see any scaling, but it does cause red, dry eyes.... doesn't help that I am a computer programmer. Montrose, Co 02/10/2015 \nMaryalice, how weird. I live in SW Colorado and am moving to Oregon soon to be near 2 of my kids. I just got Blepharitis the first time last year and today is the third time I've had this annoying condition. I keep it at bay by using a lotion I have with tea tree oil as the main ingredient. I went to Arizona over the weekend and did not bring my lotion. Guess what I woke up to Monday morning? Mississauga, Ontario 08/03/2016 \nBlepharitis treatment using castor oil. Do you wash the castor oil off your eyelids the next morning and do you also wash out your eyes with water due to putting a drop of oil in them the night before. Nervous about this treatment. Reply Posted by Matt C (Phelps, Ny) on 07/09/2011 \nI have tried the hot towel method with no results. It is too hard to maintain the heat and moisture at the levels needed. What I have found effective is using castor oil; I found a good video on youtube that elaborates. Eureka, Ca, 95501 12/11/2011 \nI also had terrible eye pain-mucus, redness, unbearable itchiness.... I thought it was pink-eye, except for it lasted 11 days!! So I finally saw an opthomologist who diagnosed me with Blepharitis (super irritated angry eyelids that don't produce enough oil). \nThe eyedrops he gave me worked alright; but my eyes would still \"flare up\" and become extremly irritated. My eyes always seemed to have a red tinge to them-which really really annoyed me. \nI tried castor oil, and after only a few nights it seemed to provide a lot of relief! I use a cotton swab to dab the oil on my eyelids, and drop a few drops into my actual eye before bed. It does blur your vision a bit, so before bed is the best option. \n:D Southwest, Missouri 01/20/2014 \n(I hope folks are not using drugstore castor oil processed with hexane. Hexane can cause blindness so everyone be sure to use only hexane free castor oil from the health food store or online.) \nCastor oil has only very slightly helped my eyes. I've noticed that my symptoms are usually held at bay while I'm wearing foundation and either putting fresh foundation on before bed usually works at keeping it under control. However, this winter it's been worse than ever and so I've been washing with baby shampoo and using psoriasis lotions very lightly around my eyes (burns like the dickens for a few minutes) which helps tremendously but hasn't completely relieved it. I've also noticed when I eat fungus promoting foods like I did last night, it's absolutely horrible by morning (no matter what I put on my eyelids before bed) with much more redness, swelling, itching, burning etc than usual. Those foods would be sugar and grains for starters. I had popcorn and chocolate last night and I'm paying for it this morning!! Barrington, Ri 01/02/2015 \nHow do I know what the castor oil is processed with? It says 100% castor oil on the bottle with no other ingredients. Am I ok? I hope so as I just put some in my eye before I read this. :( Florida 06/24/2015 \nMy bottle of caster oil says it's hexine free. So, you might want to get another bottle that says this. Write a review Posted by Clayton72 (Dallas, Tx) on 01/11/2012 \nI recently came down with an eye infection. At first, I assumed it was Pink Eye but my actual eyeball was not red at all. There was swelling from the inner corner of my eye to the middle of the lid and my eyelid was pretty red. By the next day, my eye hurt really bad whenever I blinked. When I realized it was probably Blepharitis, I put coconut oil on it. I did that only trying to keep the scales from forming on the lid. Some of the pics I saw online were disgusting and some of the people had major crust forming around the lashes. I figured that coconut oil would probably keep the skin from collecting. \nTo my surprise, I found that as long as the coconut oil was on my lid, there was no pain. I never saw any scales form and within 2 days, my eye was not swollen anymore. You have to keep putting the coconut oil on (2-3 times a day), you will notice when it dries because your eye will be itchy and will hurt again. So happy it worked! Caerphilly 08/31/2015 \nI've been using coconut oil for blephritis for couple of days and my eyes are sore and itchy. 11/04/2015 \nHello! \nI really like this page, I read a lot about different cures for blepharitis. I was also diagnosed with blepharitis about 7 months ago. At the moment I use an eye pad and massage and cleaning procedure two times a day. I am also trying this coconut oil thing. I apply it around my eyes in the morning and in the night. My issue is that when I apply the oil too close to my eyes, (and by too close I mean on my eyelids) then my eyes start to burn. They are so sensitive to everything. Right now, I apply it directly outside my eyelids, not actually on the eyelids. and that works if I do not apply too much of it. But yesterday before I got to bed I thought I should try to apply coconut oil on my eyelids and very close to my eyelashes, so I did. and today I have had a burning feeling in my eyes. How can my eyes react like this? \nAnkan Write a review Posted by Helen (Durham, County Of, UK) on 01/25/2015 \nI've suffered with this condition for a year, the warm compress, massage and cleansing doesn't seem to do any good at all, I hate having to look at people because I know my eyes look so bad, 2 months ago, my doctor prescribed me a weeks course of doxycycline, an antibiotic, before the week was up, my eyes were back to normal, I was so happy and relieved, but the condition has gradually started to come back, I did some research, and it is recommended that a 100mg capsule a day be taken for 1 month, then a 50mg capsule a day be taken for 2 months. Am going back to the doctors, will let you know how I get on. Durham, County Of 02/15/2015 \n2 weeks in to a 3 month course of doxycycline and there's a definite improvement already, my eyes aren't as sticky, crusted, red or watery as they were, I've got another 2 weeks of 100mg a day, then 2 months of 50mg a day, it seems to be working so far. Co.durham, England 04/23/2015 \nI have completed a 2 month course of doxycycline, 100mg a day for 1 month, then 50 mg a day for 1 month, I put lacrilube ointment in both eyes at night, and the blepharitis has gone, I urge all sufferers to give it a try. Miami 05/16/2015 \nDo you put the honey in the whole eyelid or just in the eyelid margins? Does it gets into your eyes ? How long do you leave it. Thank you for your help 12/20/2015 Better But With Side Effects \nMany years ago I was diagnosed from Moorfields eye hospital with Blepharitis, and put on 2 X 50mg of doxycycline for 8 weeks. I was feeling better and went to pick up my second months supply only to find the GP wrote me up for a 100mg. strength dose which made me so ill I had to come off this. I had thus wasted taking this for 4 weeks and now off the medication. I have just been left in a more severe condition. No GP can sort this out disregarding my inability to take a 100mg. tablet. So I am from today ordering 3 bottles of Blephasol to cleanse my eyes and then a lubricant gel for the dry eyes to see what works. I also will try the heated mask. My burning of the eyes is severe as is the stickiness so I have to try something that works better than the NO TEARS Baby shampoo which is tedious to use. Consistency is the key to keeping on top of cleansing the eyelids which is what is needed in this eye disorder of Blepharitis. Write a review Posted by Ali (Tasmania, Australia) on 09/24/2016 \nHooray, finally a solution for this maddening eye condition. After working thru some of the other posts, most made it worse, \nI tried this method with success. Here's what I did... \nI used 2 drops of organic baby shampoo, 1 tablespoon of Epsom salts dissolved in 1/2 cup hot water, or microwave it. \nTo apply dip 2 cotton round makeup pads into the heated solution, squeeze excess liquid & place on closed eyes. I then placed a heated, in microwave, damp face washer folded over & then a small heated wheat bag to hold it in place, lie flat for 10 mins AM+ PM. The wheat bag held it's heat for 10 mins easily. \nBy Day 2 I was feeling less desperate & I have continued for a week and I now have almost normal looking eyes, apart from my pesky glaucoma!!! If you don't have a wheat bag, buy an old pair of corduroy trousers from an op shop & cut the legs into pieces, sew & fill with wheat, which can be bought loose very cheaply...hand sew end to finish. Also it doesn't work as well without the baby shampoo, go for a soap & sulphate free brand. Best of luck...đ Reply 1 Posted by Circuitrider (Hawaii) on 11/18/2015 \nAfter dealing with blepharitis for about two years, I feel that I finally found a treatment that works for me. After poring over literally hundreds of posts on different websites and trying numerous treatments - the simplest has proven to be the best. \nThe problem with blepharitis is as soon as the infection occurs, the immediate reaction is to get rid of it quickly even to squeeze the infected gland and/or eyelid to remove the stye. As many of the previous posts already indicated, this only worsens the condition. \nFor many with blepharitis, as it was with me it meant keeping up with the condition every single day. I found that I had to keep a close eye on my eyelids to watch for any sort of inflammation or swelling that indicated that an oil gland was blocked. If there was any swelling, redness or indication that a meibomian gland had become blocked I would have to intensify the treatment. \nHere's the treatment that I have been using and it is now worked for over a year now with no serious reoccurrence of infection: microwaveable eye warmer with beads, (never bother with a single eye warmer) usually obtained at a local drugstore for about $10 Epsom salts - about 2 tablespoons Baby shampoo - 5-6 drops (don't get cheap off brands, they sting) About 2 cups of water Small towel to just wrap around the heating pad \nHeat up the water in a small bowl along with the Epsom salts and baby shampoo. Takes about 45 seconds by microwave. Heat up the beaded mask for your eyes takes about 20 seconds in the microwave. Then take the small towel and soak it in the solution and then wrap it around the beaded eye mask. The heat will last a good five minutes or so. Then if you want to go a full 10 minutes you can heated up and repeat the process one more time. It seems that if you're in the middle of dealing with an infection that a full 10 minutes does work better. This process softens the congealed oil's in your oil glands, it allows them to drain which is what you need to have happen. \nThe eyelid will immediately feel better. If there is a small white spot on the eyelid you will notice that eventually it starts to go down. As you may already know Epsom salts are used to draw out infections, and it feels really good on your eyelids even if you didn't have this condition. But it takes time to reduce the swelling. If you wake up in the morning with a crusty feel in the eyelid that means that the eyelid is draining, and that's a very very good sign. If you catch it early enough it will only take a few days and the infection will go away completely. Here's something else that seems to work well for some reason, if you can soak your eyes in the evening at about six or seven in the evening, and then again just before you go to bed, it seems that it really helps the eyelid to drain if you're dealing with an ongoing blockage. \nI would like to add a few things that I feel do not work. Often you will read where just putting on a hot cloth is suggested but it doesn't get hot enough long enough to do any good. It is basically ineffective. Also taking a hot shower doesn't really get enough heat to where it needs to be. Also you will hear comments where you should heat the pad to where you can barely stand it, but you only need to heated to about 40Â° C. Hotter could be damaging. Some will say that it's not necessary to use any kind of solution, that it's just the heat, but the solution does cause better contact with the heat and the salt can have a therapeutic effect as well as the soap on the eyelid. I've also tried some other oils and other substances on my eyelids which only burn and perhaps could even damage your eyes. Unfortunately in talking with doctors about my eyes, they usually pass it off is no big concern which is a little bit annoying and simply say just soak your eyes. While that is basically true you have to approach it the right way for it to actually work. \nAnother device that I have used that is very helpful is an electric eye warmer that connects to USB port, especially designed for treating blepharitis not the usual eye warmer that might be commercially available. There's only one on the market that I have found and finally it past all the testing and is now available. I use every night in treating my eyes which is an alternative to the heated solution and eye warmer when not dealing with an infection. \nSo in conclusion, it takes 2 things, persistence and patience to deal with this condition as I have learned through experience. If you keep up with the condition of your eyelids, then you will not have to deal with embarrassing styes or chalazions when the stye gets to a larger size and takes much longer to heal. Incidentally, using the above method I have been able to heal chalazions in the same way, it just takes much longer. But with patience, you will eventually completely heal the eyelid.", "external_links": [], "published": "2017-03-01T02:27:00.000+02:00", "crawled": "2017-03-01T03:11:29.996+02:00", "highlightTitle": ""}