{"organizations": [], "uuid": "415e6d52f4f5d4d1a328ab6fa0a430ad72a603e3", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "tech.firstpost.com", "main_image": "", "site_section": "http://tech.firstpost.com", "section_title": "Tech2", "url": "http://tech.firstpost.com/gaming/google-is-taking-steps-to-improve-visibility-of-games-in-the-play-store-including-price-drops-to-free-364800.html", "country": "IN", "domain_rank": 1168, "title": "Google is taking steps to improve visibility of games in the Play Store, including price drops to free", "performance_score": 0, "site": "firstpost.com", "participants_count": 1, "title_full": "Google is taking steps to improve visibility of games in the Play Store, including price drops to free", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T12:07:00.000+02:00", "replies_count": 0, "uuid": "415e6d52f4f5d4d1a328ab6fa0a430ad72a603e3"}, "author": "tech2 News Staff", "url": "http://tech.firstpost.com/gaming/google-is-taking-steps-to-improve-visibility-of-games-in-the-play-store-including-price-drops-to-free-364800.html", "ord_in_thread": 0, "title": "Google is taking steps to improve visibility of games in the Play Store, including price drops to free", "locations": [], "entities": {"persons": [], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "android authority", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Google Play store is a notoriously crowded marketplace, where visibility can make or break a game. This leaves indie game developers with limited resources for marketing in the lurch, with few options to get people to look at or try out their offerings. At the ongoing Game Developer Conference in San Francisco, Google has indicated that it will be taking measures to improve visibility of games on the Play Store, according to a report in Android Authority .\nOne of the biggest difference this will make for buyers is that games are now going to be able to drop to the free price point. While developers have been allowed to drop their prices to free on Apple’s iOS platform almost since the inception of the App Store, Google has not allowed games to drop to the free price point and then return to a paid price point on the Play Store.\nGoogle has allowed select publishers to drop their games to the free price point. The games saw an increase of installs between 3 to 20 times, and there was a lift in installs even after the promotional period has ended.\nGoogle has said that it will be tweaking the promotion algorithms based on continue engagement as against the number of installs. This means that games that get played more will get more visibility on the Play Store, as against titles that are installed but not played as much. In addition, Google will be cherry picking high quality gaming content, and will feature them in thematic pages along with reviews written by Google editors.\nThe changes means that the hidden gems in the Play Store will no longer be buried under mountains of content. Indie game developers will have more of a chance of getting their games to succeed. The end user will be able to discover more titles that they might like, as against having to repeatedly scroll through the same list of titles that everyone has installed. Promising games that have not trended or gone viral will now have a better shot at capturing audiences.\nThe post Google is taking steps to improve visibility of games in the Play Store, including price drops to free appeared first on Tech2 .", "external_links": [], "published": "2017-03-01T12:07:00.000+02:00", "crawled": "2017-03-01T07:45:12.269+02:00", "highlightTitle": ""}