{"organizations": [], "uuid": "ddf5e25c1d068868e8846b5fc1988f5f46279237", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thewalrus.ca", "main_image": "https://thewalrus.ca/assets/img/Marketing-Cola.jpg", "site_section": "http://thewalrus.ca/feed/", "section_title": "thewalrus.ca", "url": "https://thewalrus.ca/the-business-youre-in-is-more-than-the-product-you-sell/", "country": "CA", "title": "The Business You’re In Is More than the Product You Sell", "performance_score": 0, "site": "thewalrus.ca", "participants_count": 1, "title_full": "The Business You’re In Is More than the Product You Sell", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T02:34:00.000+02:00", "replies_count": 0, "uuid": "ddf5e25c1d068868e8846b5fc1988f5f46279237"}, "author": "Terry O'Reilly", "url": "https://thewalrus.ca/the-business-youre-in-is-more-than-the-product-you-sell/", "ord_in_thread": 0, "title": "The Business You’re In Is More than the Product You Sell", "locations": [], "entities": {"persons": [{"name": "paul jerry", "sentiment": "none"}, {"name": "hef", "sentiment": "none"}, {"name": "hugh hefner", "sentiment": "none"}, {"name": "terry o’reilly", "sentiment": "none"}, {"name": "george orwell", "sentiment": "none"}, {"name": "steve jobs", "sentiment": "none"}, {"name": "gilmore", "sentiment": "none"}, {"name": "o’reilly", "sentiment": "none"}, {"name": "dan wieden", "sentiment": "none"}, {"name": "theodore levitt", "sentiment": "none"}, {"name": "wieden", "sentiment": "none"}, {"name": "kennedy", "sentiment": "none"}, {"name": "gary gilmore", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "bill cosby", "sentiment": "none"}], "locations": [{"name": "oregon", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}], "organizations": [{"name": "ddb canada", "sentiment": "none"}, {"name": "coca-cola", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}, {"name": "exxon", "sentiment": "none"}, {"name": "campbell ewald", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "coke", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "playboy", "sentiment": "none"}, {"name": "pirate radio and television", "sentiment": "none"}, {"name": "molson", "sentiment": "none"}, {"name": "apple computer", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "wieden", "sentiment": "none"}, {"name": "pepsi", "sentiment": "none"}, {"name": "nike", "sentiment": "none"}, {"name": "alfred a. knopf canada", "sentiment": "none"}, {"name": "penguin random house canada limited", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "cbc radio", "sentiment": "none"}, {"name": "michelin", "sentiment": "none"}, {"name": "dell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Jerry \nW hat business are you really in? Don’t answer that question too quickly. Most people get it wrong. Yet it’s the most important marketing question you can ask yourself. Until you can answer it correctly, your marketing will always lack focus. A truism of business is that what you sell and what people buy are almost always two different things. Companies look to sell products, and customers look to buy solutions. While seemingly related, the definitions of each can be miles apart. \nFor example, Molson isn’t in the beer business. Even though Molson’s plants are designed to manufacture beer and every Molson delivery truck you see is full of beer cases, Molson isn’t in the beer business. It’s in the party business. \nLook at almost any Molson beer commercial. It’s all about having fun, being in groups, flirting, laughing and socializing. That is what the majority of Molson beer fans are really buying into when they put their money down. Molson is a savvy marketer and it knows the solution it offers is social lubrication. That presents a delicate communication task, because alcohol marketing is heavily regulated in this country. So the partying scenes are tightly controlled. The number of beers in a scene must equal no more than the number of people in said scene. Five people in a shot, five beers max. No one holding a beer can be involved in an activity requiring skill—like waterskiing or chainsaw carving. No one can appear to be underage. The activity of the participants can’t be “over exuberant.” I once had a beer commercial turned down by regulators because one of the actors toasted above shoulder level. The charge: too exuberant. The advertising can’t suggest beer promotes sex. (I know, I know. It’s the most elastic rule of the bunch). But say what you will, Molson knows what business it’s in. The majority of the people who wear Nike sneakers don’t work out. That should tell you everything. \nMichelin is not in the tire business. It’s in the safety business. Its purpose is to offer the utmost tire safety for automobiles. Michelin once had the best tire tagline of all time. The company’s TV ads showed a baby strapped into a radial, with the line “Because so much is riding on your tires.” That’s the business Michelin is in. Not vulcanized rubber. Safety. So if it just sold tires, it was in trouble. But if it sold safety, it was golden. (Why Michelin abandoned that line, I will never know.) \nHäagen-Dazs isn’t in the ice cream business, it’s in the sensual pleasure business. Whitewater rafting companies aren’t in the personal transportation business. They are in the personal transformation business. Starbucks isn’t in the coffee business. It’s in the coffee theatre business, with baristas, elaborate java machinery and five-word mocha-choco-lotta coffee names. \nApple isn’t in the computer business. It’s in the personal empowerment business. If you want to understand Apple’s massive success, just draw a straight line back to late 1983. To Super Bowl XVIII. To late in the third quarter. To a TV commercial called 1984 . \nWithin the advertising business, it is arguably the most famous TV commercial in history (google it). This single advertisement positioned Apple for all time in the minds of the buying public. It showed a bleak image of George Orwell’s 1984 future, where people shuffle in drab uniforms and listen to the hypnotic ranting of Big Brother on a gigantic screen. But meanwhile, we see dramatic cuts of a female athlete, dressed in white and red, holding an Olympic-sized hammer, being pursued by a squad of futuristic police. She runs down a long tunnel into the gathering, stops, swings the hammer and lets it go with a scream—smashing the gigantic screen, to the amazement of the catatonic crowd. The message from Apple: “On January 24th, Apple Computer will introduce Macintosh. And you’ll see why 1984 won’t be like 1984 .” Translation: We’re going to take the computing power that IBM has hoarded all these years and give it to you. \nThat single message—or contemporized variations of it, echoed ever since by everything Apple does and everything Steve Jobs has said—is why so many people buy so many Apple products. To put a finer point on it, you can google a photograph of Steve Jobs at IBM’s head office, standing under its massive logo, flipping the bird. People loved that rebel stance. When Apple announces a new product, people line up overnight to be the first to get their hands on it. No one does that for Dell. People are drawn to Apple’s promise of personal empowerment on a very deep level, topped with a little seasoning of “us versus them.” That is what Apple sells. There are more powerful computers out there, and certainly cheaper ones, yet Apple has become the most valuable company in the world after Exxon. It accomplished this by completely understanding what business it is in. \nNike isn’t in the shoe business. It is in the motivation business. The mantra “Just Do It” has been called the last great slogan of our time. While it may have motivated millions of people to step up and enjoy life, it was actually inspired by someone’s death. Dan Wieden, co-founder of advertising agency Wieden + Kennedy, located in Portland, Oregon, coined the slogan. He remembered watching a news report on the execution of spree-killer Gary Gilmore in 1977. Gilmore, who had grown up in Portland, was being executed in Utah by firing squad. His official last words to the warden were “Let’s do it.” Wieden was struck by the impact of that line. He thought it remarkable that Gilmore could face that much uncertainty and just push through it. It stayed with Wieden, and when he needed to come up with a tagline to tie eight different TV commercials together for his agency’s first presentation to Nike, he remembered Gilmore’s words. He simply changed one word and “Just Do It” was born. The rest is marketing history. Men weren’t buying a magazine; they were buying the fantasy of living the Playboy life. \nThe power of that line cannot be understated. At first glance, it says, If you have a body, you’re an athlete. But a quick frisk reveals something more profound. That phrase is the answer to so many of life’s bigger questions. Should I tell the boss my idea? Should I quit this horrible job? Should I start my own business? Should I pop the big question? \nThe majority of the people who wear Nike sneakers don’t work out. That should tell you everything. “Just Do It” is a line that ignites millions of dreams, only a small percentage of which are exercise-related. Nike knows what people are buying. It’s not shoes. It’s motivation. \nConjure up all the commercials you can for Molson, Apple and Nike. Nearly all Molson ads show people happy and partying. After the 1984 TV commercial, virtually all Apple commercials show an individual achieving something on a computer. Every single Nike ad you’ve ever seen shows pros and amateurs reaching for a dream. Good Molson ads don’t tell you how the beer is made. Apple doesn’t analyze gigabits. Nike rarely discusses sneakers. \nYou have to know what business you’re in. \nI once interviewed Playboy founder Hugh Hefner. I asked him this: If you were to stop wearing pyjamas to work and ceased dating twins, would it affect your business? He didn’t hesitate. His immediate answer was yes. You’ve got to hand it to old Hef; he knows what business he’s in. In order to keep the entire grotto-filled enterprise afloat, he has to sell the lifestyle. Men weren’t buying a magazine; they were buying the fantasy of living the Playboy life. \nIf you are a company big enough to hire an advertising agency, then a smart one will help you uncover what business you are really in. But if you can’t afford an agency, you have to do the homework on your own. Believe it or not, answering this question is not as easy as it appears. It requires sober objectivity, one of the most important things an ad agency can offer a client. \nAgencies need to strive for objectivity because in order to appeal to a customer, you have to think like a customer. Not like a company. Most companies fall in love with their product. The passion you feel for your company is good, but that passion can be fuelled by your immersion in how your product is created—which, if you are marketing that product, is bad. You are lost in the weeds. Have you ever asked an Internet installer a question and had to stand through a thesis on routers and megabit-per-second download rates when all you really wanted to know was whether you could download an HD movie? \nThat’s what I mean. \nSmart marketers know when their nose is too close to the glass and their breath is fogging up the view. You have to develop the ability to leave your office and look back in through the windows. Ruthless objectivity is the key. Customers are drawn to a brand—be it a product or a service—for many reasons. But the most important, overriding reason is how it makes them feel . Price, location, colour and so on all rank well below this single criterion. \nRemember the cola wars in the eighties? Remember the Pepsi Challenge commercials? We all sat at home and watched real people take the challenge of sipping two hidden colas, and choosing one, which, when revealed, was Pepsi. Coke’s management all sat at home, too, watching the same commercials every night, and it made them nuts. Here’s the important thing to know: Coke had an ocean of market share over Pepsi. It couldn’t even see Pepsi in its rear-view mirror. But the sight of those commercials playing out every single night made Coke executives crazy. So what did they do? Coke actually changed its formula. If you remember, the reaction to that was so negative, so swift and so overwhelming, Coke brought back its original formula only seventy-seven days later. Can you imagine what that cost Coca-Cola? Untold millions. The company not only changed its packaging, and spent millions with Bill Cosby (!) marketing New Coke, it changed its entire manufacturing process. \nBut I maintain Coke should have been really happy about that. It proved how much people loved the brand. If they didn’t, that change would have passed like a ship in the night. As one journalist noted, it just happened to be the most expensive focus group in history. Follow this math with me: In hidden taste tests, Pepsi beats Coke slightly. In taste tests where respondents can see both brands, Coke beats Pepsi decisively. Interesting, isn’t it? Nothing has fundamentally changed in that scenario. But get this: in another taste test, where Coke was pitted against a hidden cola, in other words, where people could see Coke but not the other brand, Coke beat that other brand 99 to 1. Guess what that other brand was? \nCoke. \nCoke clobbered Coke. \nR emember, customers never want the product. They want the benefit of the product, and to purchase that benefit from a company whose purpose feels like a cavalry coming over the hill. Apple’s cavalry hoists a pirate flag and attacks corporations from ingenious angles. Molson’s troops say nine to five may belong to your boss, but 5:01 to midnight is yours. Nike’s militia says go for it. \nPeople don’t buy ¾-inch drill bits. They buy ¾-inch holes. \nI have used that line for over thirty years and took full credit for it until I reread a book written by Theodore Levitt and realized I had unconsciously stolen it from him. But it’s a beautiful articulation of what marketing is all about. People buy benefits. Not products. Not features. And they buy those solutions from companies they can relate to. \nThat’s why knowing what business you are really in is so imperative. The worst possible marketing scenario is when you keep selling tires but your customers are buying safety. With that kind of disconnect, the future of the company will get very difficult. \nSmart companies sweat over this. But once you look back through your own windows, once you pull out a stethoscope to listen to the beating heart of your company, everything will change. Your marketing will be clear. Concise. Relevant. Not only that, but it will lend itself to more creativity. Think of the endless ideas “Just Do It” has inspired. Think of all the iconic marketing Apple has done for thirty years off the launch pad of its 1984 commercial. Coke’s consistent “happiness” marketing has made it number four on the Forbes list of the World’s Most Valuable Brands, a list that includes Apple, Microsoft and Google. Very telling—a brand invented in the late nineteenth century, still relevant and valuable near the top of that tech-heavy list. \nMore than anything, if you truly know what business you’re in, you will be selling the right thing and solving the right problems. Your burning ember will be alive and well. Customers will ignore closer competitors with lower prices, drive across town and do business with you. Your staff will have a fixed North Star to follow. \nAll you have to know is what business you’re really in. \nExcerpted from This I Know by Terry O’Reilly. Copyright © 2017 Terry O’Reilly. Published by Alfred A. Knopf Canada, a division of Penguin Random House Canada Limited. Reproduced by arrangement with the Publisher. All rights reserved. \nTerry O’Reilly hosts CBC Radio’s Under the Influence and previously hosted O’Reilly on Advertising and The Age of Persuasion. He began his career as a copywriter for Campbell Ewald, DDB Canada, and Chiat/Day and in 1990 co-founded Pirate Radio and Television, a creative audio-production company.  ", "external_links": [], "published": "2017-03-01T02:34:00.000+02:00", "crawled": "2017-03-01T03:13:46.457+02:00", "highlightTitle": ""}