{"organizations": [], "uuid": "81608f6c5db20c3f945e4c9f0dff89fd849046bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.techtree.com", "main_image": "http://www.techtree.com/sites/default/files/styles/col-auth-200-200/public/2017/3/nokia88.jpg", "site_section": "http://www.techtree.com/content/rss/all", "section_title": "TechTree.com - All Sections", "url": "http://www.techtree.com/content/features/12531/can-nokia-reclaim-smartphone-glory-2017.html", "country": "US", "domain_rank": 78230, "title": "Can Nokia Reclaim Its Smartphone Glory In 2017?", "performance_score": 0, "site": "techtree.com", "participants_count": 1, "title_full": "Can Nokia Reclaim Its Smartphone Glory In 2017?", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T20:01:00.000+02:00", "replies_count": 0, "uuid": "81608f6c5db20c3f945e4c9f0dff89fd849046bf"}, "author": "ck", "url": "http://www.techtree.com/content/features/12531/can-nokia-reclaim-smartphone-glory-2017.html", "ord_in_thread": 0, "title": "Can Nokia Reclaim Its Smartphone Glory In 2017?", "locations": [], "entities": {"persons": [{"name": "lumia", "sentiment": "none"}, {"name": "steve ballmer", "sentiment": "none"}], "locations": [{"name": "xiaomi", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "cnc", "sentiment": "none"}, {"name": "hdm", "sentiment": "none"}, {"name": "lenovo", "sentiment": "none"}, {"name": "foxconn", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "nokia", "sentiment": "none"}, {"name": "hmd", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Home » Features » Can Nokia Reclaim Its Smartphone Glory In 2017? Can Nokia Reclaim Its Smartphone Glory In 2017? Lets find out if the Finnish brand still has an edge in the market. Follow @MiserlyGeek Share this Previous Microsoft CEO, Steve Ballmer, had once famously said that most companies are one trick ponies. They do one thing right and they do that one thing really well. He believes that Apple and Microsoft turned out to be two trick ponies. For instance, after its first trick Macintosh, Apple manage to push forward low-power touch computing (iPod and iPhone). This is what makes these tech titans so special. The situation Nokia faces today is not exactly the same, but quite similar. It was once a top smartphone brand, and now it wants to pull off that trick again. This doesn't sound difficult. However, while Nokia was out of the game, a lot things changed. So let us see whether Nokia still has a chance to crack the smartphone market in its much-awaited comeback. Brand Value Despite releasing hardly any consumer goods for a year, Nokia still manages to rank in Forbes' list of most reputed brands in the world. In fact, According to a last year's report, Nokia is among the top five most trusted brands in India. Samsung's recent Galaxy Note 7 fiasco couldn't have come at a better time. It gives the Finnish company to take away some brand conscious Android smartphone users from Samsung. So, as long as Nokia does not screw up things, there should be enough people eager to pick-up a device with Nokia's name written on it. Industrial design Nokia has been one of the few design driven brands in the market. From the \"indestructible\" Nokia 3310 to the more recent Lumia 800, the company has delivered a steady stream of distinct designs. It also has a knack of offering robust build quality. Thankfully, HMD, the company that owns rights to use Nokia's brand name on smartphones too looks serious about aesthetics and durability. More importantly, Nokia still has a say in the design department. Its newly announced phones such as the Nokia 6 and 5, are each made from a solid block of aluminium. To achieve the seamless design and sturdiness, HDM's manufacturer Foxconn uses incredibly precise and time consuming CNC milling to carve a block of metal to make a handset. Such dedication and expertise should help Nokia win back old customers. Power and features No matter who headed the handset business, Nokia has always sucked in terms of specifications. Back in Symbian days, Samsung always outdid Nokia in terms of specs. After Microsoft acquired Nokia's smartphone division, the company could never really match the power of its Android counterparts. Now under HMD too, the company has opted for modest Snapdragon 430 chipsets for mid-range handsets such as Nokia 5 and Nokia 6. Things get even worse for the Nokia 3 that runs MediaTek's MT6737 chipset. To put things in perspective, similarly priced handsets from Xiaomi and Lenovo, offer much more powerful Snapdragon 650 SoC. This is one area where HMD really need to work if they are to succeed in this market. Pricing If underpowered hardware wasn't bad enough, Nokia has got the pricing wrong. Take for instance, the Nokia 6, which comes with Snapdragon 430 processor, 3 GB RAM, and 16-megapixel camera, costs 1699 yuan, which roughly translates to Rs 16,500. In comparison, the Xiaomi Note 3 offers more power and overall better specs for as little as Rs 10,000. Developing countries such as India are price sensitive markets, and such a price difference will definitely make Nokia smartphones a hard sell.", "external_links": [], "published": "2017-03-01T20:01:00.000+02:00", "crawled": "2017-03-01T15:12:49.986+02:00", "highlightTitle": ""}