{"organizations": [], "uuid": "72525afd311d751dec7078711592947b0b37e0f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.earthclinic.com", "main_image": "http://www.earthclinic.com/images/pages/apple-cider-vinegar-for-coughs.jpg", "site_section": "http://feeds.feedburner.com/EarthClinic", "section_title": "Recent Posts from Earth Clinic", "url": "https://www.earthclinic.com/apple-cider-vinegar-for-cough.html", "country": "US", "domain_rank": 34889, "title": "Apple Cider Vinegar for Coughs", "performance_score": 0, "site": "earthclinic.com", "participants_count": 0, "title_full": "Apple Cider Vinegar for Coughs", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T02:31:00.000+02:00", "replies_count": 0, "uuid": "72525afd311d751dec7078711592947b0b37e0f5"}, "author": "", "url": "https://www.earthclinic.com/apple-cider-vinegar-for-cough.html", "ord_in_thread": 0, "title": "Apple Cider Vinegar for Coughs", "locations": [], "entities": {"persons": [{"name": "coughville", "sentiment": "none"}, {"name": "katherine", "sentiment": "none"}, {"name": "jeanette", "sentiment": "none"}, {"name": "dianne", "sentiment": "none"}, {"name": "rachel weaver", "sentiment": "none"}, {"name": "mey", "sentiment": "none"}, {"name": "latz", "sentiment": "none"}, {"name": "kazzakazzarooney", "sentiment": "none"}, {"name": "liz", "sentiment": "none"}, {"name": "yolanda", "sentiment": "none"}, {"name": "jill", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "ojai", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manuka", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "tx", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "tablespoon acv", "sentiment": "none"}, {"name": "acv", "sentiment": "none"}, {"name": "ec", "sentiment": "none"}, {"name": "tablespoons acv", "sentiment": "none"}, {"name": "apple cider vinegar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Apple Cider Vinegar Remedy for Coughs Feb 28, 2017 Apple cider vinegar is Earth Clinic's most popular home remedy for coughs. This simple and effective remedy has helped dozens of our readers. It is an inexpensive natural remedy and easy to try! How Much Apple Cider Vinegar Should I Use for a Cough? \nThe best way to take apple cider vinegar for a cough is as a hot drink with honey. 1 - 2 tablespoons of raw, organic apple cider vinegar 1 - 2 tablespoons of honey, preferably raw and local 6 ounces of hot water Drink this \"vinegar tea\" freely. Adding a pinch of cinnamon and/or cayenne pepper will add to the healing power of the drink. \nApple cider vinegar can also be taken in a glass of water or juice. Adding ACV to apple juice makes it very palatable for children. \nThis remedy can be taken as often as desired. Be prepared for quick relief! \nContinue reading to see how our readers have used apple cider vinegar to help or cure their cough. Have you tried this simple natural remedy? Please share your story with us! 77 User Reviews Write a review Posted by Latz (Israel) on 10/09/2016 \nFirst I got the cold last week. First time it was a full blown cold - headache, non-stop runny nose, cough every 3-4 minutes, even my eyes were heavy, I thought I'm having some cataracts. Today, actually yesterday was a big relief, and today is the end of the nightmare. It lasted only about 4 days, but felt like I'm a half human. \nWhat I wanted to say is this: what helped me the most was Apple Cider Vinegar. 3-4 times a day I was drinking ACV, full glass of mineral water with maybe 3-4 tablespoons of raw eucalyptus honey. I didn't measure ACV, just poured in. \nBut I'm drinking it for years, first thing in the morning, then in the middle of the day, and before bed. So it helped. \nThen my wife contracted the virus from me and started coughing. Went to EC, and found the recipe with equal parts of raw honey and ACV + cinnamo n. Told her this morning when she got up. She made the drink and felt a big relief. Then she had it another couple times and she stopped coughing. AMAZING!!! Thank you! 10/10/2016 \nHi Latz, \nSo, did you use the recipe that says 1-2 Tablespoons each of apple cider vinegar and honey plus a pinch of cinnamon and 6 ounces of hot water? 11/12/2016 \nHi Dianne, \nNo, I don't measure. I pour approximately 1/2\" ACV, and then mineral/spring water, and a tbsp of raw Eucalyptus honey, which is considered almost on par with Manuka honey, as having medicinal properties. \nYes, I used warm water, not hot. I also did this 4-5 times during the day. Plus I also take Turmeric supplement. Reply 1 Posted by Kazzakazzarooney (London) on 09/21/2016 \nAs usual when I get a cold, my soar throat, then runny nose turns to a very dry larynx and trachea. The phlegm is so stuck that no amount of coughing will get it up and it is very distressing as it feels harder to breathe. I know I should try not to cough and clear my throat as it will make it more inflamed but it's an instinct. I have got better at that. I don't get much sleep as it feels like someone is strangling me and so with not much sleep, all the fear and the coughing, I feel complexity drained. This post viral cough, with inflammation, tightness etc usually last for weeks so I dread the autumn and winter. \nI am really into self help and have tried many home remedies and foods - apples, cucumbers and grapefruits being a help but only to a certain degree. I've done all the other things that are well known and seen so many health practitioners about this. Nothing has worked that well. \nIf you have a chesty cough with catarrh a very effective way to loosen it is mullein leaf tincture. Far and beyond better than any thing I have tried. For this cold it isn't chesty so I haven't tried ACV yet! \nThen yesterday I came across this great website and read with amazement all the positive reviews. So I mixed up a drink of 1tbsp ACV (organic with the mother) and 1tbsp of homey in 1/2 glass of warm water . It taste a bit like warm cider. The feeling got fractionally better. Then again later I tired and I coughed up a little for the first time but it still felt pretty bad. Then just before bed I took again and lay straight down - suddenly a lot of productive coughing and then after a long while I actually got some sleep!!! I should have taken it an hour before bed because then the coughing would have been over with! \nThis morning I woke up and actually coughed so much up which never usually happens. I will carry on taking it. \nThe biggest frustration is why on earth do doctors not know about this almost miracle cure- think how much suffering they could prevent. Not only does it work but finally I can have peace of mind and heart that there is actually something that will help in the future. For pain you can take a tablet, for asthma an inhaler but until finding this.... - they can send men to the moon but a common and distressing affliction like this - no main stream health professional seems to know the answers!! Please spread the word! Reply 3 Posted by Jill (Illinois) on 06/19/2014 \nI've had a head/chest cold for a week now. I've gone thru about four boxes of kleenex. Last nite I tried 2 Tablespoons of Apple Cider Vinegar and 1 Tablespoon of honey. I stirred it up to dissolve the honey. I choked it down and it was brutal but it seemed to have worked. Probably within in an hour it suppressed the cough. I slept thru the nite. This am I'm coughing so I will try it again. Still gonna take my Mucinex. Illinois, US 06/19/2014 \nThis am I went out and bought some cayenne pepper, ground ginger, and buckwheat honey. I mixed it up with ACV to make a cough syrup. It's helping the cough a little bit but my nose stopped running this afternoon. I just took a teaspoon of the honey and then I'll do the syrup before bed. Nashville, TN 11/09/2014 \nI couldn't eat much when I woke because stomach was sensitive but a little ACV and honey in water made me more nauseous and stopped the cough just a little, but it came back within a 1/2 an hour. Chicago, IL 12/29/2014 \nWhen I use that concoction it makes me slightly nauseous. I stand for a min debating if I have to make a beeline for the bathroom but I never have. You can take it as often as you want to. Reply Posted by Mey (Leb) on 02/07/2014 \nMy 4 years old daughter have cold and coughing since three weeks, she is really bad, I visited a lot of doctors and she took a lot of medication, but it ls not stoping, can I try the Apple Cider Vinegar steam for her? Please need answer Replied by Mama To Many × Mama To Many \nMAMA TO MANY, CONTRIBUTING WRITER \nThe always kind and thoughtful Mama to Many has been posting on Earth Clinic since 2011. \nABOUT MAMA \nMam to Many is a 46 year old mama to 9 children, ages 2-20. She began studying natural health when her first child was born. Finding success with some simple home remedies motivated her to continue to study and learn more about natural healing. Over the years she has learned a variety of way to use herbs, activated charcoal, essential oils, Apple Cider Vinegar, and nutrition to benefit the health of her family. She has a particular fondness for remedies that are simple, safe, inexpensive, and available to everyone, even (and especially) to those with limited financial resources or access to health care. Mama feels very blessed when given the opportunity to comfort and help those who are suffering. Mama to Many has always loved children and taught in public school before having children of her own. She currently lives on a small farm in Tennessee with her husband, children and a variety of animals, including cows, goats, chickens, cats and a very large dog. She finds it satisfying to treat her animals with natural remedies whenever possible as well. Close 02/07/2014 \nDear Mey, \nI am so sorry your little one has been sick with a cough for so long. \nI have never tried the vinegar steam. I would worry a bit that it might sting the eyes. Perhaps someone else has tried and would be able to advise on that. \nWe have dealt with many coughs and I can share some things that work very well. \nGarlic Salve is easy to make and works so very well. Garlic Salve 8 cloves peeled garlic 5 or so drops of lavender oil \n\"Pour everything into a blender and mix until smooth. Strain off the bits of garlic, and store the liquid in a wide-mouth glass jar in the fridge. It will solidify as it cools. If your child has super sensitive skin, you might try adding more coconut oil and olive oil. Apply liberally to the chest, back, and bottoms of feet (covered with socks) at least four times a day, and as often as every couple of hours, as needed. This isn't something that you can overdose on, so don't be afraid to use too much. If it doesn't seem to be working, use more! \" Rachel Weaver, the creator of this recipe, has used this to treat babies with pneumonia. She uses it like an anti-biotic, except it is also anti-viral. (She will say to use it every two hours if you are treating pneumonia. ) \nIf you do not have coconut oil, just substitute more olive oil for the coconut oil. You can skip the lavender if you don't have it. The garlic is the most important thing, it just must be diluted in the olive oil. \nWe have also used the steam method with just kitchen spices. We boil 2 cups of water and add 1/4 teaspoon of the following: garlic, onion, clove, cinnamon, caraway seeds, thyme and sage. You can leave out something if you do not have it. I put the pot on a chair on a potholder and the child on a couch. I put the rungs of the chair between the pot and child, so they are less likely to get burned. Then I drape a sheet over the child and the chair with the pot. It is a little steam tent. This can be done as often as needed. The spices are helpful in killing germs \nYou can steam and do the garlic salve if you like. Do avoid dairy while getting over a cough. \nI hope your little one is better soon! ~Mama to Many~ Western Slope, CO 04/04/2015 \nAMAZING! I mixed up the coconut oil, olive oil, 9 cloves of garlic, 4 capsules of oregano oil & some tender leaves of lavender and applied to neck, chest and bottoms of feet before bed. I coughed some which woke me, but I did not cough up buckets of phlegm!! I actually slept most of the night; first time in 5 nights!! Thanks Mama to Many, can't wait to pass this on! Replied by Mama to Many × Mama to Many \nMAMA TO MANY, CONTRIBUTING WRITER \nThe always kind and thoughtful Mama to Many has been posting on Earth Clinic since 2011. \nABOUT MAMA \nMam to Many is a 46 year old mama to 9 children, ages 2-20. She began studying natural health when her first child was born. Finding success with some simple home remedies motivated her to continue to study and learn more about natural healing. Over the years she has learned a variety of way to use herbs, activated charcoal, essential oils, Apple Cider Vinegar, and nutrition to benefit the health of her family. She has a particular fondness for remedies that are simple, safe, inexpensive, and available to everyone, even (and especially) to those with limited financial resources or access to health care. Mama feels very blessed when given the opportunity to comfort and help those who are suffering. Mama to Many has always loved children and taught in public school before having children of her own. She currently lives on a small farm in Tennessee with her husband, children and a variety of animals, including cows, goats, chickens, cats and a very large dog. She finds it satisfying to treat her animals with natural remedies whenever possible as well. Close 04/07/2015 \nDear Katherine, \nThanks for sharing your success story! I have added some oregano to my garlic remedy, but never fresh lavender. Great idea! When I add oregano to the garlic, it smells like pizza, so I call it the pizza treatment! :) \n~Mama to Many~ Reply Posted by Yolanda (Texas) on 10/05/2013 \nWow, just took the apple cider vinegar with a little lemon and a squeeze of honey and my cough stopped almost immediately. This stuff is really great. Reply 5 Posted by Jeanette (Houston, Tx, Usa) on 06/04/2013 \nI've been coughing for almost a year. Tried every cough syrup on the market and even gone to see four different doctors and still no cure. Well, I left for Maryland on May 28, 2013 and found a cure. A young lady there told me to try Organic ACV with the Mother. You can find it at any Whole Foods Market or Sprouts Market. I mixed 1-Tablespoon with 1-16.9 oz of water at room temperature and slowly sipped until all gone and guess what.... Coughing has completely stopped. I guess the right type of ACV makes the world of difference. Give it one more try before giving up. Reply Posted by Kl (Coughville, Ct) on 04/02/2013 \nMy slight head cold turned into a nasty watery cough. Plus I lost my voice off and on throughout the day. Although I felt completely fine, people at work treated me like I was dying and I knew my coughing was distracting them. \nOver the counter medicine did nothing for my congestion - seemingly turning everything into what felt like glue in my sinuses. \nAfter checking out the site, I tried Apple Cider Vinegar (ACV). It really did the trick. However, I wish it didn't taste horrible to me. \nI started with 1 Tablespoon ACV, 1 Tablespoon honey, 1 Tablespoon lemon juice, 2 Tablespoons water. Drinking it like a \"shot\" wasn't so bad, but it didn't seem to keep the cough away very long. \nNext, in the evening I tried 2 Tablespoons ACV, 1 Tablespoon honey, in a small glass of warm water. No coughing at all during the night. Woohoo! \nAt 7am this morning, I took the same 2 Tablespoons ACV with honey in a glass of water. It worked until it seemingly wore off at 11am. Then it felt like I was drowning in phelegm. Thankfully it was (sorry to be gross) now the consistency of saliva I was coughing up. When I was first sicker and not using the ACV, it was a yellow mucus. So I know I'm getting better even when I have to cough a little. I'm just not 100% yet. \nOnce I got home from work and drank another 2 Tablespoons ACV 1 Tablespoon honey mixture in water, the coughing and \"drowning in water\" feeling is completely gone. Reply 1 Posted by Liz (Ojai, Ca) on 01/28/2013 \nHello. I have a terrible cough and the flu. The fever broke finally but I am coughing like crazy. I am insulin resisant and should not use honey. Has anyone had success without the use of honey? Is this just used for taste or is there a medicinal purpose for the honey [in the apple cider vinegar cough remedy]?", "external_links": [], "published": "2017-03-01T02:31:00.000+02:00", "crawled": "2017-03-01T03:11:13.957+02:00", "highlightTitle": ""}