{"organizations": [], "uuid": "59b523d3ceefd554b893a9669545a5a3021aa11e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "", "site_section": "http://www.businessinsider.com", "section_title": "Feedburner", "url": "http://www.businessinsider.com/tech-i-didnt-know-i-needed-2017-1?utm_source=feedburner&amp;utm_medium=referral", "country": "US", "domain_rank": 283, "title": "5 tech purchases I should have made sooner", "performance_score": 0, "site": "businessinsider.com", "participants_count": 1, "title_full": "5 tech purchases I should have made sooner", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T20:42:00.000+02:00", "replies_count": 0, "uuid": "59b523d3ceefd554b893a9669545a5a3021aa11e"}, "author": "Brandt Ranj (feedback@businessinsider.com)", "url": "http://www.businessinsider.com/tech-i-didnt-know-i-needed-2017-1?utm_source=feedburner&amp;utm_medium=referral", "ord_in_thread": 0, "title": "5 tech purchases I should have made sooner", "locations": [], "entities": {"persons": [{"name": "anker", "sentiment": "none"}, {"name": "elago", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "anker powerline lightning cable", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. \nAs someone who loves technology, I tend to work it into my life any way I can. \nThat said, there are still some products I put off buying because I thought they were unnecessary. \nIn every case I either had a super specific system in place to avoid buying them, or I'd really convinced myself they weren't worth it.\nNow I use these products on a regular basis; they save me from unnecessary stress, or wasting time, and have become important parts of my workflows.\n \nA tablet stand Amazon \nThe thought of buying a stand for my phone or tablet seemed weird for a long, long time. I could place my devices down anywhere, why prop them up?\nBut as I started to use my portable devices for content creation, it became obvious that they'd need to be propped up.\nI decided on Elago's stand for three reasons: Its aluminum construction matches Apple's design aesthetics, it has a hole in its back so you can use to thread a charging cable through, and it's large enough to accommodate all of my devices. \nSince buying it a couple of years ago, it's become a common fixture on my desk.\nElago P2 stand, $17.99, available at Amazon \n\n\nA long charging cable Amazon \nFor years I tried to use any alchemy I could to rely solely on the power cables Apple packed with its devices.\nThose 3-foot cables are perfect for charging on a kitchen counter or connecting to a computer, but hardly enough for charging on a nightstand. I invested in a couple of Anker's 6-foot cables and never looked back.\nI'm able to snake a cable from an outlet up the side of my bed for at-night charging, and my devices hardly die anymore. \nAnker PowerLine Lightning Cable ( 6ft), $10.99, available at Amazon \n\n\nAn extra power adapter Amazon \nIt's a little indulgent, but buying an extra power adapter for my MacBook Pro was a game-changer.\nI use my laptop as part of a desktop setup; it's constantly connected to a ton of peripherals, with wired organized just so. I wasted a lot of time disrupting that organization any time I needed to take my laptop on the go.\nInvesting in a second power adapter for travel (or use at a place I'm in a lot, like my mom's condo), has saved me time and stress. It's a little indulgent, but very worthwhile. \nApple 85w Power Adapter, $77.30, available at Amazon \n**AVAILABLE THROUGH THIRD PARTY SELLERS WITH PRIME FROM $66.86** \n\n\nSee the rest of the story at Business Insider ", "external_links": [], "published": "2017-03-01T20:42:00.000+02:00", "crawled": "2017-03-01T15:43:39.843+02:00", "highlightTitle": ""}