{"organizations": [], "uuid": "e0a71db97c9abab7fd7048e7ad58fcd08506d40b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "n8-club.blogspot.com", "main_image": "", "site_section": "http://n8-club.blogspot.com/", "section_title": "NOKIA - N8 : SYMBIAN ^ 3 ZONE", "url": "http://n8-club.blogspot.com/2017/02/the-iphone-blog_28.html", "country": "US", "title": "The iPhone Blog", "performance_score": 0, "site": "blogspot.com", "participants_count": 1, "title_full": "The iPhone Blog", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T08:59:00.000+02:00", "replies_count": 0, "uuid": "e0a71db97c9abab7fd7048e7ad58fcd08506d40b"}, "author": "AKASH AGARWAL (noreply@blogger.com)", "url": "http://n8-club.blogspot.com/2017/02/the-iphone-blog_28.html", "ord_in_thread": 0, "title": "The iPhone Blog", "locations": [], "entities": {"persons": [{"name": "john hanke", "sentiment": "none"}, {"name": "mahershala ali", "sentiment": "none"}, {"name": "retina", "sentiment": "none"}, {"name": "pokémon", "sentiment": "none"}, {"name": "denzel washington", "sentiment": "none"}, {"name": "buddy pokémon", "sentiment": "none"}, {"name": "jon edwards", "sentiment": "none"}, {"name": "quill", "sentiment": "none"}, {"name": "macotakara", "sentiment": "none"}, {"name": "elgato", "sentiment": "none"}, {"name": "mujjo", "sentiment": "none"}, {"name": "zubat", "sentiment": "none"}, {"name": "jack frost", "sentiment": "none"}, {"name": "serenity caldwell", "sentiment": "none"}, {"name": "rado", "sentiment": "none"}, {"name": "matthias hochgatterer", "sentiment": "none"}, {"name": "golbat", "sentiment": "none"}, {"name": "kuo", "sentiment": "none"}, {"name": "pokémon go", "sentiment": "none"}, {"name": "wartortle", "sentiment": "none"}, {"name": "wirecutter", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}, {"name": "jony ive", "sentiment": "none"}, {"name": "leonard cohen", "sentiment": "none"}, {"name": "charmander", "sentiment": "none"}, {"name": "drowzee", "sentiment": "none"}, {"name": "viola davis", "sentiment": "none"}, {"name": "mac", "sentiment": "none"}, {"name": "rene ritchie", "sentiment": "none"}, {"name": "chancey", "sentiment": "none"}, {"name": "bond", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "emma stone", "sentiment": "none"}, {"name": "mewtwo", "sentiment": "none"}, {"name": "mozo", "sentiment": "none"}, {"name": "ming-chi kuo", "sentiment": "none"}, {"name": "magikarp", "sentiment": "none"}, {"name": "cleffa", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "santa pikachu", "sentiment": "none"}, {"name": "smoochum", "sentiment": "none"}, {"name": "togepi", "sentiment": "none"}, {"name": "chansey", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "cubone", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "charmeleon", "sentiment": "none"}, {"name": "squirtle", "sentiment": "none"}, {"name": "hypno", "sentiment": "none"}, {"name": "igglybuff", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}, {"name": "niantic", "sentiment": "none"}, {"name": "moshi", "sentiment": "none"}, {"name": "tyranitar", "sentiment": "none"}, {"name": "gengar", "sentiment": "none"}, {"name": "venusaur", "sentiment": "none"}, {"name": "digitimes", "sentiment": "none"}, {"name": "niagara", "sentiment": "none"}, {"name": "sierra", "sentiment": "none"}, {"name": "ivysaur", "sentiment": "none"}, {"name": "amphitheatre parkway", "sentiment": "none"}, {"name": "planet earth", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "bulbasaur", "sentiment": "none"}, {"name": "nanoleaf aurora", "sentiment": "none"}, {"name": "usb-c", "sentiment": "none"}, {"name": "mewtwo", "sentiment": "none"}, {"name": "marowak", "sentiment": "none"}, {"name": "gastly", "sentiment": "none"}, {"name": "el capitan", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "youtube tv", "sentiment": "none"}, {"name": "dslr", "sentiment": "none"}, {"name": "time machine", "sentiment": "none"}, {"name": "nest aware", "sentiment": "none"}, {"name": "press command", "sentiment": "none"}, {"name": "nintendo switch", "sentiment": "none"}, {"name": "north face", "sentiment": "none"}, {"name": "pst  youtube", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "beta software program", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "utc", "sentiment": "none"}, {"name": "download now check", "sentiment": "none"}, {"name": "mac app store", "sentiment": "none"}, {"name": "apple watch edition", "sentiment": "none"}, {"name": "macbreak weekly", "sentiment": "none"}, {"name": "skype", "sentiment": "none"}, {"name": "download now bates motel", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "omega", "sentiment": "none"}, {"name": "nintendo", "sentiment": "none"}, {"name": "woven nylon", "sentiment": "none"}, {"name": "iwc", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "apple  apple watch  watchos", "sentiment": "none"}, {"name": "app store", "sentiment": "none"}, {"name": "apple watch nike", "sentiment": "none"}, {"name": "download now star trek beyond", "sentiment": "none"}, {"name": "apple best", "sentiment": "none"}, {"name": "the korea herald", "sentiment": "none"}, {"name": "amazon   withings home  withings home", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}, {"name": "espn", "sentiment": "none"}, {"name": "logitech", "sentiment": "none"}, {"name": "amazon    the north face", "sentiment": "none"}, {"name": "nike", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "facetime", "sentiment": "none"}, {"name": "apple apple", "sentiment": "none"}, {"name": "apple watch", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "amazon web services", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "slim credit card wallet", "sentiment": "none"}, {"name": "fox sports networks", "sentiment": "none"}, {"name": "mlb", "sentiment": "none"}, {"name": "sierra", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "review apple tv review apple", "sentiment": "none"}, {"name": "google google inc.", "sentiment": "none"}, {"name": "sierra public beta", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "news hub", "sentiment": "none"}, {"name": "nintendo entertainment system", "sentiment": "none"}, {"name": "korea herald", "sentiment": "none"}, {"name": "apple tv apple watch ceramic edition review best", "sentiment": "none"}, {"name": "apple tv", "sentiment": "none"}, {"name": "amazon   canary  canary", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "amazon    moshi digits  moshi digits", "sentiment": "none"}, {"name": "bates motel", "sentiment": "none"}, {"name": "apple phone", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The iPhone Blog Pokémon Go Events: Here's what's next! YouTube TV will bring live TV to your iPhone for $35 per month How to make Skype, FaceTime, or Hangouts video look great How to get lost iCloud contacts back on your iPhone iCloud, App Store hit with service disruptions. Have you been affected? Best Touchscreen Gloves for Winter How to download tvOS 10.2 beta 4 to your Apple TV Apple Watch Ceramic Edition Review Best new movies and TV shows on iTunes How to download macOS Sierra 10.12.4 public beta 4 to your Mac How to download iOS 10.3 public beta 4 to your iPhone or iPad Best Indoor Security Cameras Transfer files to your iPhone with ease with this MFi memory stick! Comic: Top of the Heap Forever iPhone 8 rumor roundup: What you need to know right now! Best way to shoot photographs at night with the iPhone Will Nintendo Switch support GameCube controllers? How to set up your HomeKit accessories Save $20 on this iPhone 7 wooden back cover today We're giving away the new full-grain leather slim wallets from Pad & Quill! Pokémon Go Events: Here's what's next! \nPosted: 28 Feb 2017 04:00 PM PST\n\nWhat's the next event for Pokémon Go? Here's what you need to know!\nUpdate: Pokémon Go has three major new features coming in 2017 — here's the tease from MWC!\nPokémon Go is intended to get you out and about, both on your own and with family and friends. One of the ways Pokémon Go tries to bolster activity is with events. Some of the events get splashy announcements and coincide with big public holidays. Others are quieter and more regular.\nSo far, events have only ever been announced a couple of days in advanced. Still, based on past events we can make some good guesses about future events, and we can also keep track of the behind-the-scenes events that don't get announced. In other words, bookmark this page and check back often!\nBREAKING: Pokémon Day Event | Pokémon Go Gen 2! \nNew: Best evolutions | Evolution Items | Umbreon + Espeon | Hitmontop \nGuides: Pokémon Go tips + tricks | Pokémon Go cheats \nPokémon Go at Mobile World Congress 2017 Mobile World Congress (MWC) is a large consumer electronics show held yearly in Barcelona, Spain. John Hanke, CEO of Niantic, the company that develops Pokémon Go, spoke at the show and revealed that three (3) major updates would be coming to the game in 2017. Major is Pokémon Go lingo for Gen 2-sized updates. So, what could they be? Pure speculation:\nGen 3, which if it follows the same timeline as Gen 2, could hit between summer and fall. Player vs. player. PvP would be a great way to boost engagement. New Gym combat system. The current one was what they could do for launch but a more sophisticated one has been in the works. Again, those are just guesses. We'll have to wait and see what 2017 delivers!\nHow to prepare for Pokémon Go Gen 3 now \nCurrent Pokémon Go Event: Pokémon Day from February 26 to March 6, 2017 \nPikachu is ready to lead the Pokémon Day celebration in Pokémon GO. From February 26 at 1:00 p.m. PST to March 6 at 1:00 p.m. PST, any Pikachu you encounter in the wild will be wearing a festive party hat! The Pikachu you catch during that time will keep its party hat forever, so be sure to look for this special Pikachu during its short time in the wild.\nThe Pokémon Day event is now live, so get out and catch your party hat Pikachu and catch or evolve your party hat Raichu now!\nHow to catch Pokémon Day party hat Pikachu and raving Raichu \nNext Pokémon Go Event: Nest Migration on March 8, 2017 \nThe next Pokémon Go nest migration is expected to occur at 7 p.m ET / 4 p.m PT on Wednesday, March 8, 2017 (midnight UTC on Thursday, February 9. 2017). Pokémon Go never announces nest migrations but they've occurred every two weeks at exactly the same time for months. There's always a possibility that will change but, until it does, the nest migration is a safe bet.\nWhat are Pokémon Go Nests and how do you find them? \nWhat should you do to prepare for the next nest migration? Visit your local nests and stock up on the existing spawns while you still can. That includes any you might need to complete your Pokédex, medals, and build up your high-powered Pokémon. Sadly, the Tyranitar, Dragonite, and Chansey lines don't nest, and Magikarp sticks to water spawns. Rhynhorn does nest, though, and so do the Pokémon you need to max out Gen 1 and Gen 2 starters, and new triple-evolutions. Catch 'em all — en masse!\nWhat should you do when the next nest migration happens? Nest migrations are seemingly random, so after it happens get out and discover what your local nests are now spawning. Sometimes a previously great nest will go bad, and sometimes a common nest will start spawning rares. The only way to tell is to visit it a few times and see what pops up frequently or in number.\nThen, do all your fellow players a solid, and report your findings .\n2017 Pokémon Go Events: The potentials! \nBased on past events, there are a few guesses we can make about future events. First, regional holidays don't mean regional events. Halloween isn't an internationally observed occasion but the event was worldwide. The U.S. Thanksgiving is only celebrated in the U.S., but was likewise a worldwide event. Granted, Pokémon Go is developed by a U.S. company, but it does indicate that other regional holidays could provide the impetus for other worldwide events.\nAlso, Pokémon Go has multiple levers to pull. They can increase rewards, like candy, XP, and stardust. They can decrease requirements, like walking distance. They can increase spawn rates for all or specific Pokémon and create limited edition Pokémon just for events. They can also give away items or increase their duration.\nLastly, Pokémon Go can have events to aid in charitable causes, like the highly localized tsunami-relief event in Japan that features almost exclusive Lapras spawns, and the Daily Bonus event that tied into a new, international game mechanic. So, if they want to maintain momentum and there's too long a gap between proper occasions, Pokémon Go can invent their own.\nPokémon Go St. Patrick's Day Event around March 17 St. Patrick's Day sounds like it might be too small for a Pokémon Go event but you never know. U.S. Thanksgiving got on, and St. Patrick's Day is celebrated in North American, the U.K., and elsewhere.\nMaybe some extra Luck-y Eggs?\nPokémon Go Easter Event around April 16 An Easter event for Pokémon Go would be a great mirror for the Holiday Event. Eggs seem like the most natural fit, including longer-lasting lucky eggs or greater frequency for Pokémon eggs. Perhaps even lower walking distance to hatch them?\nA special edition Chancey or WigglyTuff would also be fun.\nShiny Event There's also code in Pokémon Go for \"shinies\", or color variant Pokémon like the red Gyrados. If and when Pokémon Go decides to put those ultra-rare mons live, a short event around the launch could give it some extra luster.\nThe Great Birds Then, of course, there are the last remaining Gen 1 Pokémon still unseen in the game: The Great Birds, Mew, and Mewtwo.\nThe Great Birds sound like they'll be saved for a real-time event, where they're released at a specific time and place for those who gather for them. When that'll happen, and how Mew and Mewtwo will be handled, remain huge questions.\nPast Pokémon Go Events \nThe best indicator of future behavior is past behavior. So, to look forward to the next Pokémon Go events, it's helpful to look back at the events that have already run.\nPokémon Go Valentine's Day Event Pokémon Go ran a Valentine's Day event for a whole week! That's right, from February 8 to February 15, 2017, there was double candy, extra pink Pokémon, and Lures that lasted six hours .\nMore about the Pokémon Go Valentine's event \nPokémon Go Holiday & New Year Events The Pokémon Go Holiday & New Year Events overlapped, the holiday part running from December 25 through January 3, 2017 and the New Year part, December 30 through January 8.\nDuring the holiday part, it offered and increased spawn rate for limited-time Santa Pikachu, an increased chances of hatching Gen 2 babies Cleffa, Igglybuff, Togepi, Smoochum, Elekid, or Magby, and a free 1-time Incubator from the first PokéStop spin of the day.\nDuring the New Year part, it offered Increased spawn rate for Gen 1 Starter Pokémon and their evolutions, Bulbasaur, Ivysaur, Venusaur, Charmander, Charmeleon, Charizard, Squirtle, Wartortle, and Blastoise, and Lures lasting twice as long.\nMore about the Pokémon Go Holiday and New Year Events \nPokémon Go Thanksgiving Event The Pokémon Go Thanksgiving Event ran from November 23rd through November 30th. It offered Double XP and Stardust for catching, hatching, and evolving Pokémon.\nMore about the Pokémon Go Thanksgiving Event \nPokémon Go Halloween Event The Pokémon Go Halloween Event ran from October 26 through November 1. It offered double candy for catching, hatching, and transferring Pokémon, and cut the distance for walking Buddy Pokémon down to 1/4. Increased spawn rates were also offered for Zubat, Golbat, Drowzee, Hypno, Gastly, Haunter, Gengar, Cubone, Marowak, Meowth, and Persian.\nMore about the Pokémon Go Halloween Event \nWhat Pokémon Go events do you want to see? If you were planning the next big Pokémon Go event, when would you have it and how would you handle it?\nPokemon Go \nPokémon Go Ultimate Guide Pokémon Go tips and tricks Pokémon Go cheats Where to find rare Pokémon How to catch rare Pokémon How to hatch Pokémon Eggs faster Best Pokémon to evolve and power up Best Pokémon movesets Fix Pokémon Go problems Pokemon Go help and discussion forum YouTube TV will bring live TV to your iPhone for $35 per month \nPosted: 28 Feb 2017 02:09 PM PST\n\nYouTube's TV streaming service starts its U.S. rollout this spring with support from the four major networks.\nYouTube has announced a streaming TV service, called simply YouTube TV. Arriving this spring, the service will offer live TV streaming from the four major U.S. networks, ABC, CBS, FOX, and NBC, along with several other cable networks. YouTube is also partnering with local stations across the U.S. to bring customers local news and sports coverage in their markets.\nFrom YouTube :\nYouTube TV gives you the best of live TV, from must-see broadcast shows like \"Empire,\" \"The Voice,\" \"The Big Bang Theory\" and \"Scandal,\" to the live sports you want. YouTube TV includes major sports networks like ESPN and regional sports networks like Fox Sports Networks and Comcast SportsNet, so you can watch your favorite NBA or MLB teams. We've also partnered with local TV stations, so you'll also get sports and local news based on where you live.\nIn addition to its channel lineup, YouTube TV also offers unlimited cloud DVR space. You'll be able to use the service on your iOS devices in addition to Android and Chromecast products. Each membership supports up to six accounts, with three concurrent streams allowed at a time.\nYouTube TV won't be available across the U.S. all at once. Instead, the service will launch in the largest TV markets, before starting its expansion into other cities. In any case, you can sign up here to be notified when YouTube TV is available in your area.\nHow to make Skype, FaceTime, or Hangouts video look great \nPosted: 28 Feb 2017 12:30 PM PST\n\nFrequently video chat with friends, co-workers, or podcasters? Here's a few tips to look like a pro.\nVideo chatting with friends and co-workers has practically become a way of life in our modern world. I use Skype and FaceTime pretty much daily in my home and work life, and because of that, I've spent a good deal of time trying to perfect my video quality.\nWhether you wear pajama bottoms or a dress shirt for a video chat, you shouldn't have to settle for sub-par results: Here are my favorite tips for making your webcam video look better than the rest.\nFilm from above, not below Light it up Create a good backdrop Add effects and white balance with iGlasses \nFilm from above, not below \nWhether you're using an iMac, MacBook Pro, third-party webcam, or iPhone, the worst you can do is have your camera below your face, pointed up — human faces do not look great chin-first. In an ideal world, you want your camera positioned slightly above eye-level, looking down at you.\n\nLight it up \nWhile the \"calling you from a dark cave\" look is great if you're trying to cultivate an air of mystery, it's not the best way to chat with your co-workers. If you want to communicate effectively, you want light on your face. The best way I've found is with ambient lighting behind your computer or webcam — adjustable Hue lights that bounce their light off the wall, for instance, a Hue Go , or Nanoleaf Aurora .\nIf you need to bathe an entire office in light, consider getting a few portable LED lights and tripods: iMore editor-at-large Rene Ritchie uses these to light up his personal studio at home for video shows like MacBreak Weekly .\nA word of advice: You never want to point lights directly at your face unless they're from a distance and allowed to diffuse somewhat, and you'll want to make sure you're evenly lighting yourself on both sides, lest you get the opposite of dark cave calling — \"I'm in an interrogation room, send help.\"\n\nCreate a good backdrop \nIf you're routinely chatting from a specific space in your home — especially if these video chats are for work — it may behoove you to declutter your surroundings.\nA few things to avoid in the background of video chats:\nWindows and lit lights: Both will create giant highlight spots that can either provide a wacky backlight or just pull focus from your face; to fix, cover your windows with drapes and turn your lights off Crazy patterns: They will pull focus Reflective glass in picture frames: I've broken this rule myself, but be careful of putting posters or pictures on a wall that can reflect your studio lights, or use anti-reflective acrylic . Garbage and other mess: Especially if you're calling someone for work, make your studio space look professional and ditch the mess \nAdd effects and white balance with iGlasses \nI've saved my favorite video trick for last: eCamm's iGlasses for Mac gives you a fully-adjustable editing window for your video in every program, letting you change your exposure, temperature and tint, and crop and zoom; you can also flip your video and add weird effects (if you're into looking like a space alien on your call). I've used iGlasses for years to brighten my video and crop out pesky things like windows, and it's made a huge difference.\nYour tips and suggestions?   Do you have any tips and suggestions for great webcam video? Let me know below.\nHow to get lost iCloud contacts back on your iPhone \nPosted: 28 Feb 2017 12:00 PM PST\n\nWhy has my friend's contact info disappeared from my iPhone? You may need to resync your iPhone with iCloud.\nWhenever I sign out of iCloud and back in on my iPhone, some of my contacts will inevitably disappear. Given enough time, most of them restore (it takes a few minutes for iCloud to sync). But, sometimes, my contacts don't reappear. If you've had this problem, don't stress out. There is a way to fix it!\nNote : This guide is for people that sync their contacts in iCloud. If you sync with Google, Microsoft, or something else, this isn't for you!\nHow to reset your contacts to sync with iCloud on your iPhone If you've recently signed out of and back into iCloud, you're going to have to manually change your default account settings for the Contacts app.\nLaunch the Settings app on your iPhone. Tap Contacts .\n\nTap Default Account . Tap iCloud .\n\nHow to see if any contacts are not synced in iCloud If you've changed your default account settings for the Contacts app to iCloud, you may notice that some contacts that were stored on your iPhone are now missing. You can find them and manually add them to your Contacts app. Then, when iCloud backs up your iPhone again, those contacts will be added and saved.\nLaunch the Phone app on your iPhone. Tap Contacts . Tap Groups .\n\nTap All iCloud to uncheck it. Tap All [iPhone name] to select it. Tap Done in the upper right corner of the screen.\n\nYou will see a list of contacts that are synced directly to your iPhone. Find any missing contacts. Then, add them to your iCloud Contacts list.\nHow to add unsynced contacts back into iCloud Share the contact with yourself through Messages. Close the Contacts app.\n\nLaunch the Message app. Tap the Contact card . Tap Create New Contact . Add any additional information you want to the contact card. Tap Done in the upper right corner.\n\nAny questions? Do you have any questions about syncing your Contacts with iCloud? Put them in the comments and we'll help you out.\niOS \niOS 11 Roundup iOS 10 Review iOS 10 FAQ iOS 10 News Hub iOS Help Guide iOS Discussion iCloud, App Store hit with service disruptions. Have you been affected? \nPosted: 28 Feb 2017 11:55 AM PST\n\nA number of Apple's online services are experiencing service disruptions. Are you having any trouble?\nA large percentage of Apple's online services, including iCloud and the App Store, are experiencing a service outage. The problems stem from issues currently affecting Amazon Web Services, which Apple uses to power part of its online infrastructure.\nAccording to Apple , the following services are experiencing some kind of issue:\nApp Store Apple Music Apple School Manager iBooks Store iCloud Backup iCloud Drive iCloud Notes iCloud Web Apps iTunes in the Cloud iTunes Match iTunes Store iWork for iCloud Mac App Store Photos Volume Purchase Program Other services, including Find My iPhone, Reminders, and Maps, all seem to be in working order. According to Apple, fewer than 0.04% of customers are affected by the issues with iCloud. There is no word just yet as to when service will be fully restored, but a lot of that depends on Amazon.\nHave you been affected by this outage? Let us know how, and when they start working again for you!\nBest Touchscreen Gloves for Winter \nPosted: 28 Feb 2017 11:00 AM PST\n\nWhat are the best touchscreen gloves? The ones that keep your hands warm and actually work!\nUpdated: February, 2017: Added the 180s Sustain gloves\nThere are still a few weeks left in winter, and that means that using your phone outside is uncomfortable and makes for frigid digits. That is, unless you have some awesome touchscreen gloves that let you use your phone with toasty phalanges.\nNot all gloves of this nature work very well, so here are the best of the best to keep you texting even when Jack Frost is nipping at your butt.\nMujjo double-layered touchscreen gloves Agloves The North Face ThermoBall Etip Glove.ly Classic Touch Screen Glove Moshi Digits 180s Sustain Nanotips \nMujjo double-layered touchscreen gloves \nThese dual-layer gloves are Mujjo's response to customers asking for something a bit thicker for colder climes. They added a layer of wool (just like grandma used to do!) so you can now have your phone and keep your hands warm too.\nSilicone grips all over the palms of these gloves make sure your phone doesn't slip out of your hands in slippery weather, and Mujjo has made it so that you can use any fingertip, knuckle, and even the palm or heel of your hand. It's almost like you're wearing nothing at all… Nothing at all… Nothing at all!\nSee at Amazon \n\n\nAgloves \nThese acrylic gloves have ten-finger functionality, meaning you can use any finger to use your phone, while keeping warm.\nThey come in black, red, brown, navy, or white. These aren't the thickest gloves around and probably won't do the trick when temps drop below zero, but what are you doing standing around long enough to use your phone when it's that cold anyway?\nSee at Amazon \n\n\nThe North Face ThermoBall Etip \nAs a Canadian, I can attest to The North Face's quality. The ThermoBall Etips are a little on the bulky side for touchscreen gloves, so movement is somewhat difficult, but they work exceptionally well, even in colder weather.\nThey come in men's and women's sizes and styles, so there's a ThermoBall Etip for everybody.\nSee at Amazon \n\n\nGlove.ly Classic Touch Screen Glove \nGlove.ly Classic gloves let you use any part of your hand to control your phone. They're not for arctic temperatures, but they're warmer than most of the thinner touchscreen gloves you might find.\nIf your screen gets smudged and dirty, you can use the built-in microfiber label to keep it clean, and magnets hidden under the logo help to make sure you don't lose a glove.\nThey come in small or medium/large, so make sure you choose the right size.\nSee at Amazon \n\n\nMoshi Digits \nMoshi Digits are excellent touchscreen gloves that do a great job of keeping your hands warm, and they work very well when it comes to using your phone while wearing them.\nThey feature a double-layer of material that helps keep your fingers warm, even when it's quite chilly outside (better than most touchscreen gloves). Each glove also features Moshi's \"GripTrak\" pattern on the palm to ensure that you never drop your phone, even in icy weather.\nThough they're dual-layered gloves, they shouldn't slow down your texting ability, even if you have fingers of lightning.\nSee at Moshi \n\n\n180s Sustain \nIf you live where it gets below 20 Fahrenheit, the 180s Sustain can keep your paws toasty, while still allowing you to use your phone, thanks to touchscreen-compatible tips. The Wirecutter says they're not exceptional in terms of touchscreen capabilities, but they do work, and they're excellent as heavy duty gloves.\nIf you wanna keep texting while you're out ice fishing or take a call on your snowmobile, then the Sustain gloves are your best option.\nThey come in men's and women's sizes, so make sure you choose the right on before checkout.\nSee at 180s \n\nNanotips \nDon't feel like buying a brand new pair of gloves? Nanotips makes it so you don't have to. Just paint a coating onto the thumbs and fingertips of your favorite gloves and they become touchscreen gloves.\nThe efficacy of Nanotips really depends on the what material your gloves are made of, and you may see varying results with different pairs of gloves. Nanotips does make a leather formula and one for fabric/acrylic, so make sure you choose the correct formula.\nSee at Amazon \n\nGot a favorite? Do you have a favorite pair of touchscreen gloves? Do you even use them? Let us know in the comments below!\nHow to download tvOS 10.2 beta 4 to your Apple TV \nPosted: 28 Feb 2017 10:04 AM PST\n\nInstalling the tvOS 10.2 beta is more complex than an iOS or macOS beta, but it's also for developers only.\nUpdate February 28, 2017: Apple has just released tvOS 10.2 beta 4 for developers. If you already have a tvOS 10 beta installed, proceed to System > Software Updates and download away. If you've been waiting for beta 4 to get started with tvOS 10.2, keep reading and we'll walk you through the set up!\nApple hasn't announced a public beta for tvOS the way the company has for iOS and macOS. That means until it is released to everyone this fall, it's only available to developers. It also means installing it on the Apple TV (4th generation) is more complicated than a simple download and go. If you're a developer and you're having trouble getting the tvOS beta installed, here's what you need to do.\nUnlike Apple's other operating systems, you can't back up your Apple TV; as such, Apple offers two options for updating tvOS: over the air, which just updates the system; and via USB-C, which restores the device to its factory settings.\nHow to install the tvOS 10.2 beta over-the-air How to install the tvOS 10.2 beta over USB-C How to install the tvOS 10.2 beta over-the-air A note, before we begin: \"Over the air\" is technically a bit of a misnomer, since you have to use a USB-C cable to initially connect your Apple TV to your Mac to install the tvOS configuration profile. That being said, once you've installed the configuration profile, you'll be able to wirelessly update your Apple TV to any subsequent beta versions.\nUpdating over the air only updates the system software; your configurations and apps should remain on your Apple TV as-is.\nOn your Mac, go to developer.apple.com/download . Enter your developer username and password to log in. Click on the blue Download button to the right of tvOS 10 beta configuration profile . Install the Apple Configurator app from the Mac App Store. Connect your Apple TV (4th generation) to AC power . Connect your Apple TV (4th generation) to your Mac using a USB-C cable. Launch Apple Configurator . Click on Add Profiles to your Apple TV and add the tvOS 10 beta configuration profile you downloaded previously. (Or simply drag and drop the file to the Apple TV icon.) Reboot your Apple TV once the configuration profile is installed. On your Apple TV , click on Settings . Click on System . Click on Software Update . Your Apple TV should now detect tvOS 10.1.1 and download and install it just like any other update.\nHow to install the tvOS 10.1 beta over USB-C If you prefer to wipe your Apple TV developer unit before updating, you can use the Restore Image option, which connects to your Mac via USB-C.\nOn your Mac, go to developer.apple.com/download . Enter your developer username and password to log in. Click on the blue Download button to the right of tvOS 10 restore image . Click on the blue Download button to the right of Xcode 8 . Install Xcode 8 on your Mac. Connect your Apple TV (4th generation) to AC power . Connect your Apple TV (4th generation) to your Mac using a USB-C cable. Launch iTunes . Select your Apple TV when it appears in iTunes . Hold down the Option key and click on Check for Updates . Browse to and click on the tvOS 10.1.1 beta you downloaded in step 3. Once iTunes has updated your Apple TV, hook it back up to your television and you're good to go.\nHave you got tvOS 10.1.1 up and running on your Apple TV? Which method did you use and how did it work for you? \nApple TV \ntvOS 10 Review Apple TV Review Apple TV buyers guide Apple TV users guide Apple TV news Apple TV discussion Buy at Apple Apple Watch Ceramic Edition Review \nPosted: 28 Feb 2017 10:00 AM PST\n\nGone are golds yellow and rose and in their place Apple Watch has a whole new Edition — Ceramic White.\nThe original Apple Watch Edition launched in 2015, was crafted out of yellow or rose gold, and cost $10K and up. It was for people who stay in 6-star hotels, fly in cabins, wear couture—maybe only once—and would certainly buy something as trendy as an Apple Watch but only if it came in gold. It was also for the fashion and watch worlds, a substance to get attention beyond the silicon.\nI had several opportunities to see it at and around Apple events and it was legit gorgeous. But a market used to affordable luxury doesn't like even the idea of luxury they can't afford: While the original Edition generated attention, it also generated more than a little resentment.\nSo, in late 2016, Apple replaced it with an all-new Edition. Gone was the gold and the gobsmacking price tag, and in its place a still pricey (starting at $1,249) but much more attainable ceramic white.\nI didn't get one at launch but I managed to get my hands on one a couple of weeks ago. Since then, I've worn the new Apple Watch Edition Series 2 full-time, and here's my review.\nSee at Apple \nThe Watch Apple Watch Edition Series 2 is different. Apple Watch Nike+ is a variant of the standard anodized aluminum Apple Watch Series 2. Apple Watch Hermès Series 2, a variant of the standard polished stainless steel. Apple Watch Edition Series 2, though, has a material all its own — ceramic.\n\nApple Watch Edition paired with Product (RED) Sport Band. I call it 'The Canada'.\nCeramic isn't unusual for a watch. There have been ceramic watches for several decades, from IWC to Rado to Omega. Not many have been as fully ceramic as Apple Watch Edition, though, which uses it for pretty much everything on the casing that's not sapphire glass.\nAccording to Apple, the company's particular blend of ceramic uses a high-strength zirconia powder combined with alumina to produce the desired white color. It's compression molded and \"sintered\" — a process that uses pressure and heat to turn a powder into a solid without liquefying it. That solid is then polished with — get this! — a diamond \"slurry\" that makes it smooth and shiny. The end result is perhaps the ultimate extension of the look that Jony Ive began with iPod: A perfect-seeming capsule of deep, rich white.\nAnd it takes days to make, because of course it does.\nCeramic is incredibly hard. Harder even than stainless steel. Combined with the sapphire glass, the new Apple Watch Edition is the most scratch and scuff-proof product Apple's ever made.\nThere are different kinds of toughness, though. And, with ceramics, the worry has always been less about hardness and more about brittleness: The almost cliched image of a plate falling and shattering across the kitchen tiles.\nAs much as Apple's materials team worked to amplify the benefits of ceramics, though, they and the design team also worked to minimize the drawbacks. That involved both the precise type of ceramics Apple used, but also the design, and especially the curves, of the case itself.\nI spoke with watchmaker Jon Edwards about the new Apple Watch Edition, and he said:\nApple's chosen a flavour of ceramic that is relatively robust, to help guard against breakage. In addition to this, though, the form of the case plays well to the ceramic's strength. If the design team had ceramic in its sights for the Apple Watch from day one, the form of the case is pure genius.\nIn my experience working with ceramic watches, most damage tends to occur along sharp edges or where the ceramic is thin. The round curvature of the Apple Watch case will distribute the force of an impact and/or allow objects to easily glance off of its glassy, smooth surface. Edges that might pose a weakness are protected by the crown and strap.\nThe subtle step in the case where is meets the sapphire crystal, I imagine, was introduced, in part, to offer an extra bit of protection for the sapphire, which would be more susceptible to cracking if impacted along its edge where it meets the ceramic case than the ceramic itself would be.\nWhile tougher than metal, the ceramic is also slightly heavier weighing in at 45.6g compared to 28.2g for the aluminum and 41.9g for the steel. In practice, though, I don't notice it much. I've worn steel for most of the last eighteen months. Nike+ was breezy when I switched to it for a few weeks, but there's a substance to the steel — and now ceramic — that I enjoy.\nThe digital crown and side button are made the same way as the case and in the same color. Though the cap on the crown is black, matching the ceramics on the heart rate sensor. At first, I thought a white cap would have been better but the contrast, which also matches the darkness of the display, has grown on me.\nSo has the text on the back. It's not simply etched around the sensor the way it is on the metallic Watches, so you have to tilt it to see what it says. It uses a different process rumored to involve lasers and resins. The end result, though, pops. It looks like black ceramic embedded in white. Which is trippy.\nThat yin and yang, dark and light, bright and shadow, plays out at different scales across the casing and, depending on the band, the watch in general. It creates a look that's stunning but not overly fussy about it. It's obviously not metal, even at a glance, and that in itself stands out.\nIt's gorgeous on its own but also works as a canvas to set off whatever strap you pair it with.\nApple Watch Series 2 + watchOS 3 Previously, on iMore, Serenity Caldwell and I took a look at the aluminum and stainless steel Apple Watch Series 2, Apple Watch Series 1, Apple Watch Hermès Series 2, Apple Watch Nike+, and watchOS 3. Rather than recapitulate the standard hardware and software features, I invite you to check out:\nApple Watch Series 2 review watchOS 3 review Apple Watch Series 2 + watch OS 3: Second opinion Apple Watch Hermès Series 2 review Apple Watch Nike+ review The Bands I may have an Apple Watch band problem. Or, an Apple Watch band solution, as I prefer to tell myself. Either way, I've bought a wide assortment of straps over the last eighteen months and I like to switch them up to suit the occasion and my mood.\n\nApple Watch Edition Series 2 with Hermès Single Tour in Feu (fire orange). Love the look if not the lug clash.\nApple Watch Edition Series 2 ships with a white fluoroelastomer sport band, which is underwhelming. I get that it's probably the only way to pair whites that are close to a perfect match, but the Edition brand, to me at least, demands something more in the box. The similarly priced Apple Watch Hermès, for example, comes with an orange fluoroelastomer sport band — but also Hermès leather.\nThe ideal, of course, would have been a white ceramic single deployment (deployant). It would have made the package much, much more expensive but as an option, I'd have taken it. Not only would it look stunning — several other watch makers have ceramic bands on the market, so image search away! — but it's safer as well. A band you don't have to fuss with to loop around your wrist is a watch you're a lot less likely to drop.\nHopefully, something like that is on Apple's roadmap.\nLikewise, ceramic lugs. I love the way many of my straps look with Apple Watch Edition, but all the leathers have stainless steel lugs and I can never unsee the connection class. I'm wary of third-party lugs, especially in ceramic, so if Apple could start selling swappable lugs the way they sell replacement links for the bracelet, I'd be in band heaven.\nThe leather loops don't have that problem, of course. Their lugs match the straps. I have the brown and midnight blue versions and both look great.\nThe sport bands are the same. I particularly love the red sport with the white ceramic. Because Canada. Woven Nylon makes for especially great pairings as well. The coffee and toasted caramel makes the white ceramic look like the froth atop a latte. I know some people with the full set and they color coordinate with their dress shirts to unsurprisingly terrific results. (Pro tip: The Numerals face has options to both color and pattern match the woven nylon bands.)\nCoffee and toasted caramel woven nylon band with ceramic foam. The \"Latte\", of course. And blue woven nylon. The \"Marina\".\nThe black stainless steel Milanese loop is something else. It makes Apple Watch Edition look like a tux. Like Bond in a tux. It's just retro gadget high contrast cool in a barely contained way.\nI'll stop there and point you to my Instagram if you want to see more. Lots more. Suffice it to say, bands and pairings is what makes Apple Watch not just so fashionable but so flexible and so personal.\nAnd Apple Watch Edition in that deep, rich white really makes all the straps pop.\nThe Conclusion When Apple first announced Watch Series 2, the Edition is the one I wanted to get. I like when Apple experiments with new materials and manufacturing processes. Some might care only so far as what it may or may not portent about future iPhones. But Apple ceramics make for an incredibly cool Watch right in the here and now.\n\nBlack stainless steel Milanese loop makes the \"Tux\". The \"Bond Tux\".\nBecause of the way it looks, I imagined Apple Watch Edition Series 2 would be lighter. Certainly lighter than the stainless steel I was used to. There's only a slight difference, though, and I barely notice it. Aluminum is much lighter than both, and much as I enjoy that freedom, I love this substance.\nAnd I love how Apple continues to not only drive the computer to ever-more personal, ever-more portable places, but now the watch industry as well. There have been link bracelets for years but it took Apple to jumpstart making them easier to use, size, and swap. Likewise, there have been ceramic watches for decades, but Apple is applying their considerable resources to the material now, and in really clever, robust ways. It's the definition of raising all ships.\nThat said, I really hope, though, that Apple works out a way for us to have our casings and matching lugs too. As it currently stands, Apple Watch in polished stainless steel has the most, best pairings available to it. But the ceramic has a look so distinct I'm willing to accept a little clash around the edges, at least for now. You know, while I wait for the ceramic white deployant...\nYellow and rose 18 K gold were certainly extravagant but ultimately failed to resonate with Apple's existing market or really catch on with a new one. White ceramics is a better balance. It's exotic enough to sound enticing and look sensational, but broadly in line with the other high-end watches in Apple's collection, including Hermès.\nIn that sense, Apple Watch Edition Series 2 isn't just better affordable luxury, it's a much better bridge between Apple and the premium watch market. And that's who Apple's competing with now.\nSee at Apple \nApple Watch \nwatchOS 3 review Apple Watch Series 2 review Apple Watch buyers guide Apple Watch users guide Apple Watch news Apple Watch discussion Buy at Apple Best new movies and TV shows on iTunes \nPosted: 28 Feb 2017 09:30 AM PST\n\nEvery week, the iTunes Store adds new movies and TV content to its catalog, and every week we bring you the best of what it has to offer.\nBest new movies on iTunes This week in movies starts with Fences, starring Denzel Washington and Viola Davis, who won an Academy Award for this role, as a couple in 1950s Pittsburgh that struggles against a world that tries keep them down. Following the Academy Awards, Apple is also putting the spotlight on the work of award-winners like Emma Stone , Viola Davis , and Mahershala Ali . The HD discounts this week center on Oscar contenders, with movies such as Saving Private Ryan, Pulp Fiction , and Pan's Labyrinth on sale for under $10. The Movie of the Week is Star Trek Beyond, which is available for a $0.99 rental and a $9.99 purchase.\nFences - $14.99 - Download Now Saving Private Ryan - $9.99 - Download Now Pulp Fiction - $7.99 - Download Now Pan's Labyrinth - $9.99 - Download Now Star Trek Beyond - $0.99 (rental) - $9.99 (purchase) - Download Now Best new TV shows on iTunes Our look at this week's TV starts with new episodes of The Walking Dead, Bates Motel, and Supergirl . Right now, you can get seasons 1-4 of The Americans in a set for $49.99, while the first four seasons are available for $19.99 each separately. This week, get discounts on gorgeous nature shows, with programs like Planet Earth, Frozen Planet, and Life on sale for under $10.\nThe Walking Dead - New Best Friends - $2.99 - Download Now Bates Motel - The Convergence of the Twain - $2.99 - Download Now Supergirl - Homecoming - $2.99 - Download Now The Americans - Seasons 1-4 - $49.99 - Download Now Planet Earth - Series 1 - $9.99 - Download Now Frozen Planet - $9.99 - Download Now Life - $9.99 - Download Now Check in next week for more in movies and TV from the iTunes Store.\nHow to download macOS Sierra 10.12.4 public beta 4 to your Mac \nPosted: 28 Feb 2017 08:42 AM PST\n\nmacOS Sierra, the next generation of Mac software, is now available as a public beta.\nUpdate February 28, 2017: Apple has released macOS Sierra 10.12.4 public beta 4 for members of the Beta Software Program. If you already have the macOS Sierra public beta installed, head to Mac App Store > Updates and download away. If you've been waiting for beta 4 to get started with macOS 10.12.4, keep reading and we'll walk you through the set up!\nApple has been offering public betas for macOS for a couple of years now as a way for those interested in testing out the upcoming software on their Macs, and providing feedback. If that's you, you'll need to sign up, enroll your Mac, download macOS Sierra , and install it. It's not an overly complicated process, but we're here to walk you through it and, if you need it, a place to get extra help. \nApple occasionally offers updates to iOS 10 , watchOS 3 , tvOS 10 , and macOS Sierra as closed developer previews or public betas for iPhone, iPad, and Mac. (Sadly, no public betas for the Apple Watch or tvOS.) While the betas contain new features, they also contain pre-release bugs that can prevent the normal use of your iPhone, iPad, Apple Watch, Apple TV, or Mac, and are not intended for everyday use on a primary device. That's why we strongly recommend staying away from developer previews unless you need them for software development, and using the public betas with caution. If you depend on your devices, wait for the final release.\n\n\nNote: This guide is being updated in real time. If you are seeing old content, refresh the page or come back later.\nHow to make a back up your Mac How to register your account for the macOS Sierra public beta How to enroll your Mac in the macOS Sierra public beta How to install the macOS Sierra public beta How to get started with macOS Sierra public beta How to make a back up of your Mac Before joining the public beta, you need to make a backup of your Mac. That way, if something goes wrong, of if you're simply not happy and want to revert to OS X El Capitan, you can go right back to where you started.\nEven if you back up every night, you'll want to make double, triple sure you're covered. So make a manual backup now. Here's how to do it with Time Machine . Even if you use something different or additional, like SuperDuper! , make sure you manually start a backup now.\nClick on the Time Machine icon in your Mac Menubar. Click on Backup now .\n\n\nLet the backup finish before proceeding.\nNote: If you're not adverse to the Terminal, you can also make a bootable El Capitan installer as way to jumpstart reversion, if needed.\nHow to register your account for the macOS Sierra public beta If you've already joined a public beta for OS X in the past, you don't need to register again for macOS Sierra. Simply sign in with the same Apple ID. If you've never joined a public beta before, you'll need to start by signing up with your Apple ID.\nGo to beta.apple.com in Safari on your Mac. Click on Sign up to get started. (If you've already signed up for a previous public beta, Click on Sign in and skip to \"How to enroll your Mac\", below.) Enter you Apple ID email address and password. Click Sign in .\n\n\nOnce you're signed up and signed in, it's time to start downloading.\nHow to enroll your Mac in the macOS Sierra public beta Downloading the macOS Sierra public beta is done through the Mac App Store but requires a special code (like a promo or gift code). The code is provided for you on the website, but is also automatically entered for you when you click to begin the process.\nGo to beta.apple.com , if you're not there already. Click on the macOS tab, if it's not highlighted already. Click the Download macOS Sierra public beta access utility button. Open the file from your Downloads window. Double-click the package to run the installer. When the installer is finished downloading, the Mac App Store will automatically open to the Updates section. Click Update to download and install the public beta software. After the software has been downloaded, your Mac will automatically restart.\nIf the latest public beta does not appear on the Updates list, restart your Mac. Then, open the Mac App Store and click the Updates tab.\nThe public beta update can take a long time to finish downloading, depending on the size. You can check the status in the Updates tab of the Mac App Store.\nHow to install the macOS Sierra public beta The macOS Sierra installer will automatically open when it's downloaded. If it doesn't, or if you prefer to do it later, you open Install macOS Sierra Public Beta at any time via Spotlight or Launchpad, or from the Application folder in the Finder.\nLaunch Install macOS Sierra Public Beta app, if it's not launched already. Click Continue at the bottom.\n\nIf prompted to make a backup, and you didn't before, click Continue in the dropdown. If you just made a backup, click Cancel . Click Continue at the bottom once your backup completes, or if you skipped it. Click Agree to accept the licensing terms. Click Agree again to confirm.\n\nClick on the drive you want to install onto (if you have multiple options; most people won't.) Click Install . Enter you administrator password and click OK . Click Restart (if your Mac doesn't restart automatically, or you don't want to wait).\n\nOnce your Mac reboots, it'll be running macOS Sierra. There's a brief bit of setup you'll need to go through, however, as the system will have changed enough that it'll need your login to complete the update.\nOnce that's done, you'll be ready to rock macOS Sierra.\nWhat's new, and what if you don't like it? To help ease your way into everything, make sure you check out our macOS Sierra preview and our comprehensive macOS FAQ for all the details!\nAnd, if you ultimately decide macOS Sierra 10.12.3 isn't for you, you can still revert back to macOS 10.12.2.\nRunning beta software \nFAQ: Apple's beta software Should you run beta software? iOS 10 public beta: The ultimate guide macOS Sierra public beta: The ultimate guide iOS 10 developer beta: The ultimate guide macOS developer beta: The ultimate guide iOS 10: Everything you need to know macOS Sierra: Everything you need to know How to download iOS 10.3 public beta 4 to your iPhone or iPad \nPosted: 28 Feb 2017 08:40 AM PST\n\nItching to try out iOS 10? The public beta is now available. Here's how to download it!\nUpdate February 28, 2017: Apple has released iOS 10.3 public beta 4 for members of the Beta Software Program. If you already have a version of the iOS 10 public beta installed, proceed to Settings > General > Software Updates and download away. If you've been waiting for beta 4 to get on the iOS 10.3 public beta train, keep reading and we'll walk you through the setup!\niOS 10.3 is coming down the road with a number of new features — features that need real-world testing before the software officially launches. As such, Apple is letting interested users check out iOS 10.3 and provide feedback before it goes into wide release.\nIf you're one of those interested users, however, you will have to go through the public beta download and install process. While it's not complicated, it is different. So, we're going to walk you through it and give you a place to ask questions if you need extra help. \nApple occasionally offers updates to iOS 10 , watchOS 3 , tvOS 10 , and macOS Sierra as closed developer previews or public betas for iPhone, iPad, and Mac. (Sadly, no public betas for the Apple Watch or tvOS.) While the betas contain new features, they also contain pre-release bugs that can prevent the normal use of your iPhone, iPad, Apple Watch, Apple TV, or Mac, and are not intended for everyday use on a primary device. That's why we strongly recommend staying away from developer previews unless you need them for software development, and using the public betas with caution. If you depend on your devices, wait for the final release.\n\n\nHow to make an archived backup of your iPhone or iPad How to register your device with the iOS 10.3 public beta How to enroll your iPhone or iPad in the iOS 10.3 public beta How to install the iOS 10.3 public beta How to get started with the iOS 10.3 beta \nHow to make an archived backup of your iPhone or iPad Before you begin, make sure you back up your iPhone or iPad. While the beta process is fairly straight forward, any time you make any significant change to your device you risk problems. And with your personal data, it's always — always! — better to be safe than sorry. Even if you back up every night, you'll want to make sure it's absolutely up-to-date.\nPlug iPhone or iPad into your Mac or Windows PC. Launch iTunes . Click on the iPhone or iPad icon in the menu bar when it appears. Make sure backup is set to This Computer . (And enable Encrypted backup — it's worth it!) Click on Back Up Now . (Click on Encrypt Backup and add a password — you want the security.) Back up Apps , if asked.\n\n\nPress Command, to open Preferences. (Or go to iTunes in the menu bar and click on Preferences . Click on the Devices tab. Option-click on your Backup and choose Archive .\n\n\nArchiving will prevent your current backup from being overwritten by an iOS 10 backup in the future, should you want to revert for any reason.\n\nHow to register your account for the iOS 10.3 public beta \nIf you've already joined an Apple public beta in the past, you shouldn't need to register again for iOS 10.2.1; simply sign in with the same Apple ID. If you've never joined a public beta before, you'll start by signing up with your Apple ID.\nGo to beta.apple.com on the iPhone or iPad you want to enroll in the beta. Tap on Sign up to get started. (If you've already signed up for a previous public beta, tap on Sign in and skip to our \"How to enroll your device\" section below.) Enter you Apple ID email address and password. Tap Sign in . Tap Accept to agree to the terms and conditions. Once you're signed up and signed in, it's time to start downloading.\n\nHow to enroll your iPhone or iPad in the iOS 10.3 public beta Unlike regular iOS updates, where you just tap and start downloading, Apple is using configuration profiles to validate devices for the iOS 10.2.1 public beta. Here's how to install it.\nNote: If you've been on a previous iOS public beta, you may need to remove the previous beta profile before installing the iOS 10 version. You can do so by going to Settings > General > Profile , selecting the iOS Beta Software Profile, and pressing Delete Profile .\nGo to beta.apple.com , if you're not there already. Tap the iOS tab, if it's not highlighted already. Tap on Download profile . Tap on Install in the upper right corner. Enter your Passcode . Tap on Install , this time to consent to the beta agreement. (Read it: There are risks to any beta.) Tap on Install at the bottom to confirm. (Yes, you need to be really sure.) Tap on Restart to reboot your device. Once your iPhone or iPad has finished rebooting, it should start to download iOS 10 automatically. From this point on, the process is the same as any other iOS update.\n\nHow to install the iOS 10.3 public beta To install the iOS 10.3 beta, you'll need to visit Software Update on your iPhone or iPad.\nLaunch Settings from your Home screen, tap on General , then tap on Software Update . Once the update appears, tap on Download and Install . Enter your Passcode .\n\nTap Agree to the Terms and Conditions. Tap Agree again to confirm. Your iPhone or iPad will reboot to install iOS 10.3. There will be a couple progress bars going across the screen. Sit tight, and let everything finish.\n\nHow to get started with iOS 10.3 public beta Once your iPhone or iPad reboots, it'll be running iOS 10. There's a brief bit of setup you'll need to go through, however, as the system will have changed enough that it'll need your login to complete the update.\nTap Continue . Enter your Apple ID password . iCloud settings will update, so give it a minute. Tap Get Started . Once that's done, you'll be on the Home screen and ready to rock iOS 10.\nWhat if I want to go back to iOS 10.2.1? Note that iOS 10.3 brings with it Apple's new file system, APFS, and as such downgrading to an earlier version of the OS will be highly difficult, if not outright impossible.\nWhat's new in iOS 10.3? So much! We've written a bunch about the new operating system, including a detailed FAQ and sections on its new user interface, Lock screen, Messages app, and lots more.\nRunning beta software \nFAQ: Apple's beta software Should you run beta software? iOS 10 public beta: The ultimate guide macOS Sierra public beta: The ultimate guide iOS 10 developer beta: The ultimate guide macOS developer beta: The ultimate guide iOS 10: Everything you need to know macOS Sierra: Everything you need to know Best Indoor Security Cameras \nPosted: 28 Feb 2017 08:00 AM PST\n\nThese are some of the best indoor security cameras on the market!\nIndoor security cameras are a great way to give yourself peace of mind when you're away from home. Not only can you check in on pets if you have them, you can also receive notifications that'll alert you to intruders. Many cameras feature smart alert systems that can tell you about out-of-the-ordinary sounds and motion in your household, some cameras feature both a speaker and a microphone for two-way communication, and a few even come with sirens and alarms to scare away intruders. If you'd like to add an extra layer of security and safety to your household, consider picking up an indoor security camera!\nNest Cam \nI have a Nest Cam in my home and I'm very happy with it. It automatically turns on when both my partner and I are away from home and alerts us to any motion and sound events that take place in the specified Activity Zones in our home.\nThe Nest Cam features a camera, microphone, and speaker, so you can watch, listen, and talk with the device.\nYou can also subscribe to Nest's cloud service, Nest Aware, to keep a log of your footage.\nSee at Amazon \n\nWithings Home \nWithings Home is as much a security camera as it is a beautiful piece of art.\nIt's got a wide-angle camera with night vision, WiFi and cellular connectivity, and an air quality sensor.\nIt's a pretty attractive little device that offers more than the standard, run-of-the-mill security camera.\nSee at Amazon \n\nCanary \nCanary is more than a security camera — it's an all-in-one security system.\nIt features an HD camera with night vision, WiFi and ethernet connectivity, air quality sensor, and a 90 decibel siren.\nEven though you can't tell your pets how cute they are, that 90 decibel siren is sure to drive out an opportunistic crook who's looking to get away with your property.\nSee at Amazon \n\nDo you have a security camera in your home? Have you equipped your home with a security camera or system? Thinking about it? What security cameras stand out to you? Leave us a comment below or shoot me a tweet over on Twitter !\nTransfer files to your iPhone with ease with this MFi memory stick! \nPosted: 28 Feb 2017 06:30 AM PST\nWhile the Lightning connector included on iPhone and iPads has plenty of benefits, but transferring large sums of data between your Mac and your iPhone or iPad has always been a bit of a pain. Sure, there are options like AirDrop, Hand-Off, and iTunes which help ease the load, but nothing is quite as convenient as good ol' flash storage.\nLightning-enabled flash drives do exist, but with Apple's proprietary technology at play, it's hard to find a quality one for a good price. iMore Offers has the perfect solution to keep you transferring data at lightning speeds!\nLightning-enabled flash storage for 40% off! Learn more \nInstantly free up space on your iPhone or iPad with the iMemStick 3.0 . This 2-in-1 accessory acts as a flash drive and a charging cable, so you don't have to carry around more than one cable at a time.\n\nYou'll never have to worry about the iMemStick 3.0 not functioning with your iPhone because it's Made For iPhone (MFi) certified ! Plus, The iMemStick 3.0 offers transfer speeds of up to 100 MB/s means that moving files between your PC and iOS devices has never been easier!\nFor a cable this fast and convenient, you'd normally pay $130 or more, but if you buy now through iMore Offers, you can receive the iMemStick 3.0 for only 74.99 !\nTransfer all your files with ease! Learn more \nComic: Top of the Heap Forever \nPosted: 28 Feb 2017 06:30 AM PST\n\nRead more comics from The Pixel Project .\niPhone 8 rumor roundup: What you need to know right now! \nPosted: 28 Feb 2017 06:14 AM PST\n\nWhen is iPhone 8 being released? What will the specs be? Will it have special features? Here's everything we know!\niPhone 7s — iPhone 8 — iPhone X — whatever Apple ends up calling the next and \"tenth anniversary\" iPhone, it's expected next fall, and with a new design and new set of features. But what will they be? This article is continuously updated to include the latest news and rumors. Bookmark it, save it, share it, and check back often!\nUpdate: All of iPhone 8's OLED (organic light emitting diode) versions — the same type of display technology currently found on Apple Watch and Touch Bar displays — will be curved and made of plastic, according to The Korea Herald \n\"The OLED version of the new iPhone will all be curved as Apple ordered all plastic OLED -- not glass -- from Samsung Display. Samsung is capable of supplying a little less than 100 million units of curved OLED displays to Apple,\" a source familiar with the matter told The Korea Herald.\n\"The upcoming iPhone may use new sensing technology, which enables the phone to respond when users touch any side of the device. But, Apple may not adopt this technology,\" the source added, without elaborating further on details.\nKeep reading for all the rumors!\nWhat will the next iPhone be called? If Apple sticks to the same pattern the company has been using since 2010, the 2016 iPhone 7 will be followed by the 2017 iPhone 7s.\niPhone : 2007 iPhone 3G : 2008 iPhone 3GS : 2009 iPhone 4 : 2010 iPhone 4s : 2011 iPhone 5 : 2012 iPhone 5s : 2013 iPhone 6 : 2014 iPhone 6s : 2015 iPhone 7s : 2016 Any pattern can be broken, of course, and Apple can ultimately call any iPhone anything the company wants —iPhone Pro, Apple Phone, etc.\nBecause it's rumored to be an all new design, it's possible Apple will skip iPhone 7s and go straight to iPhone 8. Because it'll be 10 years since the first iPhone was introduced, Apple could also call it iPhone X.\nFor the sake of simplicity, iPhone 8 will be used here.\nWill there be an iPhone 8 Plus? There was an iPhone 6 and an iPhone 6 Plus, iPhone 6s and iPhone 6s Plus, and iPhone 7 and iPhone 7 Plus.\niPhone 6 Plus : 2014 iPhone 6s Plus : 2015 iPhone 7 Plus : 2016 So if Apple sticks to that pattern, there'll be an iPhone 8 and an iPhone 8 Plus as well. That lets Apple serve customers who want a phone with the 4.7-inch (or thereabouts) display size and customers who want a tiny tablet with the 5.5-inch (or thereabouts) display size.\nWhen will the iPhone 8 be released? \nSince the iPhone 5, Apple has announced every new iPhone during a special event held the first or second Tuesday or Wednesday of September.\niPhone 5 : September 12, 2012 iPhone 5s : September 10, 2013 iPhone 6 : September 9, 2014 iPhone 6s : September 9, 2015 iPhone 7 : September 7, 2016 Likewise, since the iPhone 5, Apple has shipped every new iPhone the second Friday following the event, with the exception of the iPhone 6s in 2015, which shipped the third Friday following the event:\niPhone 5 : September 21, 2012 iPhone 5S : September 20, 2013 iPhone 6 : September 19, 2014 iPhone 6s : September 25, 2015 iPhone 7 : September 16, 2016 Past patterns are the best indicator of future events, but they aren't perfect. Apple can and will throw curveballs whenever the company's logistics or strategy demands. So, be aware of the dates but don't be bound to them.\nWhat can we expect in the iPhone 8 design? \nUpdate: According to KGI's Ming-Chi Kuo (via 9to5Mac ), the iPhone 8 will be about the same size as the 4.7-inch iPhone 7, though the display is still expected to be somewhere in the 5.5-inch range. Additionally, Kuo claims that the iPhone 8 will feature a significantly larger battery than the iPhone 7.\nAt any given point in time, Apple is working several years ahead on the iPhone line. Upcoming models may already be in the testing or prototype stages while future models may be little more than components attached to boards. Sometimes multiple versions will also exist, some more conservative, others more audacious. What eventually ships depends on what can reliably be produced given the limits of technology and economics.\nSince 2008 Apple has also followed a \"tick-tock\" cycle for iPhones. On the \"tick\" year the company unveils a new design and on the \"tock\" year the company takes that same design to its limits. In 2016, though, Apple broke from that pattern and released a second tock — iPhone 7.\niPhone 3G : 2008 — Plastic shell. iPhone 4 : 2010 — Antenna band and glass back. iPhone 5 : 2012 — 16:9 aspect ratio, chamfered edges. iPhone 6 : 2014 — Bigger screens, rounded edges. Rumor has it the next big iPhone redesign will be more dramatic one, with less bezel around the sides and at the top and bottom and virtualized buttons . Other reports also say that the iPhone 8 will feature a glass front and back, with either aluminum or stainless steel around the edges of the phone. Stainless steel is said to be reserved for the more expensive models\nWhat colors will the iPhone 8 be offered in? Update: Macotakara claims that Apple will reveal a new red color option for the iPhone 7 and iPhone 7 Plus in March. It's likely that this option would also be available for Apple's 2017 iPhone lineup, expected to launch later this year.\nSo far Apple has saved the new iPhone finishes for the years absent big redesigns.\niPhone 5s : 2013 — Gold. iPhone 6s : 2015 — Rose gold. iPhone 7 : 2016 — Black and jet black. Again, Apple can do anything the company wants, any time the company wants, including introducing new colors with new designs.\nWhat specs will the iPhone 8 have? Update: According to a new report from The Wall Street Journal , the iPhone 8 will ditch the Lightning connection port in favor of USB-C. The report also reiterates claims that the phone will sport an OLED display that wraps around the sides of the device.\nSince Apple introduced the company's first branded system-on-a-chip (SoC) in 2010, every new iPhone has come with a new A-series chipset. If Apple sticks to that pattern, the iPhone 8 and iPhone 8 Plus will ship with Apple A11 processors. New SoC typically take advantage of better processes that let them be faster and more powerful but also more energy efficient.\nApple has also been adding coprocessors to handle motion voice activation, and now big.LITTLE fusion. A11 could further build on those capabilities as well, including implementing artificial intelligence and machine learning at the silicon level.\nThe custom CPUs Apple has been producing have gone from Swift to Cyclone to Typhoon to Twister, so... Tropical Storm next? Hurricane? Rumors also persist that Apple is working on custom GPUs and even modems as well, which would allow the company to take full control of everything from graphics to radios. Recent reports indicate that Intel will be supplying at least some of the modems for this year's iPhone lineup.\nWhat about an iPad Pro-style Smart Connector? \nApple typically introduces a technology in one device and then rolls it out across the lineup. Retina was like that with iPhone 4 and Touch ID with iPhone 5s. The Smart Connector, which debuted with the iPad Pro in the fall of 2015, attaches via a magnet and runs power, data, and ground directly from the device. It currently powers Apple's Smart Keyboard and a similar keyboard from Logitech, with more expected to follow.\nApple could certainly engineer a Smart Connector for iPhone 8, but what it would be used for is a more interesting question. Apple made a smaller Smart Keyboard for the 9.7-inch iPad Pro, but would the company make an even smaller one for iPhone 8 Plus? For iPhone 8 standard?\nIf not a keyboard, then what else would benefit from a not-Lightning, non-Bluetooth connection on an iPhone 8-sized device? A speaker pack? A much better camera system? Would Apple enter the modular phone business?\nWhat about the display? More HDs? True Tones? Update: According to a new report from Digitimes , Apple will use 5.8-inch AMOLED display panels provided by Samsung for an iPhone model in 2017, while two other models will utilize 4.7 and 5.5-inch LCD panels.\nApple hasn't updated the resolution on iPhone or iPhone Plus since 2014. It makes them less than desirable for application like VR, and less than competitive when it comes to spec comparisons. It does make them more energy efficient, though, given they still use LCD rather than OLED panels.\nThere have been rumors that we could see a bump to 1920 x 1080 for the 4.7-inch model and 2560 x 1440 for the 5.5-inch model.\nThere have also been rumors about OLED, but right now the LED component of the LCD system is used to implement the pressure-sensitive 3D Touch system, so would Apple re-engineer that? Or would they simply skip ahead again to something like quantum dot?\nAccording to The Korea Herald , any and all OLED versions will be curved and made of plastic, rather than the glass typically used on flat panels.\nAlso, while iPhone 7 got the DCI-P3 wide gamut color system of the 9.7-inch iPad Pro, it didn't get the True Tone system. True Tone employs two ambient light sensors, with four channels each, to measure the color temperate of the surrounding area and then match the display to that temperature.\nIf you've ever seen a picture of an iPhone or iPad where the case looks white but the screen looks yellow or blue, that's what True Tone fixes. And once you get used to it, you want it everywhere.\nAgain, Apple typically pilots a new technology in a new device, but eventually rolls it out across the line. Here's hoping the same holds true with True Tone and we get the incredible calibration and dynamic compensation on iPhone 8 as well.\nWill the iPhone 8 be waterproof? \nUpdate: A new report from The Korea Herald claims that the iPhone 8 will feature an IP68 rating for dust and waterproofing.\niPhone 7 is water resistant but not water proof. Rated IP67, it can survive accidental splashes, dunks, and floods, but isn't rated as highly as some competing phones from Samsung and others.\nAlthough swimming with an iPhone may not be on everyone's wish-list, those whose jobs or pastimes expose them to the elements, and even those who want to do underwater photography at shallow depths would be thrilled by IP68.\nWill the iPhone 8 have wireless charging? \nUpdate: A research note from KGI's Ming-Chi Kuo (via 9to5Mac ) claims that all three of this year's rumored iPhones will feature wireless charging. The iPhone 8 will also apparently have a thin sheet of graphite to protect its new 3D Touch sensor from the heat generated by wireless charging.\nUp until mid-2015, it hadn't been possible to do wireless charging—also known as inductive charging—on a phone with a metal back. Since Apple switched from the glass of the iPhone 4 and iPhone 4s to the aluminum of the iPhone 5 and later models, that effectively meant the company couldn't offer wireless charging as well.\nNow methods for induction through metal are being introduced, which means it's possible Apple could keep the aluminum back and offer wireless charging.\nRecent rumors have also suggested Apple is working on resonant inductive coupling, which would let devices charge even at a distance. (The greater the distance, the lower the efficiency.) Such technology is likely a year or more away, though.\nCeramics, though, right? Apple Watch Series 2 being released in white ceramics sent the internet atwitter with thoughts of iPhone 8 being made out of the same material. Tougher than stainless steel, it still remains to be seen if it would hold up in a device as big as an iPhone or iPhone Plus.\nOkay, what do we know for sure? Only that nothing is confirmed until an Apple executive holds an iPhone 8 and iPhone 8 Plus up on stage!\niPhone 7 iPhone 8 Roundup iPhone 7 Review iPhone 7 Buyers Guide iPhone 7 Users Guide iPhone 7 News Hub iPhone 7 Discussion Best way to shoot photographs at night with the iPhone \nPosted: 28 Feb 2017 06:00 AM PST\n\nHow do I shoot awesome night-time photos with my iPhone?\n\nShooting late at night can be a bit tricky, especially with an iPhone, but you don't need a 7 Plus to capture stunning pictures.\nWhile shooting in the dark isn't the most ideal, and things like portraits can be pretty gosh-darn difficult in low-light situations, there are a couple of things you can keep in mind that'll make your late-night iPhoneography really pop .\nHere are some of the best ways you can shoot photographs at night with your iPhone!\nA lil' light goes a long way #Lenses4life Color, color, color! Bye-bye flash Play with different (typically ugly) light \nA lil' light goes a long way \nThere is a crack, a crack in everything. That's how the light gets in. (Leonard Cohen)\nWhile there are plenty of beautiful photographs of cityscapes and nature scenes that are taken in the middle of the day with bright, vivid lightning, there's something quite intimate and intriguing about a photograph with just a little crack of light in it.\nWhether the light is coming from the tip of a lighter, through a crack in a door, from the flicker of a fading light bulb, or the distant glow of a dying fire, using just a bit of light against the stark darkness can draw the eye in and bring intricate little details to life – something the eye might have missed otherwise if there whole photograph was flooded with light.\nPro tip: Change your distance in between shots when you're shooting a smaller lightning subject to play with angles and see what works best with the dark, shadowy contrast enveloping its edges.\n\n#Lenses4life \nDepending on the type of iPhone you have, your camera quality is going to differ a bit. But regardless of whether you're shooting on an iPhone 6, an iPhone SE, or an iPhone 7 Plus, an external lens is always going to bump up your image quality and change your boring ol' iPhone pics into something really fun to look at!\nBy attaching a wide-angle, macro, fisheye – or any kind of external lens, really – you can take your iPhone to a whole new level of versatility. Not only will your photos come out looking super crisp and clear, but depending on the type of lens you buy, you might actually capture more detail from your subject or environment in a low-lighting situation.\nLenses also add a unique look and feel that an iPhone normally can't capture until editing. For example, using a macro lens up-close-and-personal with a Christmas light in the middle of the dark makes for a heck of a lot more interesting midnight photo than a string of lights 4-feet away from you, blowing in the wind #beentheredonethat\n\nColor, color, color! \nShooting in the dark can be a pain in the ass for a number of reasons, but one big one is making color pop or even look half-decent on camera. That's why when you're shooting at night with your iPhone, it's always good to look for colorful subjects, places, or things that'll really stand out against the darkness.\nWhile it's typically hard to make color in the dark look bright and vivid, try and make it work (unless you're going for some stark-contrast black and white stuff, in which case just ignore me) in little ways. This may seem easier said than done, but you just need to think outside of the box!\nGet your subject to wear a glittery neon-pink hoodie and try and catch a glistening sliver of a streetlamp. Reflect the high beams of one car off that vintage turquoise Ford Thunderbird. Snap a photo of a crowd waiting in front of a 30-foot high rainbow, kaleidoscope of a mural:\nTry to contrast the dark against the vivid.\n\nBye-bye flash \nWhile it's kind of instinct to instantly want to light up and illuminate something we can't see in the shadows, flash needs to be thrown into a barrel and gently ushered over Niagara falls immediately , even when you're shooting photographs at night with your iPhone.\nOn-camera flash should be use sparingly because of the flat, harsh light it produces (thelightmachines)\nWhile a flash will certainly illuminate your image, it will also bring out details and expose bits of the photo you probably didn't want to see in the first place. Plus, flash on an iPhone can be hard to control, and unlike a DSLR, it's quite difficult to diffuse and soften your flash.\nLuckily your iPhone makes it really easy to adjust the exposure and the amount of light that you let into your image. After locking the focus on the photo, you can use your finger to slowly swipe up or down to adjust the exposure and make sure thing's aren't too-too dark or too-too washed out and disgustingly bright.\n\nPlay with different (typically ugly) light \nOkay, so when we say ugly, we don't mean ugly – we mean light that in a daytime situation might not be the most ideal to capture on camera. This includes fluorescent bulbs, neon signs, candlelight, and so, so much more!\nDuring the day, that flashing neon sign at the end of your street at the corner store may look odd, dull, and weirdly-off putting, but at night, it's vibrant patterns and blinking could make for a super cool boomerang for Instagram, or a really interesting hyperlapse video.\nTry looking for light sources that you typically wouldn't pay attention to, like the burners on your stove, or your light-up panda keychain. If you keep your eye open, you're bound to see something interesting to light up your night.\nWhat are your tips for shooting at night? Are you a seasoned night-time photographer? Or do you prefer to use some good ol' fashioned natural lighting? Let us know how you shoot in the comments below (and we'll be sure to try out your tactics)!\nWill Nintendo Switch support GameCube controllers? \nPosted: 28 Feb 2017 05:00 AM PST\n\nWill you be able to use your GameCube controller with Nintendo Switch? Maybe...\nSince the very first Nintendo console (Nintendo Entertainment System) all the way to the soon-to-be-released Nintendo Switch, the gaming company has drastically changed their controller each generation. Nintendo pioneered a few controller features — left and right shoulder buttons as an example — that are widely used by all types of controllers today.\n\nThe Wii and Wii U both allowed gamers to use Nintendo's older GameCube controllers, which many players preferred to use for competitive gaming; however, the Switch will have a dedicated Pro Controller as an additional accessory, leaving the fate of compatibility with GameCube controllers on the fence. Let's dip into all the information we know right now and see what lies ahead for the beloved GameCube gamepad.\nA little history When the Nintendo Wii burst onto the scene back in 2006, the Wiimote was a huge change from conventional game system controllers at the time and, speaking from personal experience, the transition was a little difficult.\nNintendo's decision to include GameCube controller ports on the Wii meant that a lot of Wii games could be played with the previous generation controller, giving plenty of gamers a comfortable backup. This became monumentally noticed when it came to Nintendo's arguably most successful game franchise in the competitive gaming field — Super Smash Bros.\n\nIn fact, it was the Wii U's version of Super Smash Bros. that even made it possible to use the GameCube controller with the Wii U, as Nintendo released a special USB adapter (pictured to the right) specifically allowing players to use GameCube controllers to play the game.\nTo this day the GameCube controller remains the favorite controller to play any Super Smash Bros. game, which has a lot of gamers curious about compatibility with the Nintendo Switch.\nWill the GameCube controller work with the Switch? To be brief, there's no official word on the GameCube controller functioning with the Switch; that doesn't mean there isn't hope.\nPotential hope The Switch Dock does include a USB port, which could suggest that the same USB GameCube controller adapter that functioned with the Wii U could also function on the Switch.\nThe adapter was only ever made to function with Super Smash Bros. Wii U and had very limited use outside of the game. Since no official plans for a Super Smash Bros. game for the Switch have been made public, we may not even know for sure if the adapter functions until if/when a Super Smash Bros. game is released.\nI know for GameCube controller fans out there, this news can seem a little bleak, but a kernel of hope is better than nothing, right?\nDo you love the GameCube Controller? Hoping your GameCube controllers will work on the new Nintendo Switch? Let me know in the comments below!\nHow to set up your HomeKit accessories \nPosted: 28 Feb 2017 04:00 AM PST\n\nJust picked up a HomeKit-compatible gadget? Awesome. Here's how to set it up.\nUpdated February 2017 to include information about Apple's Home app and the addition of programmable light switches in iOS 10.3 and later.\nApple has made it incredibly easy to set up your new home automation accessories with its HomeKit system — assuming, that is, you've picked up an accessory which works with HomeKit. (If you're not sure, look for the \"Works with Apple HomeKit\" badge on the accessory's packaging; additionally, we have a breakdown of all the currently compatible devices .)\n\nApple also has a fantastic Home app that brings together all supported smart accessories under one app, so you can access everything without having to jump between branded apps. If you don't want to use Apple's Home app with your various smart devices, but still want to be able to perform actions with Siri, you can do so without needing the Home app.\nIf you are looking for a great third-party app that lets you combine your smart accessories, the best free app is Elgato's Eve ; if you're looking for something more full-featured, I highly recommend the Home app from Matthias Hochgatterer.\n\nHow to set up multiple HomeKit homes for your smart accessories If this is your first HomeKit accessory, you're going to need to set up a \"home\" container: This groups all the HomeKit accessories for your current home. You can set up multiple HomeKit houses (if you, say, have both a local home and a vacation home with smart accessories), though only one can work as the \"primary\" house for Siri at a time.\nOnce you've downloaded your app of choice, here's how you set up a new house.\nLaunch your preferred HomeKit supported app . Press OK if the app asks you to access your Home data. Tap the plus button to add a home; In the Eve app, tap Add Accessory Name your home. After you've done so, it's time to set up your first accessory.\nHow to set up your HomeKit-compatible accessories HomeKit compatible accessories include a wide variety of devices, incuding light bulbs, ceiling fans, speakers, plugs, locks, programable light switches, and more. Whether you use Apple's Home app, the companion app for your accessory, or a third-party hub app, you'll need to set up your accessories first.\nHook up your device to power . (That may mean plugging it in to a wall outlet, connecting an extension cord, or adding batteries.)\n\n\nConnect it to Wi-Fi or Ethernet , depending on the accessory.\n\n\nIf you haven't already, download and open the app for your accessory. Follow the instructions in the app for setting up your accessory. At some point during the setup process, you might be asked for the HomeKit setup code : It has the HomeKit house next to an eight-digit number separated into three groups. Enter it into the app. \n\n\n\nOnce you've done so, congratulations! You've added your accessory to your HomeKit home. From here, you can customize the accessory's name, add it to rooms, zones, scenes, and triggers, and control it with Siri.\nHow to add rooms, zones, and scenes to your HomeKit house How to share HomeKit access with other people, guests, or housemates How to use Siri with your HomeKit accessories How to use your HomeKit accessories outside of your home Want your lights to come on before you get home? Turn down your thermostat after you've left for vacation? You can use the Home app, the companion app that came with your accessory, a third-party HomeKit app. If you have Apple TV, you can also use Siri commands when you're out and about.\nSupported in iOS 9 and later, your iPhone can securely chat with your HomeKit bridges and accessories even while out of the house. It can do so because of the HomeKit Accessory Protocol (HAP), which uses secure networking over iCloud to talk to your connected HomeKit accessories. HAP doesn't work with prior versions of Apple's mobile operating system; as such, if you're running iOS 8 on your iPhone, you'll still need to use and set up an Apple TV for controlling your house outside your local Wi-Fi network.\nIf you're still running iOS 8 or your accessory isn't compatible with HAP, you can use a third-generation Apple TV. Here's how:\nHow to extend your HomeKit network with an Apple TV Run into problems? My first suggestion is to try out our HomeKit troubleshooting tips ; if you're still having problems getting set up, we'll try and help you out either here in the comments, or we suggest chatting with your accessory manufacturer/Apple, depending on the problem.\nHomeKit \nHomeKit FAQ HomeKit accessories HomeKit help HomeKit explainer HomeKit news HomeKit discussion Save $20 on this iPhone 7 wooden back cover today \nPosted: 28 Feb 2017 03:30 AM PST\n\nCases are great because they allow you to add some of your own style to make your phone stand out, and if you want to make your iPhone 7 more of your own you'll want to check out Mozo's wooden back covers . The cases are made of high-quality wood and come in a few different colors, and right now you can pick one up for $24.87.\nWe're giving away the new full-grain leather slim wallets from Pad & Quill! \nPosted: 28 Feb 2017 12:00 AM PST\n\nEnter to win your choice of wallet from Pad and Quill after you check out the new designs!\nEach of Pad and Quill's new handmade wallets are crafted from the finest full grain leathers by artisans with generations of experience. Thin, lay-flat designs hold a ton of credit cards while keeping the wallet slim and trim, perfectly designed for a front pocket wallet. Made to age and patina with use, these leather credit card wallets, money clip wallets, and slim wallets will become as unique and wonderful as you and tell your story. Check each wallet out at the links below, then come back here and enter to win one for yourself!\nThe Slim Credit Card Wallet is their slimmest full-grain leather wallet. It carries 2-5 cards and folded bills, and has an ID window in the back for your convenience. Pre-order for $49.95. The Front Pocket Wallet features rounded corners to comfortably fit in a front pocket, room for 3-6 cards, a cash strap on the back for folded bills, and a pull-tab easy card access system. Pre-order for $59.95. The Slim Fold Wallet sports an internal leather cash strap with stylish rivet closure, an ID card window, and room for 5-8 cards along with folded bills. This is not your father's bi-fold wall! Pre-order for 69.95 Each leather wallet comes with 10-year leather warranty!\nTHE RULES: Use the widget below to enter. There are several different options including some that you can come back and do daily! If you complete them all, you'll have the maximum chance at winning! Please note, we DO verify the winning entries, so if you say you completed something, but you didn't actually do it, you'll be disqualified and a new winner will be chosen. The contest ends March 2nd. We'll announce the winners here on iMore shortly after the closing date.\nThat's it! Good luck, everyone!\nWe're giving away the new full-grain leather slim wallets from Pad& Quill! Enter now! \nYou are subscribed to email updates from iMore - The #1 iPhone, iPad, and iPod touch blog .\nTo stop receiving these emails, you may unsubscribe now . Email delivery powered by Google Google Inc., 1600 Amphitheatre Parkway, Mountain View, CA 94043, United States ", "external_links": [], "published": "2017-03-01T08:59:00.000+02:00", "crawled": "2017-03-01T04:01:57.945+02:00", "highlightTitle": ""}