{"organizations": [], "uuid": "568a4957cd29468d18aa3f0c7c3c21e9a597f1c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.katheats.com", "main_image": "", "site_section": "http://www.katheats.com", "section_title": "Kath Eats Real Food", "url": "http://www.katheats.com/what-can-you-count-on", "country": "US", "domain_rank": 99521, "title": "What Can You Count On?", "performance_score": 0, "site": "katheats.com", "participants_count": 1, "title_full": "What Can You Count On?", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T19:00:00.000+02:00", "replies_count": 0, "uuid": "568a4957cd29468d18aa3f0c7c3c21e9a597f1c2"}, "author": "KathEats", "url": "http://www.katheats.com/what-can-you-count-on", "ord_in_thread": 0, "title": "What Can You Count On?", "locations": [], "entities": {"persons": [{"name": "mazen", "sentiment": "positive"}, {"name": "grammie", "sentiment": "positive"}, {"name": "siggi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "verizon", "sentiment": "none"}, {"name": "gsm", "sentiment": "none"}, {"name": "kath eats real food", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "cdma", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nYou can count on me friends! And you can count on Counter the turtle, Mazen’s new toy that Grammie sent in the mail. He is currently really into numbers and he asks to do “math” at bedtime now, so I give him addition and subtraction challenges (under 10). This turtle counts in Spanish too, and when Mazen heard him say “cinco” he thought he was saying “tinkle” and laughed hysterically!\nWhat can you not count on? Your unlocked iPhone working on any cell phone carrier the way Apple says it will.\nHere’s a little PSA about some things you shouldn’t count on: I use the Apple iPhone Upgrade Program, which means I get my phone directly from Apple. Apple promises that you can use any carrier you like and you can “switch carriers at any time!” But then I switched from AT&T to Verizon and the new SIM card just wouldn’t give me any service on Verizon. After an entire day of troubleshooting at the Verizon store and with Apple support, the support team told me that my phone was, in fact, not compatible with Verizon. This was a surprise to almost everyone I spoke with. To put it simply, there are different types of networks ( GSM v CDMA ) and different models of the iPhone 7 are compatible with only some carriers. I had already cut ties with AT&T, so this was an absolute nightmare to deal with. I had no phone for days, and couldn’t make any calls (especially frustrating when a tech person told me to “give them a call.”) The happy ending is that Apple made it right. Major props to their customer service team, who were easy to reach, pleasant to talk to, and solved my issues by refunding my phone purchase 4 months after I got it.\nHope that might help some of you avoid a similar situation. Don’t just count on your phone being unlocked – check your phone’s model number and network compatibility before switching carriers!\nBreakfast: Fried egg, pineapple, bagel toasted with butter, too much coffee.\n\nYou can count on me using my Crab koozie every day! Lunch was an arugula salad with carrots, cheese and walnuts plus a Siggi’s. And probably some chips!\n\nAnd you can count on a glass of wine after a stressful day : )\nDinner: Mexican bowl of rice, beans, cheese, peppers, guac, yogurt, chips.\n\nWhat else can you count on? Tons of super cute art projects coming home from preschool! We keep them in a basket in the office and Mazen often goes in there to find ones that fit with the theme of the game he’s playing (like a lion mask or magic wand). No idea what I’ll do when this basket fills up!\n\nThe post What Can You Count On? appeared first on Kath Eats Real Food .", "external_links": [], "published": "2017-03-01T19:00:00.000+02:00", "crawled": "2017-03-01T14:00:54.158+02:00", "highlightTitle": ""}