{"organizations": [], "uuid": "c8208e2abf6c4ac16529fb5efad885c2017836b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercedsunstar.com", "main_image": "http://www.mcclatchy-wires.com/incoming/eji1a6/picture135562673/ALTERNATES/LANDSCAPE_1140/Cookie_Dough_Parlor_11750.jpg", "site_section": "http://www.mercedsunstar.com/?widgetName=rssfeed&widgetContentId=711265&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MercedSunStar.com &", "url": "http://www.mercedsunstar.com/news/nation-world/article135588488.html", "country": "US", "title": "10 Things to Know for Wednesday", "performance_score": 0, "site": "mercedsunstar.com", "participants_count": 1, "title_full": "10 Things to Know for Wednesday", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T08:10:00.000+02:00", "replies_count": 0, "uuid": "c8208e2abf6c4ac16529fb5efad885c2017836b8"}, "author": "The Associated Press", "url": "http://www.mercedsunstar.com/news/nation-world/article135588488.html", "ord_in_thread": 0, "title": "10 Things to Know for Wednesday", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "barack", "sentiment": "none"}, {"name": "donald jr.", "sentiment": "none"}, {"name": "mark lennihan", "sentiment": "none"}, {"name": "michelle obama", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "ap darryl dyck tulip magnolia", "sentiment": "none"}, {"name": "penguin random house", "sentiment": "none"}, {"name": "cliff owen ap", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "trump international hotel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "February 28, 2017 5:10 PM 10 Things to Know for Wednesday Scoops of cookie dough, purchased at DO, Cookie Dough Confections, are displayed Tuesday, Feb. 28, 2017, in New York. People are standing in line for hours to get a scoop of raw dough, the latest foodie phenomenon. The shop joins a growing list of city food destinations where people seem to be willing to wait endlessly for must-have items, like the cronut or the ramen burger. Mark Lennihan AP Photo A man dressed as U.S. President Donald Trump stands among protesters outside the official opening of the Trump International Hotel and Tower in Vancouver, Canada, on Tuesday, Feb. 28, 2017. U.S. President Donald Trump's sons Donald Jr. and Eric attended the opening. The Canadian Press via AP Darryl Dyck Tulip Magnolia trees bloom in Washington, Tuesday, Feb. 28, 2017. Crocuses, cherry trees, magnolia trees are blooming several weeks early because of an unusually warm February. Some climate experts say it looks like, because of an assist from global warming, spring has sprung what may be record early this year in about half the nation. Cliff Owen AP Photo 1 of 3 \nYour daily look at late-breaking news, upcoming events and the stories that will be talked about Wednesday: \n1. TRUMP TO CALL FOR ACTION ON HEALTH CARE, MAYBE IMMIGRATION \nHis first address to Congress comes at a pivotal moment for a new president elected on pledges to swiftly shake up Washington. \n2. TRUMP SAYS HE'S OPEN TO 'COMPROMISE' IMMIGRATION BILL \nThe president signals openness to legislation that would give legal status to some people living in the U.S. illegally and provide a pathway to citizenship to those brought to the U.S. illegally as children. \n3. AIRPORTS, LEGAL VOLUNTEERS PREPARE FOR NEW TRUMP TRAVEL BAN \nActivists are mindful of the chaos that accompanied the initial order but hope the forthcoming version will be rolled out in a more orderly way. \n4. DEMOCRATIC EFFORT LED BY EX-AG HOLDER TARGETS SWING STATES \nThe initiative is seeking to rebuild Democrats' congressional strength by first making gains at the state level. \n5. AMAZON CLOUD STORAGE FAILURE CAUSES WIDESPREAD DISRUPTION \nThe breakdown underscores the risks of depending on a few large companies for cloud computing. \n6. TRUMP SONS OPEN NEWEST HOTEL IN VANCOUVER \nThey are greeted by protests in this Canadian city known for diversity and progressive politics. \n7. APPLE'S IPHONE MAY BE MATURE, BUT IT'S STILL BEARING FRUIT \nSteve Jobs' iPhone has such a devout following that it's likely to generate billions in profits for years to come. \n8. WHO CLINCHES BOOK DEALS \nBarack and Michelle Obama sign with Penguin Random House. Financial terms are not disclosed, but the unique dual arrangement is likely in the tens of millions of dollars. \n9. WHAT LATEST NYC FOOD FAD IS \nPeople are waiting in long lines outside a month-old New York City shop that sells scoops of raw cookie dough in a cup or a cone like ice cream. \n10. WHERE SPRING POPS UP SUPER EARLY \nThe unseasonably warm weather graces much of the United States, bringing crocuses and tulips but also unease about a climate gone askew. Related content", "external_links": [], "published": "2017-03-01T08:10:00.000+02:00", "crawled": "2017-03-01T03:24:44.014+02:00", "highlightTitle": ""}