{"organizations": [], "uuid": "2d6afe42603d56e05e8e0051651a010a8ab74a84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.podfeet.com", "main_image": "http://www.podfeet.com/blog/wp-content/uploads/2015/11/square_skyline_200x200_logo.png", "site_section": "http://www.podfeet.com/blog/feed", "section_title": "NosillaCast", "url": "http://www.podfeet.com/blog/2017/02/nc-616/", "country": "US", "title": "NC #616 udoq, CodeRunner, Olly, CrashPlan, Wynd", "performance_score": 0, "site": "podfeet.com", "participants_count": 1, "title_full": "NC #616 udoq, CodeRunner, Olly, CrashPlan, Wynd", "spam_score": 0.0, "site_type": "blogs", "published": "2017-02-27T09:18:00.000+02:00", "replies_count": 0, "uuid": "2d6afe42603d56e05e8e0051651a010a8ab74a84"}, "author": "podfeet", "url": "http://www.podfeet.com/blog/2017/02/nc-616/", "ord_in_thread": 0, "title": "NC #616 udoq, CodeRunner, Olly, CrashPlan, Wynd", "locations": [], "entities": {"persons": [{"name": "allison sheridan", "sentiment": "none"}, {"name": "olly", "sentiment": "none"}, {"name": "tim jarh", "sentiment": "none"}, {"name": "megan", "sentiment": "none"}, {"name": "rick cartwright", "sentiment": "none"}, {"name": "valeri", "sentiment": "none"}, {"name": "jason", "sentiment": "none"}, {"name": "valeri quinlivan", "sentiment": "none"}, {"name": "jason howell", "sentiment": "none"}, {"name": "megan morrone", "sentiment": "none"}, {"name": "coderunner patreon", "sentiment": "none"}], "locations": [{"name": "pond", "sentiment": "none"}], "organizations": [{"name": "nosillacast mac podcast", "sentiment": "none"}, {"name": "skype", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "tech news today", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hi this is Allison Sheridan of the NosillaCast Mac Podcast, hosted at Podfeet.com, a technology geek podcast with an EVER so slight Macintosh bias. Today is Sunday February 26, 2017 and this is show number . Chit Chat Across the Pond \nThis week’s Chit Chat Across the Pond was so much fun. I was joined by Megan Morrone and Jason Howell, who co-host Tech News Today on the TWiT network together. Megan also co-hosts iOS Today while Jason co-hosts All About Android. For an entire month, Megan and Jason swapped phones. They’re here to tell us what they liked, what they didn’t like and answer tough questions like, “Did your children mock you?” I know I say this a lot, but this truly was one of the most enjoyable episodes of Chit Chat Across the Pond. They’re both so entertaining and delightful and we even had some great technical conversations too. \nHere’s an inside secret. I very very rarely listen to one of my own shows. Why would I? I was there the first time. But I smiled so much during this conversation that I listened to the entire show again the next day. it’s that fun. \nI have an interesting tech story to tell about the recording. I monitor my own voice using Audio Hijack, which is something I never used to do. It’s important because if your own audio is screwed up, it’s a lot easier to fix it before you record than afterwards. Often you can’t fix it at all. \nWhen Megan got on the call before Jason arrived, I heard a fair amount of noise on the line. Megan and I did some experiments with me muting and then her and we didn’t find the root cause. Megan isn’t an audio engineer so she didn’t have a lot of options on her end to fiddle with anything. I decided to proceed with the recording. Note to self, no matter how much it inconveniences your guest, it’s worth it to fix it before recording. \nAs we recorded, I realized the noise was only there when I was talking. I think I do a pretty good job of letting other people talk when I interview them (a lot better than I am in real life I assure you), but on this call I had to cut that back even further because the noise was so annoying. \nWhen I went to edit the show, my voice was HORRIBLE. I mean just awful. It was almost unlistenable. With dread I split the track and pulled my voice out so I could start doing some processing to my voice. Removing noise that’s on top of real audio is a nightmare and always sounds bad. At best you strive to make it listenable, at worst you reach for less awful. With dread I started listening to my voice all by itself. \nBut when I played it, it was perfectly CLEAN. So get this, the noise was coming from Skype but ONLY when I spoke. This was terrific news. With most digital audio workstations (aka recording software) like Amadeus Pro that I use, if you can get a clean sample of just the noise, the program can remove it. All I needed to do was find a section where either Jason or Megan was talking and then on my track sample that same section and tell Amadeus Pro to sample the noise. Then I selected their entire track and selected remove noise. Boom, their track sounded perfect with zero noise. \nThe lessons here are to always monitor your own voice, fix things before recording, record yourself on a separate track from the other person wherever possible, and hope for the best. Blog Posts CES 2017: udoq Mobile Docking Station \nI thought the udoq was a terrific design, and was a great example of the best ideas are ones that scratch your own itch. I think the price needs to come down a lot though. $100-150 for a piece of extruded aluminum and four cables is awfully steep. I’m glad they’re Apple certified though. Keep in mind you wouldn’t be able to add devices to the udoq with your own cables unless you oredered directly from udon. Hunt for the Perfect Code Editor Ends with CodeRunner Patreon and Amazon \nYou may have noticed that there’s no ads in the NosillaCast or in Chit Chat Across the Pond. This show is funded only by our Amazon Affiliate Links and by people like you who go to podfeet.com/patreon and pledge a dollar amount for every NosillaCast we publish. Tim Jarh and Rick Cartwright just signed up this week to pledge their support. I was just perusing the growing list of patrons and realized I never thanked Valeri Quinlivan for her support, and she was one of the very first to join up on Patreon! I’m so sorry I missed you Valeri! I can’t thank all of you enough and I hope to continue to live up to the value you hope to get from the show. \nLet’s hear now from one of the most enthusiastic people we interviewed at CES.", "external_links": [], "published": "2017-02-27T09:18:00.000+02:00", "crawled": "2017-03-01T03:58:15.103+02:00", "highlightTitle": ""}