{"organizations": [], "uuid": "6fd7ae2bf7d638ff91762251476eb978ac3ce121", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chyka.com", "main_image": "http://static1.squarespace.com/static/56c3e5ff4c2f85372f098691/56c69c1df055e93c5cc4c1d9/58a27e57cd0f68d988b2e27b/1488315633649/Picnic+008-1.jpg?format=1000w", "site_section": "http://www.chyka.com/winter-home-page?format=RSS", "section_title": "Chyka.com", "url": "https://www.chyka.com/articles/the-ingredients-for-a-perfect-picnic", "country": "US", "title": "The Ingredients For A Perfect Picnic", "performance_score": 0, "site": "chyka.com", "participants_count": 1, "title_full": "The Ingredients For A Perfect Picnic", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T04:00:00.000+02:00", "replies_count": 0, "uuid": "6fd7ae2bf7d638ff91762251476eb978ac3ce121"}, "author": "Chyka Keebaugh [Chyka.com]", "url": "https://www.chyka.com/articles/the-ingredients-for-a-perfect-picnic", "ord_in_thread": 0, "title": "The Ingredients For A Perfect Picnic", "locations": [], "entities": {"persons": [{"name": "lisa atkinson picnics", "sentiment": "none"}, {"name": "chyka keebaugh", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WORDS:: Chyka Keebaugh PHOTOS:: Lisa Atkinson Picnics don’t always have to be packed to the brim with an assortment of treats. Sometimes the simplest of ideas are the best, as they leave you to enjoy your beautiful surrounds without the fuss. \nAfter a long lunch on a sunny day, there is nothing nicer than wandering down to your local park for a lay in the sun. Bring with you a couple of sweet snacks, a comfortable rug and some magazines, and you’ll be surprised at how many hours you can while away. Apples are plentiful and cheap at this time of year (and really, nearly all year around) so bring an assortment to your picnic for the perfect afternoon snack. Guilt free and sweet, there are many easy ways to enjoy these crunchy morsels. Simple apple ideas for your picnic:: Use apple slices instead of crackers for eating with cheese Cut up apples and skewer them, ready to dip into some caramel sauce Apple slices with peanut butter spread are delicious; you have to try them. Try sprinkling these with some shredded coconut or slithered almonds to add some extra crunch. Dried Apples: Core 1 small apple; slice into 1/8-inch-thick rounds. Arrange on an oiled baking sheet and bake at 100°C until dry but still soft. Baked apples are so easy and fun, a great idea for dessert if you are entertaining. Core your apple, fill it with a combination of dried fruits and nuts (sultanas, cranberries, almonds, etc.) drizzle some honey over it and wrap in foil. Bake for 20-25 minutes. Serve with vanilla ice-cream or cream, or tart sour cream to take the edge off the sweetness. Make some apple fruit leather. Simply puree your fruit with some sugar and cinnamon to taste. Spread onto some baking paper and bake for 2-3 hours until it is sticky but doesn’t stick to your fingers (you’ll need to check this now and then). Cut into strips, roll up and store in an airtight container. Boil down some chopped apples in some sugar on the stove. Once cooled, fill a few jars halfway and top with a blend of rolled oats, crushed biscuits and coconut – apple crumble on the go! A simple Apple cake always goes down a treat. All you need to do is whisk 1 1/4 cups flour, 3/4 cup sugar, 1 teaspoon baking powder and 1/2 teaspoon each salt, baking soda, cinnamon and nutmeg. Shred 1 apple and squeeze dry, then whisk with 2 eggs, 1/2 cup each vegetable oil and milk, and 1 teaspoon vanilla. Fold into the flour mixture. Bake in a buttered 9-inch-round pan at 180°C then let cool for 20 minutes. Beat 220 grams cream cheese, 1/2 stick butter, 1 cup icing sugar, 1 teaspoon each lemon juice and vanilla, and a pinch of salt; spread all over the cake and enjoy. \n\nLastly, what goes down a treat at picnics? Some apple cider of course! A warm mulled cider is quite simple to make and sounds very fancy so if you are picnicking with friends you will definitely look like the one who went to a lot of effort! All you need to do is bring 6 cups apple cider to a simmer with 1 cinnamon stick, 1 tsp of all spice, 1-star anise pod and 3 strips lemon zest. To serve, add diced apples. Chyka Keebaugh [Chyka.com]", "external_links": [], "published": "2017-03-01T04:00:00.000+02:00", "crawled": "2017-03-01T06:40:52.444+02:00", "highlightTitle": ""}