{"organizations": [], "uuid": "9904c10f4b12c18bb9e0191f904bb8313de13936", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.automoblog.net", "main_image": "", "site_section": "http://www.automoblog.net", "section_title": "Automoblog.net", "url": "http://www.automoblog.net/2017/02/28/ford-proposing-cars-that-are-virtual-personal-assistants/", "country": "US", "title": "Ford Proposing Cars That Are Virtual Personal Assistants", "performance_score": 0, "site": "automoblog.net", "participants_count": 1, "title_full": "Ford Proposing Cars That Are Virtual Personal Assistants", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T09:03:00.000+02:00", "replies_count": 0, "uuid": "9904c10f4b12c18bb9e0191f904bb8313de13936"}, "author": "Tony Borroz", "url": "http://www.automoblog.net/2017/02/28/ford-proposing-cars-that-are-virtual-personal-assistants/", "ord_in_thread": 0, "title": "Ford Proposing Cars That Are Virtual Personal Assistants", "locations": [], "entities": {"persons": [{"name": "tony borroz", "sentiment": "none"}, {"name": "alexa", "sentiment": "none"}, {"name": "sam varnhagen", "sentiment": "none"}, {"name": "mareike sauer", "sentiment": "none"}, {"name": "fatima vital", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "none"}, {"name": "facial recognition", "sentiment": "none"}, {"name": "voice control engineer", "sentiment": "none"}, {"name": "connectivity application team", "sentiment": "none"}, {"name": "marketing automotive for nuance communications", "sentiment": "none"}, {"name": "apple carplay", "sentiment": "none"}, {"name": "voice", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "ford motor company", "sentiment": "none"}, {"name": "lotus", "sentiment": "none"}, {"name": "ariel atoms", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "silence & sneezes ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\n\nAccording to Ford, by 2022 nearly all new cars are expected to offer voice recognition, and future systems may evolve to interpret tone of voice and facial expressions. This will come as a surprise to people who drive Ariel Atoms and Lotus 7s, and as no surprise to anyone who thinks it’s over-reach at best, and a bad idea in general.\nLook, Ford’s in-car connectivity system SYNC 3 works really well. It already has voice control and integrates with Apple CarPlay and Android Auto. Soon we will be able to use Amazon’s virtual assistant Alexa as part of SYNC.\nThat’s all fine and good, I guess. What is not good is this:\nKeep It Simple Stupid According to Ford subcontractor Nuance, within the next two years, voice control systems could prompt us with: “Would you like to order flowers for your mom for Mothers’ Day?” “Shall I choose a less congested but slower route home?” And “you’re running low on your favorite chocolate and your favorite store has some in stock. Want to stop by and pick some up?”\nNo. No I would not. You know what I would like to do: Drive. Look. I’m not a Luddite. I like technology. But I am also opposed to any technology being added to a car that makes driving it harder or more complicated.\nAdding stuff like this to a car is solving problems that do not exist, and overlooking problems that are already there. It rather reminds me of the time when someone pointed out to Triumph that people weren’t buying their cars because they were scared of them being unreliable. Triumph’s answer: Make them easier to work on. Triumph thought the problem was solved. The market thought otherwise.\nThe answer to traffic is not to figure out that you’re upset by it and sing you a happy tune, it’s to make less traffic. And believe it or not, singing you a happy song is just what Nuance would like to do.\n“We’re well on the road to developing the empathetic car which might tell you a joke to cheer you up, offer advice when you need it, remind you of birthdays, and keep you alert on a long drive,” said Fatima Vital, Senior Director of Marketing Automotive for Nuance Communications.\nFord brings the industry’s first in-car Alexa integration with SYNC 3 AppLink. Alexa provides the ability to command and operate internet-enabled functions such as lighting, security systems, garage doors, and other Alexa smart home devices. Available home-to-car features allow electric vehicle owners to start and stop their engine, lock and unlock doors, and monitor vehicle readings, including fuel level and battery range. Photo: Sam VarnHagen.\nFacial Recognition, Mood Interpretation Why they thought this was an answer, and to what problem is beyond me. What we do know is that Nuance helped Ford develop voice recognition for the SYNC in-car connectivity system, so Ford seems to listen to these people, which does not fill one with confidence. Ford predicts that future in-car systems like SYNC will evolve into personal assistants that can shuffle appointments and order take-out food when drivers are stuck in traffic jams.\nNo. Seriously.\nFord and Nuance think the cars of tomorrow will be able to pick up on tiny changes in our facial expression, as well as modulations and inflections in our speaking voice, easing the driving experience.\nYeah, just what I want. Some idiot blows through a red light, I nearly hit him, the car picks up on “tiny changes in my facial expression and modulations and inflections in my speaking voice,” i.e. I turn red in the face and start screaming at another driver’s inattentive behavior that nearly cost me my life, so the car decides to play “ The Piña Colada Song ” to calm me down. Yeah, bad idea.\nIn the future, our vehicles may be able to read our facial expressions and respond. Photo: Ford Motor Company.\nSilence & Sneezes Ford and Nuance say that advanced in-car systems equipped with sophisticated microphones and cameras could “learn which songs we like to hear when we are stressed and those occasions we prefer to simply enjoy silence.” The car could even change the interior lighting to complement our mood.\nI don’t even know where to start with that mind bogglingly misdirected urge.\n“Voice commands like ‘I’m hungry’ to find a restaurant and ‘I need coffee’ have already brought SYNC 3 into personal assistant territory,” said Mareike Sauer, Voice Control Engineer, Connectivity Application Team, Ford of Europe.\nHey Mareike, what will my car-of-the-future do when I lose it over the knuckle-dragging reprobate in front of me, fiddling with their voice recognition in-car assistant and driving 25 miles an hour under the speed limit? What if I demand that my car play Black Flag at maximum volume and order that it deploy The Hadron Enforcer on said knuckle-dragger?\nIt gets even goofier. Ford says future gesture and eye control would enable drivers to answer calls by nodding their head, or with short twisting motions, adjust the volume, or set the navigation with a quick glance at their destination on a map. They said nothing about what would happen if someone has a sneezing fit in the middle of allergy season or a total freak out over noticing a bee flying around in their car.\nWant to give me a better car? Give me a car that looks like a Ferrari, goes like a cheetah, and costs like a Miata. Leave the digital minions in the hands of Apple or Google or Bill Gates.\nTony Borroz has spent his entire life racing antique and sports cars. He means well, even if he has a bias towards lighter, agile cars rather than big engine muscle cars or family sedans. \n", "external_links": [], "published": "2017-03-01T09:03:00.000+02:00", "crawled": "2017-03-01T04:06:19.218+02:00", "highlightTitle": ""}