{"organizations": [], "uuid": "c958f3eba7c495f6c2fd6c715521c0e76b63fa2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newcydiatweaks.com", "main_image": "", "site_section": "http://www.newcydiatweaks.com/", "section_title": "NewCydiaTweaks", "url": "http://www.newcydiatweaks.com/2017/02/analysts-keep-insisting-apples.html", "country": "US", "title": "Analysts keep insisting, Apple's augmented reality will arrive this year", "performance_score": 0, "site": "newcydiatweaks.com", "participants_count": 1, "title_full": "Analysts keep insisting, Apple's augmented reality will arrive this year", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T08:25:00.000+02:00", "replies_count": 0, "uuid": "c958f3eba7c495f6c2fd6c715521c0e76b63fa2b"}, "author": "Anshul Verma (noreply@blogger.com)", "url": "http://www.newcydiatweaks.com/2017/02/analysts-keep-insisting-apples.html", "ord_in_thread": 0, "title": "Analysts keep insisting, Apple's augmented reality will arrive this year", "locations": [], "entities": {"persons": [{"name": "pokémon", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThe technology of virtual reality, augmented and mixed, continues to advance by leaps and bounds.  More and more companies are deciding to enter this market that will undoubtedly have a great impact on the life of humanity as a whole.  From entertainment to education to communication, these \"reality change systems\" will help us  establish an even stronger link with the rest of the world  . These technologies will help in the not too distant future to give shape to all our ideas in a completely new way.  Our creativity will no longer be limited by a space of two dimensions, and we can begin to create things that we would not have been able to raise up to that point.  It is in that future that Apple wants to be present  , to be part of the next step towards the perfect fusion of man and machine. Apple and augmented reality, a very interesting relationship Last year, developers  began to discover the potential of augmented reality with jobs like Pokémon GO  .  However, Apple has only shown its interest in this field, without giving more details in their statements, much less in the acquisition operations they have been making of companies related to this type of technology. As I said before,  the company is  determined  to work in the RA  , but in order to do it correctly, they must first lay the foundations, and those first moves could come no more and no less than this year.  UBS analysts strongly support rumors that  the upcoming iPhone 8  would have technology capable of delivering advanced augmented reality experiences. These experiences, would be carried out thanks to what they call \"Mapping and simultaneous 3D localization\", which would work  in  conjunction  with the new 3D sensor of the future phone  , which  we have already discussed  .  Thus, Apple managed to bring to the masses a technology that, although it has already achieved some recognition with games like Pokémon GO, still needs a push to get ahead. ", "external_links": [], "published": "2017-03-01T08:25:00.000+02:00", "crawled": "2017-03-01T03:27:16.882+02:00", "highlightTitle": ""}