{"organizations": [], "uuid": "47de2660ba109cf04de361d3499859e25a3ba7f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "time.com", "main_image": "", "site_section": "http://time.com", "section_title": "President Trump Called for a ‘Level Playing Field.’ That Could Mean This New Tax – TIME", "url": "http://time.com/4686070/trump-address-congress-tax-reform", "country": "US", "domain_rank": 643, "title": "President Trump Called for a ‘Level Playing Field.’ That Could Mean This New Tax", "performance_score": 0, "site": "time.com", "participants_count": 1, "title_full": "President Trump Called for a ‘Level Playing Field.’ That Could Mean This New Tax", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T11:59:00.000+02:00", "replies_count": 0, "uuid": "47de2660ba109cf04de361d3499859e25a3ba7f6"}, "author": "Haley Sweetland Edwards", "url": "http://time.com/4686070/trump-address-congress-tax-reform", "ord_in_thread": 0, "title": "President Trump Called for a ‘Level Playing Field.’ That Could Mean This New Tax", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "david french", "sentiment": "none"}, {"name": "gary cohn", "sentiment": "none"}, {"name": "alan auerbach", "sentiment": "none"}, {"name": "larry lindsay", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "devin nunes", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "nada", "sentiment": "none"}, {"name": "kevin brady", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "u.s. retail federation", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}, {"name": "national retail federation", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "general electric", "sentiment": "none"}, {"name": "better way forward", "sentiment": "none"}, {"name": "walmart", "sentiment": "none"}, {"name": "harley-davidson", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "national economic council", "sentiment": "none"}, {"name": "center for american progress", "sentiment": "none"}, {"name": "cbo", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "congressional budget office", "sentiment": "none"}, {"name": "ways and means committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Trump called for creating a “level playing field” on U.S. exports in his first address to Congress Tuesday night, but he stopped short of explicitly endorsing a plan from Speaker Paul Ryan.\nCiting a recent meeting with executives from Harley-Davidson , Trump told lawmakers that the American motorcycle company sometimes finds its products face high taxes when they are exported.\n“Currently, when we ship products out of America, many other countries make us pay very high tariffs and taxes — but when foreign companies ship their products into America, we charge them almost nothing,” he said.\nTrump said his “economic team” is developing a “historic tax reform” that would address that issue, but he did not say whether it would include Ryan’s plan, which is based on the “Better Way Forward” blueprint .\nThat plan hinges on an innovative new tax called the destination-based cash-flow tax with border adjustment—or just BAT, for short. It would lower the corporate tax rate from 35% to 20%, eliminate levies on all U.S. exports, and impose a 20% tax on imports.\nBy shifting costs from U.S.-based exporters and strengthening the value of the U.S. dollar on the international market, the tax could earn as much as $1 trillion more in federal revenues over a decade, according to a Congressional Budget Office analysis. Both Ryan and Ways and Means Committee Chairman Kevin Brady have said the BAT is the only way that Republicans can pass comprehensive tax reform.\n“It changes absolutely everything,” Rep. Devin Nunes, a Republican from central California who has long championed the reform effort, told TIME recently. “It’s a really, really big deal.”\nBut the BAT also has really, really big enemies. The powerful retail industry’s lobby, backed by deep-pocketed conservative groups including Club for Growth and Americans for Prosperity, vehemently oppose the plan. Trump, for his part, has repeatedly equivocated. In January, Trump appeared to dismiss the plan, saying it was complicated and that he didn’t “love it.” But last week, he seemed to muddle into an endorsement, telling Reuters that he supported “a form of tax on the border.” A day later, Trump’s chief economic adviser, Gary Cohn, panned the BAT entirely .\nThe truth is that understanding the BAT—and predicting its impact on the global economy—is complicated stuff. If normal tax rate adjustments are Econ 101, the BAT is a graduate-level seminar.\nThe best thing about the BAT is that it essentially eliminates the current corporate tax code and replaces it with an new system. That’s good news for almost everyone—Republicans, Democrats, liberals, and conservatives alike—who believe the system we have now is broken. At 35%, the corporate tax rate is one of the highest in the developed world and yet, because of a tangle of loopholes and sweetheart exceptions, it produces less federal revenue, as a percent of GDP, than tax rates almost half its size.\nAnd then it gets worse: Because the current corporate tax is levied on profits, it creates incentives for companies to relocate their corporate headquarters, hide their intellectual property overseas, or otherwise perform feats of legal acrobatics. The current system is one of the main reasons marquee American companies, including Apple , Google , and General Electric , are sitting on trillions of dollars of cash abroad.\nThat’s where the BAT, in theory, comes in to save the day. Instead of taxing profits, the BAT taxes only U.S.-based cash flow. That means that it doesn’t matter where a company’s headquarters are located or what its quarterly earnings report looks like. All that matters is where its goods are sold. Under the BAT, every company pays a 20% tax on what it makes from goods sold stateside. Companies can deduct capital, like machines and factory overhead, and U.S.-based labor expenses. But that’s it. They can’t deduct the cost of imports.\nIf a company sells goods sold in America, it pays the 20% U.S. corporate tax rate. If it sells goods abroad, it doesn’t.\nIf a company makes a T-shirt in Oklahoma and sells it in California, it deducts its capital and labor expenses, and then pays 20% on what it made from that T-shirt. If a company imports a T-shirt from China and sells it in California, then it doesn’t get to deduct the cost of the imported T-shirt (just its capital and other U.S.-based labor expenses). But it too pays 20% on what it made from that T-shirt. If a company makes a T-shirt in Oklahoma and sells it in France, it pays no U.S. corporate tax at all. Nada. Zero. Zilch.\nWhich is why big net-exporters, like Boeing and GE, stand to gain from the new tax , while net-importers, including big box retailers like Walmart and Target , do not . While Boeing would suddenly pay 0% tax on the airplanes that it exports, Walmart would see a new tax bill on every product it imports.\nSince most American retailers would not be able to switch quickly to domestic sources, which don’t currently exist, the U.S. Retail Federation argues that its members would have no choice but to pass on new costs to consumers. That, in turn, would force retailers out of business and drive up the cost of everything from baby formula to avocados. Americans for Affordable Products, a coalition of retailers and other opponents of the BAT, estimates that if it passes, it will cost American households up to $1,700 a year in higher consumer prices. “I think we need to be realistic about what a huge risk this is for our economy,” David French, the head of the National Retail Federation, told TIME.\nBut that’s not the end of the story. Economists on both sides of the ideological aisle argue that if the BAT passes, it will likely catalyze an increase in the value of the U.S. dollar. If the dollar gets stronger, imports will get cheaper, which means any increase in consumer prices will disappear. Which means both exporters and importers end up more or less back where they started.\n“It comes down to supply and demand,” said Larry Lindsay, the former director of the National Economic Council under George W. Bush. If we impose what amounts to a 20% subsidy on exports, he explains, our exports would get cheaper on the global market, which would drive up demand for U.S. exports and increase the value of the dollar. Alan Auerbach, an economist at Berkeley who wrote a 2010 paper on the BAT for the left-leaning Center for American Progress, follows a similar path of logic, estimating that the tax could result in the value of a dollar shooting up by roughly 25%.\nIn other words, if economic theory plays out as it does in the textbook models, Boeing and GE see a short term boon, but that’s it. When the dollar got stronger, their products would get more expensive on the global market, and demand would go down. Target and Walmart, for their part, would weather a short term hit, but that’s it, too. When the dollar got stronger, the products they import would get cheaper ($1 would buy more Chinese widgets), and their products would end up costing the same as they always have.\nThat’s the theory, at least.\nThose in favor of the BAT argue that it’s worth taking the risk. The BAT, they argue, would leave us with a cleaner, simpler tax code with a lower rate and fewer loopholes. And since it would shift the tax burden, at least in part, to foreign producers, it would result in a lower tax rate and, as the CBO pointed out, $1 trillion in revenue over a decade.\nThose who oppose the BAT say that’s not a good enough reason to put the U.S. economy on the line. The global market is much more complicated than a textbook model, after all. How long would it take for the dollar to adjust? How many mom-and-pop retailers would wither and die in the meantime? How much of a price increase could U.S. consumers endure?\nMore dramatically, those who oppose the BAT say that it could very easily spark a devastating trade war. If our trade partners see it as a protectionist tariff—which, in fairness, is how President Trump has appeared to talk about it in the past—what’s to stop them from imposing retaliatory tariffs on U.S. imports? Or restricting their investors from investing in U.S. companies? Trade experts also raise the specter that the World Trade Organization could find the BAT to be a protectionist tax policy, which would mean that other countries could impose sanctions on the U.S.\nThis pitched controversy is probably one reason President Trump declined to explicitly endorse or condemn Ryan’s proposed tax reform plan Tuesday night. After all, all Americans can agree with championing a tax code that’s fair to everyone. The nitty-gritty details on how we get there makes for a less interesting show.", "external_links": [], "published": "2017-03-01T11:59:00.000+02:00", "crawled": "2017-03-01T06:59:58.089+02:00", "highlightTitle": ""}