{"organizations": [], "uuid": "9f645d05109c96423f1e3d0944ebb94a5563b900", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "aivanet.blogspot.com", "main_image": "", "site_section": "http://aivanet.blogspot.com/", "section_title": "AIVAnet", "url": "http://aivanet.blogspot.com/2017/02/blog-post_1986.html", "country": "US", "title": "Xiaomi begins a new chapter as a chipset maker with Surge S1-powered Mi 5c", "performance_score": 0, "site": "blogspot.com", "participants_count": 1, "title_full": "Xiaomi begins a new chapter as a chipset maker with Surge S1-powered Mi 5c", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T16:19:00.000+02:00", "replies_count": 0, "uuid": "9f645d05109c96423f1e3d0944ebb94a5563b900"}, "author": "Yiannis Aidinis (noreply@blogger.com)", "url": "http://aivanet.blogspot.com/2017/02/blog-post_1986.html", "ord_in_thread": 0, "title": "Xiaomi begins a new chapter as a chipset maker with Surge S1-powered Mi 5c", "locations": [], "entities": {"persons": [{"name": "xiaomi", "sentiment": "none"}, {"name": "helio", "sentiment": "none"}], "locations": [{"name": "mali", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "xiaomi", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "huawei", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "gpu", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "mediatek", "sentiment": "none"}, {"name": "beijing pinecone electronics", "sentiment": "none"}, {"name": "qualcomm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why it matters to you \n\nWith Xiaomi developing the technology that powers its devices, it could make its products better and drive competition for faster, less expensive chips.\n\nFollowing some rumors and speculation, Xiaomi has finally joined the ranks of Samsung, Apple, and Huawei. On Tuesday, the Chinese company unveiled its own system-on-chip at an event in Beijing. Called the Surge S1, it represents Xiaomi’s first foray into developing proprietary silicon to power its devices and is slated to debut in the upcoming Mi 5c smartphone.\n\nMany phone makers rely on third-party manufacturers like Qualcomm and MediaTek to supply them with chipsets. Xiaomi is steering clear of that route in an effort to more tightly integrate its hardware and software and “master the core technologies” behind its products, according to CEO Lei Jun. The announcement of the Surge S1 is the culmination of a reported 28-month long development process, from planning to production, in which the company partnered with subsidiary Beijing Pinecone Electronics.\n\nMore:  Xiaomi could release a lot more smartphones in 2017\n\nIn terms of power, benchmarks shared by Xiaomi on Twitter suggest the Surge S1 may be snappier than the Qualcomm Snapdragon 635, but fall short of MediaTek’s Helio P20. The 64-bit chipset combines two quad-core Cortex-A53 processors — one clocked at 2.2 GHz for high performance, and the other at 1.4 GHz for less demanding usage. A quad-core Mali T860 GPU will handle graphics, and is claimed to consume 40 percent less power than the outgoing T760.\n\n\nWe’re excited to launch #Mi5c with our #SurgeS1! pic.twitter.com/KEAUsufVQm\n\n— Mi (@xiaomi) February 28, 2017\n\n\nFor shooting photos, the 14-bit image signal processor, in tandem with the company’s own algorithm, aims to greatly improves light sensitivity while reducing noise. Meanwhile, the 32-bit voice digital signal processor will make the Mi 5c voice over LTE-capable.\n\nSpeaking of the Mi 5c, Xiaomi’s newest midrange offering sports an all-metal body with a 5.15-inch display featuring 2,048 levels of brightness, which the Surge S1 can smoothly adjust to ambient light conditions. The new chipset accompanies 3GB of RAM and 64GB of storage, along with a 12-megapixel camera at the back, and an 8-megapixel shooter up front. Xiaomi is touting all-day battery life thanks to a 2,860mAh battery that also supports 9V/2A fast charging. Perhaps best of all, the company says the use of a first-party system-on-chip will lead to more frequent Android updates.\n\nThe Mi 5c will launch in China on Friday but the industry will be watching to see how Xiaomi’s efforts shake out in the real world and speculating as to what a Surge-powered flagship might bring.\n\n\nXiaomi begins a new chapter as a chipset maker with Surge S1-powered Mi 5c ", "external_links": [], "published": "2017-03-01T16:19:00.000+02:00", "crawled": "2017-03-01T03:20:42.289+02:00", "highlightTitle": ""}