{"organizations": [], "uuid": "c035867b012abf7432570fe7422f72462a93675c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "aluvicro.com", "main_image": "", "site_section": "http://aluvicro.com/feed", "section_title": "Aluvicro", "url": "http://aluvicro.com/samsung-galaxy-s8-image-leak-reveals-design-of-iphone-8-rival/", "country": "US", "title": "Samsung Galaxy S8 Image Leak Reveals Design of ‘iPhone 8’ Rival", "performance_score": 0, "site": "aluvicro.com", "participants_count": 1, "title_full": "Samsung Galaxy S8 Image Leak Reveals Design of ‘iPhone 8’ Rival", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T17:32:00.000+02:00", "replies_count": 0, "uuid": "c035867b012abf7432570fe7422f72462a93675c"}, "author": "edisonrd", "url": "http://aluvicro.com/samsung-galaxy-s8-image-leak-reveals-design-of-iphone-8-rival/", "ord_in_thread": 0, "title": "Samsung Galaxy S8 Image Leak Reveals Design of ‘iPhone 8’ Rival", "locations": [], "entities": {"persons": [{"name": "evan blass", "sentiment": "none"}, {"name": "blass", "sentiment": "none"}, {"name": "bixby", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}], "locations": [], "organizations": [{"name": "samsung", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 \nReliable mobile phone leaker Evan Blass this morning posted what looks like an official press image of the Galaxy S8, Samsung’s first flagship phone of 2017. \nComing on the back of last year’s Note7 debacle , the S8 represents a hopeful comeback for Samsung’s smartphone business and is likely to be the biggest rival to Apple’s radically redesigned “ iPhone 8 ” expected to launch later this year. I think this is what you’ve been waiting for. pic.twitter.com/FvYfsLOy0R \n— Evan Blass (@evleaks) March 1, 2017 \nThe single rendered image appears to confirm the expected new minimal-bezel design and the absence of a home button on the front of the handset, with the larger edge-to-edge curved OLED display showing launch icons in the bottom corners of the screen. \nOn the right side of the handset is a power button, with those on the left side likely to be volume controls and a separate button to activate Bixby, Samsung’s new virtual assistant, developed by the original creators of Siri . \nIt’s unclear from the picture which model size is shown, but the available display sizes of its Quad HD+ Super AMOLED panel will reportedly be 5.8 inches and 6.2 inches, according to Blass. The screen also teases the Galaxy S8 launch date of March 29, as confirmed by Samsung during its relatively low-profile appearance at the Mobile World Congress. \nFurther spec details have yet to be confirmed, but the S8 is expected to feature the Exynos 9 Series 8895 processor, Samsung’s first chip built on 10-nanometer FinFET process technology, along with 4GB of RAM and at least 64GB of internal storage, with a 12 megapixel rear camera and an 8 megapixel front camera also in the offing. \nApple is widely expected to use Samsung-made AMOLED display technology in at least one of three of its possible phones this year. Compared to LCD screens, OLED displays are thinner, lighter, and offer more flexibility, making modifications to a phone’s form factor and geometry easier to undertake. \nWith an edge-to-edge design, the “iPhone” 8 is said to be similar in size to the 4.7-inch iPhone, but with a display the size of the 5.5-inch iPhone. Rumors suggest it will feature a 5.8-inch display with 5.15 inches of usable area, with the rest given over to a “ function area ” for virtual buttons. Apple is expected to release its new iPhone line-up in the fall.", "external_links": [], "published": "2017-03-01T17:32:00.000+02:00", "crawled": "2017-03-01T14:34:44.858+02:00", "highlightTitle": ""}