{"organizations": [], "uuid": "2aa0aea02db0e64cca5a964d8d5cb4bee570c1f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mrnicholaslocke.wordpress.com", "main_image": "", "site_section": "https://mrnicholaslocke.wordpress.com", "section_title": "Xiaomi Announces Mi 5C With Self-Developed Surge S1 SOC; Scores More than Snapdragon 625 on GeekBench! – Site Title", "url": "https://mrnicholaslocke.wordpress.com/2017/03/01/xiaomi-announces-mi-5c-with-self-developed-surge-s1-soc-scores-more-than-snapdragon-625-on-geekbench", "country": "US", "title": "Xiaomi Announces Mi 5C With Self-Developed Surge S1 SOC; Scores More than Snapdragon 625 on GeekBench!", "performance_score": 0, "site": "wordpress.com", "participants_count": 1, "title_full": "Xiaomi Announces Mi 5C With Self-Developed Surge S1 SOC; Scores More than Snapdragon 625 on GeekBench!", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T14:28:00.000+02:00", "replies_count": 0, "uuid": "2aa0aea02db0e64cca5a964d8d5cb4bee570c1f6"}, "author": "mrnicholaslocke", "url": "https://mrnicholaslocke.wordpress.com/2017/03/01/xiaomi-announces-mi-5c-with-self-developed-surge-s1-soc-scores-more-than-snapdragon-625-on-geekbench", "ord_in_thread": 0, "title": "Xiaomi Announces Mi 5C With Self-Developed Surge S1 SOC; Scores More than Snapdragon 625 on GeekBench!", "locations": [], "entities": {"persons": [{"name": "xiaomi mi box", "sentiment": "none"}, {"name": "helio", "sentiment": "none"}, {"name": "xiaomi", "sentiment": "none"}, {"name": "mediatek helio", "sentiment": "none"}], "locations": [{"name": "mali", "sentiment": "none"}, {"name": "xiaomi", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "huawei", "sentiment": "none"}, {"name": "hisilicon kirin", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "dsp", "sentiment": "none"}, {"name": "indian business of tech", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "mi tv india debut", "sentiment": "none"}, {"name": "gpu", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "qualcomm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\n//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js \n\n(adsbygoogle = window.adsbygoogle || []).push({}); \nChipsets powering smartphones had been majorly developed by only specific companies like Qualcomm, Intel and MediaTek. However, smartphone manufacturers themselves started getting into the business, like Apple’s A series, Samsung’s Exynos and recently Huawei’s HiSilicon Kirin SoCs.\nXiaomi, in a series of elaborative tweets, unveiled its own completely in-house developed chip – Surge S1. This means that Xiaomi will also move most of its smartphones, if only partially, to its own chips instead of relying on vendors.\nSurge S1 is the first generation of in-house built series, completely designed and developed by Xiaomi. The planning of this processor actually began back in October 2014, and took 28 months to go into manufacturing. Xiaomi Mi 5C will be the first smartphone from Xiaomi to feature this processor.\n#SurgeS1 is our first-gen SoC chipset that’s bringing innovation to the center of your smartphone. Completely designed & developed in-house! http://pic.twitter.com/Zk2NG6A1vy \n— Mi (@xiaomi) February 28, 2017 \n//platform.twitter.com/widgets.js \nFeatures of Surge S1 The Surge S1’s processor is a 64-bit Octa-core processor with eight A53 cores. Four cores operate at 2.2GHz frequency, while the other four operate at 1.4GHz. The higher cores kick in when high performance is required, otherwise the less powerful cores carry out all the processes.\nThis chipset is based on Mali T860 quad-core GPU that promises 40% improved power efficiency over the previous gen GPU. Xiaomi claims that the chipsets are extremely power efficient and based on big.LITTLE design they can work on real-time switching.\n\nThe chipset also has a 32-bit high performance DSP for better voice processing, and also dual microphones that eliminate static and background noise. The 14-bit dual ISP enhances image processing capabilities and the Surge ISP algorithm improves camera light sensitivity by up to 150%.\nComing to the GeekBench 4.0 CPU multi-core test, Surge S1 scores a whopping 3,399, whereas Snapdragon 625 scores 2,824. MediaTek Helio P10 scores a meagre 2,702 and Helio P20 scores the highest 3,872. P20 is clocked at 2.3GHz so isn’t a fair comparison.\nXiaomi is launching this chipset in their Mi 5C smartphone first, which is an elegant looking device and more affordable than Mi 5 . The phone will be available in an all metal body in Black, Gold and Rose Gold colour variants.\nThe company claims that with Surge S1 and 2,860mAh battery, the phone gives a full day of battery, but this needs to be tested in multiple conditions because the usage varies from person to person. The phone also has fast charging built in.\nMi 5C will come with 5.15-inch JDI display with thin bezels, 3GB of RAM and 64GB internal memory and a 12MP rear camera. The phone has been launched for the Chinese market, but India launch is not confirmed yet. It should be available in another month or so, considering it is going to get upgraded to Android 7.1 Nougat this month.\nThe chipset in Mi 5C looks promising on paper, but a full review and comparison needs to be done to assess its prowess. Nevertheless, it is good to see Chinese companies cutting their dependence on Qualcomm and MediaTek, but then they need to ensure the quality standards are at par.\nCheck These Related Articles! [Updated] Xiaomi Launches 3 Phones: Mi3 @13999, RedMi Note @ 9999 Red Mi1S @6999 The Gadget Buzz: Xiaomi Mi Box, Mi TV India Debut, New Apple iPods, Moto G 3rd Gen Leaks And More Xiaomi Enters India Sooner Than Expected. Can They Become A Dominant Player? The post Xiaomi Announces Mi 5C With Self-Developed Surge S1 SOC; Scores More than Snapdragon 625 on GeekBench! first appeared on Trak.in . Trak.in Mobile Apps: Android | iOS . \nfrom Trak.in – Indian Business of Tech, Mobile & Startups http://ift.tt/2lxl14V ", "external_links": [], "published": "2017-03-01T14:28:00.000+02:00", "crawled": "2017-03-01T09:28:31.318+02:00", "highlightTitle": ""}