{"organizations": [], "uuid": "5d28a9c6aa2a0a7d0078220ed4176bfca196ddec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "puplictech.blogspot.com", "main_image": "", "site_section": "http://puplictech.blogspot.com/", "section_title": "Puplic tech", "url": "http://puplictech.blogspot.com/2017/03/microsoft-intends-to-bring-mixed.html", "country": "US", "title": "Microsoft intends to bring the mixed reality content to Xbox One devices", "performance_score": 0, "site": "blogspot.com", "participants_count": 1, "title_full": "Microsoft intends to bring the mixed reality content to Xbox One devices", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-04T15:26:00.000+02:00", "replies_count": 0, "uuid": "5d28a9c6aa2a0a7d0078220ed4176bfca196ddec"}, "author": "Eslam Elslaimi (noreply@blogger.com)", "url": "http://puplictech.blogspot.com/2017/03/microsoft-intends-to-bring-mixed.html", "ord_in_thread": 0, "title": "Microsoft intends to bring the mixed reality content to Xbox One devices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "microsoft", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "acer", "sentiment": "none"}, {"name": "sdk", "sentiment": "none"}, {"name": "microsoft corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It's no secret that Microsoft is interested in much augmented reality technology, it became clear this was evident after the company detects helmet smart HoloLens. And so far it has been augmented reality experience offered by a helmet HoloLens limited to personal computers, which PC, but Microsoft Corp. recently announced that it plans to bring the mixed reality content to gaming platforms as well. It should be noted that the mixed reality is one of the phrases that launches on augmented reality technology so that this technology is also designed to blend the virtual world and the real world.\nAccording to Microsoft, however, she declared, saying: \"We are also happy telling you that Windows Mixed Reality experiences will see the light on other devices with the passage of time, and this is regardless of personal computers and helmet HoloLens. We have a plan to bring the mixed reality content to Xbox One devices, including Project Scorpio device in the year 2018. \"\nMoreover, Microsoft has also revealed helmet Windows Acer Mixed Reality Development Edition, which was announced at the annual conference of the Games GDC. According to Microsoft, however, she declared, saying: \"When we will start issuing development package for developers this month, the package will include a helmet Acer, along with documents and access to beta versions newer system Windows 10, as well as SDK software development package to enable developers to build applications Indeed mixed. \"\nIt will be interesting to see how this will affect the gaming sector. We know that Apple is also interested in augmented reality technology, but now it certainly seems that Microsoft is leading the way when it comes to market mixed reality technology or rather augmented reality technology.", "external_links": [], "published": "2017-03-04T15:26:00.000+02:00", "crawled": "2017-03-04T10:26:35.596+02:00", "highlightTitle": ""}