{"organizations": [], "uuid": "483cca193090bec1f91821283302baf46830b31c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "shikoworld.blogspot.com", "main_image": "", "site_section": "http://shikoworld.blogspot.com/", "section_title": "Shiko World", "url": "http://shikoworld.blogspot.com/2017/03/the-last-achievement-for-oculus-co.html", "country": "US", "title": "the last achievement for oculus co-founder", "performance_score": 0, "site": "blogspot.com", "participants_count": 1, "title_full": "the last achievement for oculus co-founder", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-02T04:18:00.000+02:00", "replies_count": 0, "uuid": "483cca193090bec1f91821283302baf46830b31c"}, "author": "amr Hamdi (noreply@blogger.com)", "url": "http://shikoworld.blogspot.com/2017/03/the-last-achievement-for-oculus-co.html", "ord_in_thread": 0, "title": "the last achievement for oculus co-founder", "locations": [], "entities": {"persons": [{"name": "head of rift", "sentiment": "none"}, {"name": "barra", "sentiment": "none"}, {"name": "brendan iribe", "sentiment": "none"}, {"name": "nate mitchell", "sentiment": "none"}, {"name": "hugo barra", "sentiment": "none"}, {"name": "mitchell", "sentiment": "none"}, {"name": "iribe", "sentiment": "none"}, {"name": "xiaomi", "sentiment": "none"}, {"name": "palmer luckey", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "razer", "sentiment": "none"}, {"name": "sony", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "oculus", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "htc", "sentiment": "none"}, {"name": "macbook pro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nWhile so many virtual reality hardware companies have been tasked only with selling their own product, Oculus has had the intense challenge of building the entire industry’s ecosystem for the last several years. That growth has come with some hiccups by way of lawsuits, product launch delays and executive shakeups, but Oculus is still very much alive-and-well under its parent company Facebook, which has placed the company at the forefront of its 10-year project to bring VR mainstream. I had a chance to sit down with Oculus’ co-founder and Head of Rift Nate Mitchell to hear about the company’s latest price cuts, some of the internal reorganizations within the company and what the likelihood was of getting Rift support on the Mac anytime soon. He’s been trained how to talk to the media quite well, but he had a few key insights to share on what’s going on over at the company. First things first, today Oculus announced that they are slashing the prices of the Rift and Touch by $100 each, bringing the price to $598 for both. Part of this aggressive move is to drive more Rift users to Touch, even though adoption has already been “very good,” according to Mitchell. “I’m super excited to hear so much momentum behind Touch,” Mitchell says. “Super successful accessories of system-seller experiences have an attach-rate of somewhere in the twenty to thirty percent range, which is unheard of for a successful product. Our overall Touch attach is much, much higher.” \nCo-founder Palmer Luckey unveils the Oculus Touch motion controller As Oculus looks to drive overall adoption of their entire ecosystem, one thing they’ve been looking at is lowering system requirements for the devices that power the Rift. Oculus has spent much of the past year working on software work arounds that allow users with less bleeding edge-specced computers to have satisfying experience on Rift. The two biggest advances have been the perplexedly-named Asynchronous Timewarp (ATW) and Asynchronous Spacewarp (ASW) which take some technical voodoo to ensure that frame rates are kept high and that hiccups are left indistinguishable thanks to some software wizardry. During out interview, I notice Mitchell’s work laptop, a last-gen MacBook Pro, sitting in the corner of the room, at which point I ask about the Rift’s lack of support for Mac. Earlier Oculus development kits initially supported some of Apple’s more full-featured computers, but the more stringent spec requirements of the Rift ultimately left Mac users out of the loop for the product’s consumer launch. ATW and ASW have been pulling requirements lower-and-lower, and have, according to Mitchell “really opened up more mobile GPUs and laptops.” Mitchell tells me that Mac support is still something the company is looking at, but it may not be coming for a bit. “It’s something near-and-dear to my heart, we’re just not there quite yet,” he says. “We do want to do OS X (macOS) support for Rift, it’s not something that’s currently on the roadmap for— I can even say— the next six months,” Mitchell tells me. “We will continue to revisit it, the real challenge for us is just how much we invest into that space because it does require a lot of our time and energy to get it right and to deliver a great experience.” The Rift is not alone in its lack of support for macOS, HTC’s Vive VR headset also lacks official compatibility with the operating system. The only relatively high-profile PC-tethered HMD is Razer’s OSVR headset which is still all sorts of a developer/tinkerer product. On the topic of other VR headsets, I asked Mitchell about recent PS VR sales numbers that have been released, detailing the company has sold nearly one million devices in the past four months. Though Mitchell clearly sees Rift and Touch as the superior experience and ecosystem, he was quick to congratulate Sony, though he didn’t seem in any hurry to offer up sales statistics of his own. “I think it’s fantastic; I think there’s a huge amount of excitement in this market on both the consumer side and the developer side,” Mitchell said, particularly heaping praise on Sony’s content lineup. While chatting sales, I questioned Mitchell briefly on the recent news that Oculus was exiting nearly 40% of the 500 Best Buy retail locations that they have had demo stations in. Mitchell was quick to respond that the move was part of more of an “ebb and flow” aimed at making the most of the holiday season rather than the mass exit many in the media had framed it as. “You’re going to see us continue to ramp up retail stores based on seasonality,” he said. The holiday season was a time where a lot of changes occurred at Oculus, including some rather strange internal restructuring. In December it was announced out-of-the-blue in December that co-founder Brendan Iribe would be stepping down as CEO of the company and would be taking on the new role of VP of PC VR. Replacing Iribe is Xiaomi’s Hugo Barra, acting not as a new CEO but as Facebook’s VP of Virtual Reality working closely with CEO Mark Zuckerberg to define the broader virtual reality direction of the company. The change in leadership up top has been seen by many as an effort by Facebook to assert more control over the company it acquired in March of 2014 for $2 billion. Mitchell, who prior to the restructuring was VP of Product, now Head of Rift, wasn’t too verbose on the developing relationship with Facebook, saying that Barra was really only getting into his new role in the next couple weeks. In the past several months, hardware-minded executives at Oculus have seen their roles shift towards being wholly focused on either mobile or PC-based experiences, not both. Mitchell didn’t have much to share about the company’s all-in-one headset, which Facebook CEO Mark Zuckerberg unveiled at Oculus developer conference late last year, though he did tell me that under the company’s new leadership structure, the device was being developed outside the PC VR team in its own division. “That’s something we’ll be talking more about — probably this year,” he added. Mitchell had much more to share about some of the more nitty gritty VR items, saying that room-scale tracking on the Rift was going to be seeing some big improvements moving forward and that the feature would be losing its “experimental” designation soon. He also doubled down on the company’s commitment to continuing to have Xbox One gamepad support, saying that even as Touch adoption surges, users without it wouldn’t see the rug pulled out from under them. Overall, it’s clear that there’s a lot going on with Oculus’ product ambitions. For a technology as technically complex and existentially confusing as virtual reality, that’s not too surprising, but it seems Oculus and Facebook are up to the challenge as they focus on not only building products, but building an industry. ", "external_links": [], "published": "2017-03-02T04:18:00.000+02:00", "crawled": "2017-03-01T23:21:27.629+02:00", "highlightTitle": ""}