{"organizations": [], "uuid": "bb1e0dc9e9f5196cf4ed66428054aeddf34e27d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.america-retail.com", "main_image": "", "site_section": "http://www.america-retail.com", "section_title": "AmĂŠrica Retail", "url": "http://www.america-retail.com/tendencias-e-innovacion/innovacion-viber-launches-in-chat-shopping-platform/", "country": "US", "title": "InnovaciĂłn: Viber launches in-chat shopping platform", "performance_score": 0, "site": "america-retail.com", "participants_count": 1, "title_full": "InnovaciĂłn: Viber launches in-chat shopping platform", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T10:40:00.000+02:00", "replies_count": 0, "uuid": "bb1e0dc9e9f5196cf4ed66428054aeddf34e27d8"}, "author": "HaydĂŠe AlarcĂłn", "url": "http://www.america-retail.com/tendencias-e-innovacion/innovacion-viber-launches-in-chat-shopping-platform/", "ord_in_thread": 0, "title": "InnovaciĂłn: Viber launches in-chat shopping platform", "locations": [], "entities": {"persons": [{"name": "viber", "sentiment": "none"}, {"name": "agaoua", "sentiment": "none"}, {"name": "djamel agaoua", "sentiment": "none"}], "locations": [{"name": "viber", "sentiment": "none"}], "organizations": [{"name": "facebook messenger", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "kik", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " \nViber is embracing the evolution of messaging beyond simple SMS capabilities with the launch of a new in-chat shopping experience for users, hoping to compete with other monetized messaging applications such as WeChat.\nThe platform allows consumers to shop for items through the Viber app as well as recommend them products based on their chats. This move represents Viber’s attempt to further blur the lines between messaging and ecommerce.\nRead Also: Catman: Redefining the customer reward strategy \n“Messaging is just starting its journey on mobile devices,” Viber’s CEO Djamel Agaoua. “By adding e-commerce capabilities, Viber is bringing a solution for mobile shoppers to share their passion with the people that matter to them in a couple of taps.”\nSocial commerce \nMessaging has been at the heart of a lot of discussion about mobile for a while now.\nIn a way, messaging has done for mobile what mobile has done for the retail industry at large – shaken up traditional notions of things work.\nSince the inception of the smartphone, apps have been the dominant mode of engaging with consumers for brands, but in the past year or so, messaging has really come into its own as a powerful tool for mobile engagement.\nThis movement is being led by some of the biggest names in messaging – namely, Facebook Messenger, Kik, Viber, WhatsApp and a few others.\nMessaging apps are increasingly expanding what they can do with the help of chatbots and other features.\nNow, Viber is taking the next step by introducing a full ecommerce platform into its chat app.\nThe new feature is meant to be a type of social commerce, where consumers can send each other links to products and images which can be purchased right there through the chat app, rather than having to open a new app or browser.\nThe app will also recommend items to consumers, who can star brands and products they like to further personalize those recommendations.\nConsumers can shop and chat at the same time, asking for opinions and getting feedback from friends before they make any purchasing decisions.\nMessaging shift \nThis move from Viber is significant in that it merges the disparate worlds of social media and ecommerce.\nBy integrating the two into a single screen through a single app, Viber is turning shopping into a social experience.\nAt the same time, it is also expanding what messaging apps can do – a significant shift that will likely be emulated by Viber’s competitors.\nBut this shift did not begin with Viber. Instead, messaging apps have been inching towards adding more commercial options for several months now, mainly in the form of chatbots.\nFor example, Domino’s and Facebook recently rolled out a full-fledged ordering bot through Facebook Messenger.\nFrom another angle, many brands have integrated messaging apps into Apple’s iMessage, such as this recent one from Realtor.com.\nThese moves represent the ways in which messaging is slowly encroaching on territory traditionally held by mobile apps.\n“This is just the first step in a very exciting journey we’re about to take with our users, and it’s only going to get better as we add more partners and gather more feedback,” Mr. Agaoua said.\n \nFuente: mobilecommercedaily ", "external_links": [], "published": "2017-03-01T10:40:00.000+02:00", "crawled": "2017-03-01T05:45:15.899+02:00", "highlightTitle": ""}