{"organizations": [], "uuid": "dc80044076982bd30cf7c9f8219f5dd8001f3bae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newcydiatweaks.com", "main_image": "", "site_section": "http://www.newcydiatweaks.com/", "section_title": "NewCydiaTweaks", "url": "http://www.newcydiatweaks.com/2017/02/why-choose-macbook-pro-if-you-are.html", "country": "US", "title": "Why choose a MacBook Pro if you are studying engineering?", "performance_score": 0, "site": "newcydiatweaks.com", "participants_count": 1, "title_full": "Why choose a MacBook Pro if you are studying engineering?", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T08:48:00.000+02:00", "replies_count": 0, "uuid": "dc80044076982bd30cf7c9f8219f5dd8001f3bae"}, "author": "Anshul Verma (noreply@blogger.com)", "url": "http://www.newcydiatweaks.com/2017/02/why-choose-macbook-pro-if-you-are.html", "ord_in_thread": 0, "title": "Why choose a MacBook Pro if you are studying engineering?", "locations": [], "entities": {"persons": [{"name": "virtualbox", "sentiment": "none"}], "locations": [{"name": "ubuntu", "sentiment": "none"}], "organizations": [{"name": "macbook", "sentiment": "none"}, {"name": "msi", "sentiment": "none"}, {"name": "matlab", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "mission control", "sentiment": "none"}, {"name": "wikipedia", "sentiment": "none"}, {"name": "vmware", "sentiment": "none"}, {"name": "fpga", "sentiment": "none"}, {"name": "macbook pro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThis is a question that many of us have done, both in the comments and in our social networks.  So today we are going to answer this question.  Why a MacBook Pro if you're a student engineering? What can a MacBook Pro bring to a student? Let's look at the advantages that a MacBook Pro can bring to a student.  Let's start by analyzing the device itself, that is,  the hardware of the MacBook Pro  . It seems that Apple is putting to diet to the MacBook.  Why do I say it?  Because every model that passes the MacBook are getting  smaller  .  Just look at the MacBook and MacBook Pro this year.  In fact, they are so thin that they can not have USB-A (the \"normal\") ports, as it would not fit. Well, is this good?  Not good not bad.  It has the great  advantage  that  weighs very little  , and thus is easier to carry in a backpack or briefcase.  Related to this, the MacBook Pro is also thinner than an MSI, for example.  This also makes it  more comfortable to carry  and use in class. And what is the  disadvantage  ?  The drawback of such thinness is that you will need an  adapter  for  everything  .  Above all this is aggravated in the last model, because you can not even connect a normal pendrive if you do not have the adapter.  Still, it does not cost anything to carry the adapters in the backpack.  For example, I have a MacBook Pro of the old ones, so I do not have to carry any USB or Ethernet adapter, but I do carry a VGA adapter in case the flies. Although, despite its thinness is another  advantage  in the MacBook amazing.  This is the  battery  .  Despite being thin, the battery of the MacBook and MacBook Pro lasts for many hours.  This is great for those who must spend many hours in college class in class. Benefits that macOS can bring to an engineering student But as we all know, a Mac is nothing without its software.  That is why we will now analyze what  advantages MacOS brings  . A stable and optimized operating system MacOS is a great operating system.  It is a very  stable  operating system  and will never let you down.  In addition, it is optimized for a specific software, so it offers a great performance in hardware that could be considered normal. In addition, being a  Unix-based  operating system  , this will facilitate the work if you study a subject of programming.  This is because  Linux  and Unix, and therefore macOS,  share most of the libraries  , which guarantees a high compatibility between the software developed for macOS and Linux.  Something that does not happen with Windows, where standard C libraries change.  Therefore, if you are a student of engineering related to programming, this will be of help. The most comfortable operating system you can have I've never tried an operating system more  convenient  to work that macOS. Although more and more operating systems like Ubuntu and Windows are implementing some of these ideas, I think it is still far from the comfort that macOS can bring.  The  Launchpad  ,  Mission Control  ,  Expose  ,  Spotlight  ,  Spaces  , Full  Screen  Applications  and  Screen  Split  make this OS quite comfortable. But I still did not mention what happens to me is the most  comfortable  of all:  multitouch  gestures   .  Yes, for me the best of macOS are the multi-touch gestures that incorporates.  Do you want to switch applications in full screen?  No problem, slide four fingers left or right.  Do you want to see all the windows you have open?  Simply slide four fingers up.  What if I just want to see the open windows of the application I'm working on?  Instead of up, slide down.  What do you not know what that word means?  No problem  , push it with three fingers and you will get the dictionary definition, translation or entry in Wikipedia. You will have at your disposal all the tools you need Formerly  there were few companies that really bet on making software for Mac, let alone for Linux.  But things have changed, and not only do large companies develop for macOS, but smaller companies have also seen the potential of the platform and already have versions of their software for Mac. For example, if you need to use AutoCAD, Mathematica, MATLAB, GNS3, Eclipse or any other technical application you may need in your engineering, you will not have any problems.  Most of the applications will have them there at your disposal. And what if a particular one does not have it?  It happened to me, for example, in a subject of digital electronics.  To program the board (FPGA) we were using we need an old program from the manufacturer.  This version of the program, unlike the current versions, was not available for macOS or Linux.  What did I do?  Very simple, I installed it using  Wine  , which is a great tool that allows us to run Windows programs natively on Mac. But Wine has its limitations, and it does not work with all the programs there and there.  Therefore, in those cases there is no choice but to resort to a  virtual machine  .  Although fortunately, we have great tools that facilitate our task.  My favorite virtual machine manager is Parallels, which has a great integration with the operating system and has a high performance.  In addition, VMware and VirtualBox also stand out in the VM market. So, as we can see, in the rare case that we do not have the program we need, we can always turn to Wine, and in its absence a virtual machine. Conclusion As we can see, it is interesting to consider the MacBook Pro if you are studying, or will do, an engineering.  Although, obviously not all are advantages, but to me personally I find the  perfect partner  . In addition,  students have a discount of 12%  on Apple computers, so that this promotes a little more Mac purchase. ", "external_links": [], "published": "2017-03-01T08:48:00.000+02:00", "crawled": "2017-03-01T03:51:04.140+02:00", "highlightTitle": ""}